openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/*
 * Copyright (c) 2016, Dialog Semiconductor
 * All rights reserved.
 * Redistribution and use in source and binary forms, with or without modification, 
 * are permitted provided that the following conditions are met:
 * 1. Redistributions of source code must retain the above copyright notice, 
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation 
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holder nor the names of its contributors 
 *    may be used to endorse or promote products derived from this software without 
 *    specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
 * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
 * INDIRECT, INCIDENTAL,  SPECIAL,  EXEMPLARY,  OR CONSEQUENTIAL DAMAGES (INCLUDING, 
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED 
 * OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * @file     DA14680BA.h
 * @brief    CMSIS Cortex-M0 Peripheral Access Layer Header File for DA14680BA from Dialog.
 * @version  V1.2
 * @date     9. August 2016
 * @note     Generated with SVDConv V2.87g
 *           from CMSIS SVD File 'DA14680BA.xml'
 *           Version 1.2
 */



/** @addtogroup Dialog
  * @{
  */


/** @addtogroup DA14680BA
  * @{
  */

#ifndef DA14680BA_H
#define DA14680BA_H

#ifdef __cplusplus
extern "C" {
#endif


/* -------------------------  Interrupt Number Definition  ------------------------ */

/**
  * @brief Interrupt Number Definition
  */

typedef enum {
/* -------------------  Cortex-M0 Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NonMaskableInt_IRQn           = -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */
  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */
  PendSV_IRQn                   =  -2,              /*!<  14  Pendable request for system service                              */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* --------------------  DA14680BA Specific Interrupt Numbers  -------------------- */
  BLE_WAKEUP_LP_IRQn            =   0,              /*!<   0  BLE_WAKEUP_LP                                                    */
  BLE_GEN_IRQn                  =   1,              /*!<   1  BLE_GEN                                                          */
  FTDF_WAKEUP_IRQn              =   2,              /*!<   2  FTDF_WAKEUP                                                      */
  FTDF_GEN_IRQn                 =   3,              /*!<   3  FTDF_GEN                                                         */
  RFCAL_IRQn                    =   4,              /*!<   4  RFCAL                                                            */
  COEX_IRQn                     =   5,              /*!<   5  COEX                                                             */
  CRYPTO_IRQn                   =   6,              /*!<   6  CRYPTO                                                           */
  MRM_IRQn                      =   7,              /*!<   7  MRM                                                              */
  UART_IRQn                     =   8,              /*!<   8  UART                                                             */
  UART2_IRQn                    =   9,              /*!<   9  UART2                                                            */
  I2C_IRQn                      =  10,              /*!<  10  I2C                                                              */
  I2C2_IRQn                     =  11,              /*!<  11  I2C2                                                             */
  SPI_IRQn                      =  12,              /*!<  12  SPI                                                              */
  SPI2_IRQn                     =  13,              /*!<  13  SPI2                                                             */
  ADC_IRQn                      =  14,              /*!<  14  ADC                                                              */
  KEYBRD_IRQn                   =  15,              /*!<  15  KEYBRD                                                           */
  IRGEN_IRQn                    =  16,              /*!<  16  IRGEN                                                            */
  WKUP_GPIO_IRQn                =  17,              /*!<  17  WKUP_GPIO                                                        */
  SWTIM0_IRQn                   =  18,              /*!<  18  SWTIM0                                                           */
  SWTIM1_IRQn                   =  19,              /*!<  19  SWTIM1                                                           */
  QUADEC_IRQn                   =  20,              /*!<  20  QUADEC                                                           */
  USB_IRQn                      =  21,              /*!<  21  USB                                                              */
  PCM_IRQn                      =  22,              /*!<  22  PCM                                                              */
  SRC_IN_IRQn                   =  23,              /*!<  23  SRC_IN                                                           */
  SRC_OUT_IRQn                  =  24,              /*!<  24  SRC_OUT                                                          */
  VBUS_IRQn                     =  25,              /*!<  25  VBUS                                                             */
  DMA_IRQn                      =  26,              /*!<  26  DMA                                                              */
  RF_DIAG_IRQn                  =  27,              /*!<  27  RF_DIAG                                                          */
  TRNG_IRQn                     =  28,              /*!<  28  TRNG                                                             */
  DCDC_IRQn                     =  29,              /*!<  29  DCDC                                                             */
  XTAL16RDY_IRQn                =  30,              /*!<  30  XTAL16RDY                                                        */
  PLL_LOCK_IRQn                 =  31               /*!<  31  PLL_LOCK                                                         */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS_DA14680BA
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the Cortex-M0 Processor and Core Peripherals---------------- */
#define __CM0_REV                 0x0100            /*!< Cortex-M0 Core Revision                                               */
#define __MPU_PRESENT                  0            /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS               2            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0.h"                               /*!< Cortex-M0 processor and core peripherals                              */
#include "system_DA14680.h"                       /*!< DA14680BA System                                                      */


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


