openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/** @addtogroup Device_Peripheral_Registers_DA14680BA
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif









/* ================================================================================ */
/* ================                    AES_HASH                    ================ */
/* ================================================================================ */


/**
  * @brief AES_HASH registers (AES_HASH)
  */

typedef struct {                                    /*!< (@ 0x40020000) AES_HASH Structure                                     */
  __IO uint32_t  CRYPTO_CTRL_REG;                   /*!< (@ 0x40020000) Crypto Control register                                */
  __IO uint32_t  CRYPTO_START_REG;                  /*!< (@ 0x40020004) Crypto Start calculation                               */
  __IO uint32_t  CRYPTO_FETCH_ADDR_REG;             /*!< (@ 0x40020008) Crypto DMA fetch register                              */
  __IO uint32_t  CRYPTO_LEN_REG;                    /*!< (@ 0x4002000C) Crypto Length of the input block in bytes              */
  __IO uint32_t  CRYPTO_DEST_ADDR_REG;              /*!< (@ 0x40020010) Crypto DMA destination memory                          */
  __IO uint32_t  CRYPTO_STATUS_REG;                 /*!< (@ 0x40020014) Crypto Status register                                 */
  __IO uint32_t  CRYPTO_CLRIRQ_REG;                 /*!< (@ 0x40020018) Crypto Clear interrupt request                         */
  __IO uint32_t  CRYPTO_MREG0_REG;                  /*!< (@ 0x4002001C) Crypto Mode depended register 0                        */
  __IO uint32_t  CRYPTO_MREG1_REG;                  /*!< (@ 0x40020020) Crypto Mode depended register 1                        */
  __IO uint32_t  CRYPTO_MREG2_REG;                  /*!< (@ 0x40020024) Crypto Mode depended register 2                        */
  __IO uint32_t  CRYPTO_MREG3_REG;                  /*!< (@ 0x40020028) Crypto Mode depended register 3                        */
  __I  uint32_t  RESERVED[53];
  __IO uint32_t  CRYPTO_KEYS_START;                 /*!< (@ 0x40020100) Crypto First position of the AES keys storage
                                                         memory                                                                */
} AES_HASH_Type;


/* ================================================================================ */
/* ================                     ANAMISC                    ================ */
/* ================================================================================ */


/**
  * @brief ANAMISC registers (ANAMISC)
  */

typedef struct {                                    /*!< (@ 0x50001B00) ANAMISC Structure                                      */
  __I  uint16_t  RESERVED;
  __IO uint16_t  ANA_TEST_REG;                      /*!< (@ 0x50001B02) Analog test registers                                  */
  __I  uint32_t  RESERVED1;
  __IO uint16_t  CHARGER_CTRL1_REG;                 /*!< (@ 0x50001B08) Charger control register 1                             */
  __IO uint16_t  CHARGER_CTRL2_REG;                 /*!< (@ 0x50001B0A) Charger control register 2                             */
  __IO uint16_t  CHARGER_STATUS_REG;                /*!< (@ 0x50001B0C) Charger status and trimming register                   */
  __I  uint16_t  RESERVED2[25];
  __IO uint16_t  SOC_CTRL1_REG;                     /*!< (@ 0x50001B40) Fuel Gauge Control register 1                          */
  __IO uint16_t  SOC_CTRL2_REG;                     /*!< (@ 0x50001B42) Fuel Gauge Control register 2                          */
  __IO uint16_t  SOC_CTRL3_REG;                     /*!< (@ 0x50001B44) Fuel Gauge Control register 3                          */
  __IO uint16_t  SOC_ADD2CH_REG;                    /*!< (@ 0x50001B46) Fuel Gauge manually add extra charge to SOC_CHARGE_CNTRx_RE
                                                         G                                                                     */
  __IO uint16_t  SOC_CHARGE_CNTR1_REG;              /*!< (@ 0x50001B48) Fuel Gauge Charge counter bits 15-0                    */
  __IO uint16_t  SOC_CHARGE_CNTR2_REG;              /*!< (@ 0x50001B4A) Fuel Gauge Charge counter bits 31-16                   */
  __IO uint16_t  SOC_CHARGE_CNTR3_REG;              /*!< (@ 0x50001B4C) Fuel Gauge Charge counter bits 39-32                   */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  SOC_CHARGE_AVG_REG;                /*!< (@ 0x50001B50) Fuel Gauge Average charge counter                      */
  __IO uint16_t  SOC_STATUS_REG;                    /*!< (@ 0x50001B52) Fuel Gauge Status register                             */
  __IO uint16_t  SOC_EXT_IN_REG;                    /*!< (@ 0x50001B54) Fuel Gauge input test register                         */
  __IO uint16_t  SOC_EXT_OUT_REG;                   /*!< (@ 0x50001B56) Fuel Gauge output test register                        */
  __I  uint32_t  RESERVED4[2];
  __IO uint16_t  CLK_REF_SEL_REG;                   /*!< (@ 0x50001B60) Select clock for oscillator calibration                */
  __IO uint16_t  CLK_REF_CNT_REG;                   /*!< (@ 0x50001B62) Count value for oscillator calibration                 */
  __IO uint16_t  CLK_REF_VAL_L_REG;                 /*!< (@ 0x50001B64) DIVN reference cycles, lower 16 bits                   */
  __IO uint16_t  CLK_REF_VAL_H_REG;                 /*!< (@ 0x50001B66) DIVN reference cycles, upper 16 bits                   */
} ANAMISC_Type;


/* ================================================================================ */
/* ================                       APU                      ================ */
/* ================================================================================ */


/**
  * @brief APU registers (APU)
  */

typedef struct {                                    /*!< (@ 0x50004000) APU Structure                                          */
  __IO uint32_t  SRC1_CTRL_REG;                     /*!< (@ 0x50004000) SRC1 control register                                  */
  __IO uint32_t  SRC1_IN_FS_REG;                    /*!< (@ 0x50004004) SRC1 Sample input rate                                 */
  __IO uint32_t  SRC1_OUT_FS_REG;                   /*!< (@ 0x50004008) SRC1 Sample output rate                                */
  __IO uint32_t  SRC1_IN1_REG;                      /*!< (@ 0x5000400C) SRC1 data in 1                                         */
  __IO uint32_t  SRC1_IN2_REG;                      /*!< (@ 0x50004010) SRC1 data in 2                                         */
  __IO uint32_t  SRC1_OUT1_REG;                     /*!< (@ 0x50004014) SRC1 data out 1                                        */
  __IO uint32_t  SRC1_OUT2_REG;                     /*!< (@ 0x50004018) SRC1 data out 2                                        */
  __IO uint32_t  APU_MUX_REG;                       /*!< (@ 0x5000401C) APU mux register                                       */
  __IO uint32_t  COEF10_SET1_REG;                   /*!< (@ 0x50004020) SRC coefficient 1,0 set 1                              */
  __IO uint32_t  COEF32_SET1_REG;                   /*!< (@ 0x50004024) SRC coefficient 3,2 set 1                              */
  __IO uint32_t  COEF54_SET1_REG;                   /*!< (@ 0x50004028) SRC coefficient 5,4 set 1                              */
  __IO uint32_t  COEF76_SET1_REG;                   /*!< (@ 0x5000402C) SRC coefficient 7,6 set 1                              */
  __IO uint32_t  COEF98_SET1_REG;                   /*!< (@ 0x50004030) SRC coefficient 9,8 set 1                              */
  __IO uint32_t  COEF0A_SET1_REG;                   /*!< (@ 0x50004034) SRC coefficient 10 set 1                               */
  __I  uint32_t  RESERVED[50];
  __IO uint32_t  PCM1_CTRL_REG;                     /*!< (@ 0x50004100) PCM1 Control register                                  */
  __IO uint32_t  PCM1_IN1_REG;                      /*!< (@ 0x50004104) PCM1 data in 1                                         */
  __IO uint32_t  PCM1_IN2_REG;                      /*!< (@ 0x50004108) PCM1 data in 2                                         */
  __IO uint32_t  PCM1_OUT1_REG;                     /*!< (@ 0x5000410C) PCM1 data out 1                                        */
  __IO uint32_t  PCM1_OUT2_REG;                     /*!< (@ 0x50004110) PCM1 data out 2                                        */
} APU_Type;


/* ================================================================================ */
/* ================                       BLE                      ================ */
/* ================================================================================ */


/**
  * @brief BLE registers (BLE)
  */

