openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
typedef struct {                                    /*!< (@ 0x50003200) CHIP_VERSION Structure                                 */
  __IO uint8_t   CHIP_ID1_REG;                      /*!< (@ 0x50003200) Chip identification register 1.                        */
  __IO uint8_t   CHIP_ID2_REG;                      /*!< (@ 0x50003201) Chip identification register 2.                        */
  __IO uint8_t   CHIP_ID3_REG;                      /*!< (@ 0x50003202) Chip identification register 3.                        */
  __IO uint8_t   CHIP_SWC_REG;                      /*!< (@ 0x50003203) Software compatibility register.                       */
  __IO uint8_t   CHIP_REVISION_REG;                 /*!< (@ 0x50003204) Chip revision register.                                */
  __IO uint8_t   CHIP_CONFIG1_REG;                  /*!< (@ 0x50003205) Chip configuration register 1.                         */
  __IO uint8_t   CHIP_CONFIG2_REG;                  /*!< (@ 0x50003206) Chip configuration register 2.                         */
  __IO uint8_t   CHIP_CONFIG3_REG;                  /*!< (@ 0x50003207) Chip configuration register 3.                         */
  __I  uint16_t  RESERVED;
  __IO uint8_t   CHIP_TEST1_REG;                    /*!< (@ 0x5000320A) Chip test register 1.                                  */
  __IO uint8_t   CHIP_TEST2_REG;                    /*!< (@ 0x5000320B) Chip test register 2.                                  */
  __IO uint8_t   CHIP_TEST3_REG;                    /*!< (@ 0x5000320C) Chip test register 3.                                  */
} CHIP_VERSION_Type;


/* ================================================================================ */
/* ================                      COEX                      ================ */
/* ================================================================================ */


/**
  * @brief COEX registers (COEX)
  */

typedef struct {                                    /*!< (@ 0x50002F00) COEX Structure                                         */
  __IO uint16_t  COEX_CTRL_REG;                     /*!< (@ 0x50002F00) COEX Control Register                                  */
  __IO uint16_t  COEX_STAT_REG;                     /*!< (@ 0x50002F02) COEX Status Register                                   */
  __IO uint16_t  COEX_STAT2_REG;                    /*!< (@ 0x50002F04) COEX Status 2 Register                                 */
  __IO uint16_t  COEX_INT_MASK_REG;                 /*!< (@ 0x50002F06) COEX Interrupt Mask Register                           */
  __IO uint16_t  COEX_INT_STAT_REG;                 /*!< (@ 0x50002F08) COEX Interrupt Status Register                         */
  __IO uint16_t  COEX_BLE_PTI_REG;                  /*!< (@ 0x50002F0A) COEX BLE PTI Control Register                          */
  __IO uint16_t  COEX_FTDF_PTI_REG;                 /*!< (@ 0x50002F0C) COEX FTDF PTI Control Register                         */
  __I  uint16_t  RESERVED[2];
  __IO uint16_t  COEX_PRI1_REG;                     /*!< (@ 0x50002F12) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI2_REG;                     /*!< (@ 0x50002F14) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI3_REG;                     /*!< (@ 0x50002F16) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI4_REG;                     /*!< (@ 0x50002F18) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI5_REG;                     /*!< (@ 0x50002F1A) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI6_REG;                     /*!< (@ 0x50002F1C) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI7_REG;                     /*!< (@ 0x50002F1E) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI8_REG;                     /*!< (@ 0x50002F20) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI9_REG;                     /*!< (@ 0x50002F22) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI10_REG;                    /*!< (@ 0x50002F24) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI11_REG;                    /*!< (@ 0x50002F26) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI12_REG;                    /*!< (@ 0x50002F28) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI13_REG;                    /*!< (@ 0x50002F2A) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI14_REG;                    /*!< (@ 0x50002F2C) COEX Priority Register                                 */
  __IO uint16_t  COEX_PRI15_REG;                    /*!< (@ 0x50002F2E) COEX Priority Register                                 */
} COEX_Type;


/* ================================================================================ */
/* ================                     CRG_PER                    ================ */
/* ================================================================================ */


/**
  * @brief CRG_PER registers (CRG_PER)
  */

typedef struct {                                    /*!< (@ 0x50001C00) CRG_PER Structure                                      */
  __I  uint32_t  RESERVED;
  __IO uint16_t  CLK_PER_REG;                       /*!< (@ 0x50001C04) Peripheral divider register                            */
  __I  uint16_t  RESERVED1[29];
  __IO uint16_t  PCM_DIV_REG;                       /*!< (@ 0x50001C40) PCM divider and enables                                */
  __IO uint16_t  PCM_FDIV_REG;                      /*!< (@ 0x50001C42) PCM fractional division register                       */
  __IO uint16_t  PDM_DIV_REG;                       /*!< (@ 0x50001C44) PDM divider and enables                                */
  __IO uint16_t  SRC_DIV_REG;                       /*!< (@ 0x50001C46) SRC divider and enables                                */
  __IO uint16_t  EH_REG;                            /*!< (@ 0x50001C48) EH_REG                                                 */
  __IO uint16_t  USBPAD_REG;                        /*!< (@ 0x50001C4A) USB pads control register                              */
} CRG_PER_Type;


/* ================================================================================ */
/* ================                     CRG_TOP                    ================ */
/* ================================================================================ */


/**
  * @brief CRG_TOP registers (CRG_TOP)
  */

typedef struct {                                    /*!< (@ 0x50000000) CRG_TOP Structure                                      */
  __IO uint16_t  CLK_AMBA_REG;                      /*!< (@ 0x50000000) HCLK, PCLK, divider and clock gates                    */
  __IO uint16_t  CLK_FREQ_TRIM_REG;                 /*!< (@ 0x50000002) Xtal frequency trimming register.                      */
  __I  uint32_t  RESERVED;
  __IO uint16_t  CLK_RADIO_REG;                     /*!< (@ 0x50000008) Radio PLL control register                             */
  __IO uint16_t  CLK_CTRL_REG;                      /*!< (@ 0x5000000A) Clock control register                                 */
  __IO uint16_t  CLK_TMR_REG;                       /*!< (@ 0x5000000C) Clock control for the timers                           */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  PMU_CTRL_REG;                      /*!< (@ 0x50000010) Power Management Unit control register                 */
  __IO uint16_t  SYS_CTRL_REG;                      /*!< (@ 0x50000012) System Control register                                */
  __IO uint16_t  SYS_STAT_REG;                      /*!< (@ 0x50000014) System status register                                 */
  __IO uint16_t  TRIM_CTRL_REG;                     /*!< (@ 0x50000016) Control trimming of the XTAL16M                        */
  __I  uint32_t  RESERVED2[2];
  __IO uint16_t  CLK_32K_REG;                       /*!< (@ 0x50000020) 32 kHz oscillator register                             */
  __IO uint16_t  CLK_16M_REG;                       /*!< (@ 0x50000022) 16 MHz RC and xtal oscillator register                 */
  __IO uint16_t  CLK_RCX20K_REG;                    /*!< (@ 0x50000024) 20KHz RXC-oscillator control register                  */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  BANDGAP_REG;                       /*!< (@ 0x50000028) bandgap trimming                                       */
  __IO uint16_t  ANA_STATUS_REG;                    /*!< (@ 0x5000002A) status bit of analog (power management) circuits       */
  __IO uint16_t  STARTUP_STATUS_REG;                /*!< (@ 0x5000002C) Startup timeout bits                                   */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  VBUS_IRQ_MASK_REG;                 /*!< (@ 0x50000030) IRQ masking                                            */
  __IO uint16_t  VBUS_IRQ_CLEAR_REG;                /*!< (@ 0x50000032) Clear pending IRQ register                             */
  __IO uint16_t  BOD_CTRL_REG;                      /*!< (@ 0x50000034) Brown Out Detection control register                   */
  __IO uint16_t  BOD_CTRL2_REG;                     /*!< (@ 0x50000036) Brown Out Detection control register                   */
  __IO uint16_t  BOD_STATUS_REG;                    /*!< (@ 0x50000038) Brown Out Detection status register                    */
  __IO uint16_t  LDO_CTRL1_REG;                     /*!< (@ 0x5000003A) LDO control register                                   */
  __IO uint16_t  LDO_CTRL2_REG;                     /*!< (@ 0x5000003C) LDO control register                                   */
  __IO uint16_t  SLEEP_TIMER_REG;                   /*!< (@ 0x5000003E) Timer for regulated sleep                              */
  __IO uint16_t  POWER_CTRL_REG;                    /*!< (@ 0x50000040) Power control register                                 */
  __IO uint16_t  POR_VBAT_CTRL_REG;                 /*!< (@ 0x50000042) Controls the POR on VBAT                               */
  __I  uint32_t  RESERVED5[3];
  __IO uint16_t  XTALRDY_CTRL_REG;                  /*!< (@ 0x50000050) Control register for XTALRDY IRQ                       */
  __IO uint16_t  XTALRDY_STAT_REG;                  /*!< (@ 0x50000052) Difference between XTAL_OK and XTALRDY_IRQ in
                                                         LP clock cycles                                                       */
  __IO uint16_t  LDO_CTRL3_REG;                     /*!< (@ 0x50000054) Retention LDO control register                         */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  XTAL16M_START_REG;                 /*!< (@ 0x50000058) Xtal frequency trimming register during startup        */
  __IO uint16_t  XTAL16M_RAMP_REG;                  /*!< (@ 0x5000005A) Xtal frequency trimming register during ramping        */
  __IO uint16_t  XTAL16M_TRSTAT_REG;                /*!< (@ 0x5000005C) Read back value of current XTAL trimming               */
  __IO uint16_t  RESET_STAT_REG;                    /*!< (@ 0x5000005E) Reset status register                                  */
  __IO uint16_t  FORCE_SLEEP_REG;                   /*!< (@ 0x50000060) Force FTDF/BLE to sleep                                */
  __IO uint16_t  LDOS_DISABLE_REG;                  /*!< (@ 0x50000062) Force off all LDOs                                     */
  __IO uint16_t  AON_SPARE_REG;                     /*!< (@ 0x50000064) Spare register                                         */
  __IO uint16_t  SECURE_BOOT_REG;                   /*!< (@ 0x50000066) Controls secure booting                                */
  __IO uint16_t  PMU_RESET_RAIL_REG;                /*!< (@ 0x50000068) Controls rail resetting when RST is pulsed             */
  __IO uint16_t  DISCHARGE_RAIL_REG;                /*!< (@ 0x5000006A) Immediate rail resetting. There is no LDO/DCDC
                                                         gating                                                                */
} CRG_TOP_Type;


/* ================================================================================ */
/* ================                      DCDC                      ================ */
/* ================================================================================ */


/**
  * @brief DCDC registers (DCDC)
  */

typedef struct {                                    /*!< (@ 0x50000080) DCDC Structure                                         */
  __I  uint16_t  RESERVED;
  __IO uint16_t  DCDC_CTRL_0_REG;                   /*!< (@ 0x50000082) DCDC First Control Register                            */
  __IO uint16_t  DCDC_CTRL_1_REG;                   /*!< (@ 0x50000084) DCDC Second Control Register                           */
  __IO uint16_t  DCDC_CTRL_2_REG;                   /*!< (@ 0x50000086) DCDC Third Control Register                            */
  __IO uint16_t  DCDC_V14_0_REG;                    /*!< (@ 0x50000088) DCDC V14 First Control Register                        */
  __IO uint16_t  DCDC_V14_1_REG;                    /*!< (@ 0x5000008A) DCDC V14 Second Control Register                       */
  __IO uint16_t  DCDC_V18_0_REG;                    /*!< (@ 0x5000008C) DCDC V18 First Control Register                        */
  __IO uint16_t  DCDC_V18_1_REG;                    /*!< (@ 0x5000008E) DCDC V18 Second Control Register                       */
  __IO uint16_t  DCDC_VDD_0_REG;                    /*!< (@ 0x50000090) DCDC VDD First Control Register                        */
  __IO uint16_t  DCDC_VDD_1_REG;                    /*!< (@ 0x50000092) DCDC VDD Second Control Register                       */
  __IO uint16_t  DCDC_V18P_0_REG;                   /*!< (@ 0x50000094) DCDC VPA First Control Register                        */
  __IO uint16_t  DCDC_V18P_1_REG;                   /*!< (@ 0x50000096) DCDC VPA Second Control Register                       */
  __IO uint16_t  DCDC_RET_0_REG;                    /*!< (@ 0x50000098) DCDC First Retention Mode Register                     */
  __IO uint16_t  DCDC_RET_1_REG;                    /*!< (@ 0x5000009A) DCDC Second Retention Mode Register                    */
  __IO uint16_t  DCDC_TRIM_REG;                     /*!< (@ 0x5000009C) DCDC Comparator Trim Register                          */
  __IO uint16_t  DCDC_TEST_0_REG;                   /*!< (@ 0x5000009E) DCDC Test Register                                     */
  __IO uint16_t  DCDC_TEST_1_REG;                   /*!< (@ 0x500000A0) DCDC Test Register                                     */
  __IO uint16_t  DCDC_STATUS_0_REG;                 /*!< (@ 0x500000A2) DCDC First Status Register                             */
  __IO uint16_t  DCDC_STATUS_1_REG;                 /*!< (@ 0x500000A4) DCDC Second Status Register                            */
  __IO uint16_t  DCDC_STATUS_2_REG;                 /*!< (@ 0x500000A6) DCDC Third Status Register                             */
  __IO uint16_t  DCDC_STATUS_3_REG;                 /*!< (@ 0x500000A8) DCDC Fourth Status Register                            */
  __IO uint16_t  DCDC_STATUS_4_REG;                 /*!< (@ 0x500000AA) DCDC Fifth Status Register                             */
  __IO uint16_t  DCDC_TRIM_0_REG;                   /*!< (@ 0x500000AC) DCDC V14 Comparator Trim Register                      */
  __IO uint16_t  DCDC_TRIM_1_REG;                   /*!< (@ 0x500000AE) DCDC V18 Comparator Trim Register                      */
  __IO uint16_t  DCDC_TRIM_2_REG;                   /*!< (@ 0x500000B0) DCDC VDD Comparator Trim Register                      */
  __IO uint16_t  DCDC_TRIM_3_REG;                   /*!< (@ 0x500000B2) DCDC VPA Comparator Trim Register                      */
  __IO uint16_t  DCDC_IRQ_STATUS_REG;               /*!< (@ 0x500000B4) DCDC Interrupt Status Register                         */
  __IO uint16_t  DCDC_IRQ_CLEAR_REG;                /*!< (@ 0x500000B6) DCDC Interrupt Clear Register                          */
  __IO uint16_t  DCDC_IRQ_MASK_REG;                 /*!< (@ 0x500000B8) DCDC Interrupt Clear Register                          */
} DCDC_Type;


/* ================================================================================ */
/* ================                       DEM                      ================ */
/* ================================================================================ */


/**
  * @brief DEM registers (DEM)
  */

typedef struct {                                    /*!< (@ 0x50002E00) DEM Structure                                          */
  __IO uint16_t  RF_DEM_CTRL_REG;                   /*!< (@ 0x50002E00) RF_DEM_CTRL_REG                                        */
  __IO uint16_t  RF_AGC_LUT_01_REG;                 /*!< (@ 0x50002E02) RF_AGC_LUT_01_REG                                      */
  __IO uint16_t  RF_AGC_LUT_23_REG;                 /*!< (@ 0x50002E04) RF_AGC_LUT_23_REG                                      */
  __IO uint16_t  RF_AGC_LUT_45_REG;                 /*!< (@ 0x50002E06) RF_AGC_LUT_45_REG                                      */
  __IO uint16_t  RF_AGC_LUT_67_REG;                 /*!< (@ 0x50002E08) RF_AGC_LUT_67_REG                                      */
  __IO uint16_t  RF_AGC_LUT_89_REG;                 /*!< (@ 0x50002E0A) RF_AGC_LUT_89_REG                                      */
  __IO uint16_t  RF_AGC_CTRL1_REG;                  /*!< (@ 0x50002E0C) RF_AGC_CTRL1_REG                                       */
  __IO uint16_t  RF_AGC_CTRL2_REG;                  /*!< (@ 0x50002E0E) RF_AGC_CTRL2_REG                                       */
  __IO uint16_t  RF_AFC_CTRL_REG;                   /*!< (@ 0x50002E10) RF_AFC_CTRL_REG                                        */
  __IO uint16_t  RF_DC_OFFSET_CTRL1_REG;            /*!< (@ 0x50002E12) RF_DC_OFFSET_CTRL1_REG                                 */
  __IO uint16_t  RF_DC_OFFSET_CTRL2_REG;            /*!< (@ 0x50002E14) RF_DC_OFFSET_CTRL2_REG                                 */
  __IO uint16_t  RF_DC_OFFSET_CTRL3_REG;            /*!< (@ 0x50002E16) RF_DC_OFFSET_CTRL3_REG                                 */
  __IO uint16_t  RF_DC_OFFSET_CTRL4_REG;            /*!< (@ 0x50002E18) RF_DC_OFFSET_CTRL4_REG                                 */
  __I  uint16_t  RESERVED;
  __IO uint16_t  RF_AGC_RESULT_REG;                 /*!< (@ 0x50002E1C) RF_AGC_RESULT_REG                                      */
  __IO uint16_t  RF_RSSI_RESULT_REG;                /*!< (@ 0x50002E1E) RF_RSSI_RESULT_REG                                     */
  __IO uint16_t  RF_DC_OFFSET_RESULT_REG;           /*!< (@ 0x50002E20) Must be Retained                                       */
  __IO uint16_t  RF_RSSI_COMP_CTRL_REG;             /*!< (@ 0x50002E22) RF_RSSI_COMP_CTRL_REG                                  */
  __I  uint32_t  RESERVED1[3];
  __IO uint16_t  RF_FTDF_CTRL1_REG;                 /*!< (@ 0x50002E30) RF_FTDF_CTRL1_REG                                      */
  __IO uint16_t  RF_FTDF_CTRL2_REG;                 /*!< (@ 0x50002E32) RF_FTDF_CTRL2_REG                                      */
  __IO uint16_t  RF_FTDF_CTRL3_REG;                 /*!< (@ 0x50002E34) RF_FTDF_CTRL3_REG                                      */
  __IO uint16_t  RF_FTDF_CTRL4_REG;                 /*!< (@ 0x50002E36) RF_FTDF_CTRL4_REG                                      */
  __IO uint16_t  RF_FTDF_LOOP_GAIN_PD_REG;          /*!< (@ 0x50002E38) RF_FTDF_LOOP_GAIN_PD_REG                               */
  __IO uint16_t  RF_FTDF_LOOP_GAIN_DS_REG;          /*!< (@ 0x50002E3A) RF_FTDF_LOOP_GAIN_DS_REG                               */
  __IO uint16_t  RF_FTDF_CTRL5_REG;                 /*!< (@ 0x50002E3C) RF_FTDF_CTRL5_REG                                      */
  __IO uint16_t  RF_FTDF_COBI_LOW_REG;              /*!< (@ 0x50002E3E) RF_FTDF_COBI_LOW_REG                                   */
  __IO uint16_t  RF_FTDF_COBI_HIGH_REG;             /*!< (@ 0x50002E40) RF_FTDF_COBI_HIGH_REG                                  */
  __IO uint16_t  RF_DEM_TESTMODE_REG;               /*!< (@ 0x50002E42) RF_DEM_TESTMODE_REG                                    */
  __IO uint16_t  RF_DEM_IQCORRECT_REG;              /*!< (@ 0x50002E44) RF_DEM_IQCORRECT_REG                                   */
  __IO uint16_t  RF_PAD_CNT_CTRL_REG;               /*!< (@ 0x50002E46) RF_PAD_CNT_CTRL_REG                                    */
  __IO uint16_t  RF_PAD_CNT_RESULT_REG;             /*!< (@ 0x50002E48) RF_PAD_CNT_RESULT_REG                                  */
  __I  uint16_t  RESERVED2[3];
  __IO uint16_t  RF_FSSS_I_RESULT_REG;              /*!< (@ 0x50002E50) RF_FSSS_I_RESULT_REG                                   */
  __IO uint16_t  RF_FSSS_Q_RESULT_REG;              /*!< (@ 0x50002E52) RF_FSSS_Q_RESULT_REG                                   */
  __IO uint16_t  RF_FSSS_MAG_RESULT_REG;            /*!< (@ 0x50002E54) RF_FSSS_MAG_RESULT_REG                                 */
  __IO uint16_t  RF_CCA_RSSITH_REG;                 /*!< (@ 0x50002E56) RF_CCA_RSSITH_REG                                      */
  __IO uint16_t  RF_FTDF_SIGDET_CTRL_REG;           /*!< (@ 0x50002E58) RF_FTDF_SIGDET_CTRL_REG                                */
} DEM_Type;


/* ================================================================================ */
/* ================                       DMA                      ================ */
/* ================================================================================ */


/**
  * @brief DMA registers (DMA)
  */

