openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
typedef struct {                                    /*!< (@ 0x50003500) DMA Structure                                          */
  __IO uint16_t  DMA0_A_STARTL_REG;                 /*!< (@ 0x50003500) Start address Low A of DMA channel 0                   */
  __IO uint16_t  DMA0_A_STARTH_REG;                 /*!< (@ 0x50003502) Start address High A of DMA channel 0                  */
  __IO uint16_t  DMA0_B_STARTL_REG;                 /*!< (@ 0x50003504) Start address Low B of DMA channel 0                   */
  __IO uint16_t  DMA0_B_STARTH_REG;                 /*!< (@ 0x50003506) Start address High B of DMA channel 0                  */
  __IO uint16_t  DMA0_INT_REG;                      /*!< (@ 0x50003508) DMA receive interrupt register channel 0               */
  __IO uint16_t  DMA0_LEN_REG;                      /*!< (@ 0x5000350A) DMA receive length register channel 0                  */
  __IO uint16_t  DMA0_CTRL_REG;                     /*!< (@ 0x5000350C) Control register for the DMA channel 0                 */
  __IO uint16_t  DMA0_IDX_REG;                      /*!< (@ 0x5000350E) Index value of DMA channel 0                           */
  __IO uint16_t  DMA1_A_STARTL_REG;                 /*!< (@ 0x50003510) Start address Low A of DMA channel 1                   */
  __IO uint16_t  DMA1_A_STARTH_REG;                 /*!< (@ 0x50003512) Start address High A of DMA channel 1                  */
  __IO uint16_t  DMA1_B_STARTL_REG;                 /*!< (@ 0x50003514) Start address Low B of DMA channel 1                   */
  __IO uint16_t  DMA1_B_STARTH_REG;                 /*!< (@ 0x50003516) Start address High B of DMA channel 1                  */
  __IO uint16_t  DMA1_INT_REG;                      /*!< (@ 0x50003518) DMA receive interrupt register channel 1               */
  __IO uint16_t  DMA1_LEN_REG;                      /*!< (@ 0x5000351A) DMA receive length register channel 1                  */
  __IO uint16_t  DMA1_CTRL_REG;                     /*!< (@ 0x5000351C) Control register for the DMA channel 1                 */
  __IO uint16_t  DMA1_IDX_REG;                      /*!< (@ 0x5000351E) Index value of DMA channel 1                           */
  __IO uint16_t  DMA2_A_STARTL_REG;                 /*!< (@ 0x50003520) Start address Low A of DMA channel 2                   */
  __IO uint16_t  DMA2_A_STARTH_REG;                 /*!< (@ 0x50003522) Start address High A of DMA channel 2                  */
  __IO uint16_t  DMA2_B_STARTL_REG;                 /*!< (@ 0x50003524) Start address Low B of DMA channel 2                   */
  __IO uint16_t  DMA2_B_STARTH_REG;                 /*!< (@ 0x50003526) Start address High B of DMA channel 2                  */
  __IO uint16_t  DMA2_INT_REG;                      /*!< (@ 0x50003528) DMA receive interrupt register channel 2               */
  __IO uint16_t  DMA2_LEN_REG;                      /*!< (@ 0x5000352A) DMA receive length register channel 2                  */
  __IO uint16_t  DMA2_CTRL_REG;                     /*!< (@ 0x5000352C) Control register for the DMA channel 2                 */
  __IO uint16_t  DMA2_IDX_REG;                      /*!< (@ 0x5000352E) Index value of DMA channel 2                           */
  __IO uint16_t  DMA3_A_STARTL_REG;                 /*!< (@ 0x50003530) Start address Low A of DMA channel 3                   */
  __IO uint16_t  DMA3_A_STARTH_REG;                 /*!< (@ 0x50003532) Start address High A of DMA channel 3                  */
  __IO uint16_t  DMA3_B_STARTL_REG;                 /*!< (@ 0x50003534) Start address Low B of DMA channel 3                   */
  __IO uint16_t  DMA3_B_STARTH_REG;                 /*!< (@ 0x50003536) Start address High B of DMA channel 3                  */
  __IO uint16_t  DMA3_INT_REG;                      /*!< (@ 0x50003538) DMA receive interrupt register channel 3               */
  __IO uint16_t  DMA3_LEN_REG;                      /*!< (@ 0x5000353A) DMA receive length register channel 3                  */
  __IO uint16_t  DMA3_CTRL_REG;                     /*!< (@ 0x5000353C) Control register for the DMA channel 3                 */
  __IO uint16_t  DMA3_IDX_REG;                      /*!< (@ 0x5000353E) Index value of DMA channel 3                           */
  __IO uint16_t  DMA4_A_STARTL_REG;                 /*!< (@ 0x50003540) Start address Low A of DMA channel 4                   */
  __IO uint16_t  DMA4_A_STARTH_REG;                 /*!< (@ 0x50003542) Start address High A of DMA channel 4                  */
  __IO uint16_t  DMA4_B_STARTL_REG;                 /*!< (@ 0x50003544) Start address Low B of DMA channel 4                   */
  __IO uint16_t  DMA4_B_STARTH_REG;                 /*!< (@ 0x50003546) Start address High B of DMA channel 4                  */
  __IO uint16_t  DMA4_INT_REG;                      /*!< (@ 0x50003548) DMA receive interrupt register channel 4               */
  __IO uint16_t  DMA4_LEN_REG;                      /*!< (@ 0x5000354A) DMA receive length register channel 4                  */
  __IO uint16_t  DMA4_CTRL_REG;                     /*!< (@ 0x5000354C) Control register for the DMA channel 4                 */
  __IO uint16_t  DMA4_IDX_REG;                      /*!< (@ 0x5000354E) Index value of DMA channel 4                           */
  __IO uint16_t  DMA5_A_STARTL_REG;                 /*!< (@ 0x50003550) Start address Low A of DMA channel 5                   */
  __IO uint16_t  DMA5_A_STARTH_REG;                 /*!< (@ 0x50003552) Start address High A of DMA channel 5                  */
  __IO uint16_t  DMA5_B_STARTL_REG;                 /*!< (@ 0x50003554) Start address Low B of DMA channel 5                   */
  __IO uint16_t  DMA5_B_STARTH_REG;                 /*!< (@ 0x50003556) Start address High B of DMA channel 5                  */
  __IO uint16_t  DMA5_INT_REG;                      /*!< (@ 0x50003558) DMA receive interrupt register channel 5               */
  __IO uint16_t  DMA5_LEN_REG;                      /*!< (@ 0x5000355A) DMA receive length register channel 5                  */
  __IO uint16_t  DMA5_CTRL_REG;                     /*!< (@ 0x5000355C) Control register for the DMA channel 5                 */
  __IO uint16_t  DMA5_IDX_REG;                      /*!< (@ 0x5000355E) Index value of DMA channel 5                           */
  __IO uint16_t  DMA6_A_STARTL_REG;                 /*!< (@ 0x50003560) Start address Low A of DMA channel 6                   */
  __IO uint16_t  DMA6_A_STARTH_REG;                 /*!< (@ 0x50003562) Start address High A of DMA channel 6                  */
  __IO uint16_t  DMA6_B_STARTL_REG;                 /*!< (@ 0x50003564) Start address Low B of DMA channel 6                   */
  __IO uint16_t  DMA6_B_STARTH_REG;                 /*!< (@ 0x50003566) Start address High B of DMA channel 6                  */
  __IO uint16_t  DMA6_INT_REG;                      /*!< (@ 0x50003568) DMA receive interrupt register channel 6               */
  __IO uint16_t  DMA6_LEN_REG;                      /*!< (@ 0x5000356A) DMA receive length register channel 6                  */
  __IO uint16_t  DMA6_CTRL_REG;                     /*!< (@ 0x5000356C) Control register for the DMA channel 6                 */
  __IO uint16_t  DMA6_IDX_REG;                      /*!< (@ 0x5000356E) Index value of DMA channel 6                           */
  __IO uint16_t  DMA7_A_STARTL_REG;                 /*!< (@ 0x50003570) Start address Low A of DMA channel 7                   */
  __IO uint16_t  DMA7_A_STARTH_REG;                 /*!< (@ 0x50003572) Start address High A of DMA channel 7                  */
  __IO uint16_t  DMA7_B_STARTL_REG;                 /*!< (@ 0x50003574) Start address Low B of DMA channel 7                   */
  __IO uint16_t  DMA7_B_STARTH_REG;                 /*!< (@ 0x50003576) Start address High B of DMA channel 7                  */
  __IO uint16_t  DMA7_INT_REG;                      /*!< (@ 0x50003578) DMA receive interrupt register channel 7               */
  __IO uint16_t  DMA7_LEN_REG;                      /*!< (@ 0x5000357A) DMA receive length register channel 7                  */
  __IO uint16_t  DMA7_CTRL_REG;                     /*!< (@ 0x5000357C) Control register for the DMA channel 7                 */
  __IO uint16_t  DMA7_IDX_REG;                      /*!< (@ 0x5000357E) Index value of DMA channel 7                           */
  __IO uint16_t  DMA_REQ_MUX_REG;                   /*!< (@ 0x50003580) DMA channel assignments                                */
  __IO uint16_t  DMA_INT_STATUS_REG;                /*!< (@ 0x50003582) DMA interrupt status register                          */
  __IO uint16_t  DMA_CLEAR_INT_REG;                 /*!< (@ 0x50003584) DMA clear interrupt register                           */
} DMA_Type;


/* ================================================================================ */
/* ================                       ECC                      ================ */
/* ================================================================================ */


/**
  * @brief ECC registers (ECC)
  */

