openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
typedef struct {                                    /*!< (@ 0x50003400) GP_TIMERS Structure                                    */
  __IO uint16_t  TIMER0_CTRL_REG;                   /*!< (@ 0x50003400) Timer0 control register                                */
  __IO uint16_t  TIMER0_ON_REG;                     /*!< (@ 0x50003402) Timer0 on control register                             */
  __IO uint16_t  TIMER0_RELOAD_M_REG;               /*!< (@ 0x50003404) 16 bits reload value for Timer0                        */
  __IO uint16_t  TIMER0_RELOAD_N_REG;               /*!< (@ 0x50003406) 16 bits reload value for Timer0                        */
  __IO uint16_t  PWM2_START_CYCLE;                  /*!< (@ 0x50003408) Defines start Cycle for PWM2                           */
  __IO uint16_t  PWM3_START_CYCLE;                  /*!< (@ 0x5000340A) Defines start Cycle for PWM3                           */
  __IO uint16_t  PWM4_START_CYCLE;                  /*!< (@ 0x5000340C) Defines start Cycle for PWM4                           */
  __IO uint16_t  PWM2_END_CYCLE;                    /*!< (@ 0x5000340E) Defines end Cycle for PWM2                             */
  __IO uint16_t  PWM3_END_CYCLE;                    /*!< (@ 0x50003410) Defines end Cycle for PWM3                             */
  __IO uint16_t  PWM4_END_CYCLE;                    /*!< (@ 0x50003412) Defines end Cycle for PWM4                             */
  __IO uint16_t  TRIPLE_PWM_FREQUENCY;              /*!< (@ 0x50003414) Defines the PMW2,3,4 frequency                         */
  __IO uint16_t  TRIPLE_PWM_CTRL_REG;               /*!< (@ 0x50003416) PWM 2 3 4 Control register                             */
  __IO uint16_t  BREATH_CFG_REG;                    /*!< (@ 0x50003418) Breath configuration register                          */
  __IO uint16_t  BREATH_DUTY_MAX_REG;               /*!< (@ 0x5000341A) Breath max duty cycle register                         */
  __IO uint16_t  BREATH_DUTY_MIN_REG;               /*!< (@ 0x5000341C) Breath min duty cycle register                         */
  __IO uint16_t  BREATH_CTRL_REG;                   /*!< (@ 0x5000341E) Breath control register                                */
} GP_TIMERS_Type;


/* ================================================================================ */
/* ================                      GPADC                     ================ */
/* ================================================================================ */


/**
  * @brief GPADC registers (GPADC)
  */

typedef struct {                                    /*!< (@ 0x50001900) GPADC Structure                                        */
  __IO uint16_t  GP_ADC_CTRL_REG;                   /*!< (@ 0x50001900) General Purpose ADC Control Register                   */
  __IO uint16_t  GP_ADC_CTRL2_REG;                  /*!< (@ 0x50001902) General Purpose ADC Second Control Register            */
  __IO uint16_t  GP_ADC_CTRL3_REG;                  /*!< (@ 0x50001904) General Purpose ADC Third Control Register             */
  __IO uint16_t  GP_ADC_OFFP_REG;                   /*!< (@ 0x50001906) General Purpose ADC Positive Offset Register           */
  __IO uint16_t  GP_ADC_OFFN_REG;                   /*!< (@ 0x50001908) General Purpose ADC Negative Offset Register           */
  __IO uint16_t  GP_ADC_CLEAR_INT_REG;              /*!< (@ 0x5000190A) General Purpose ADC Clear Interrupt Register           */
  __IO uint16_t  GP_ADC_RESULT_REG;                 /*!< (@ 0x5000190C) General Purpose ADC Result Register                    */
} GPADC_Type;


/* ================================================================================ */
/* ================                      GPIO                      ================ */
/* ================================================================================ */


/**
  * @brief GPIO registers (GPIO)
  */

typedef struct {                                    /*!< (@ 0x50003000) GPIO Structure                                         */
  __IO uint16_t  P0_DATA_REG;                       /*!< (@ 0x50003000) P0 Data input / output Register                        */
  __IO uint16_t  P1_DATA_REG;                       /*!< (@ 0x50003002) P1 Data input / output Register                        */
  __IO uint16_t  P2_DATA_REG;                       /*!< (@ 0x50003004) P2 Data input / output Register                        */
  __IO uint16_t  P3_DATA_REG;                       /*!< (@ 0x50003006) P3 Data input / output Register                        */
  __IO uint16_t  P4_DATA_REG;                       /*!< (@ 0x50003008) P4 Data input / output Register                        */
  __IO uint16_t  P0_SET_DATA_REG;                   /*!< (@ 0x5000300A) P0 Set port pins Register                              */
  __IO uint16_t  P1_SET_DATA_REG;                   /*!< (@ 0x5000300C) P1 Set port pins Register                              */
  __IO uint16_t  P2_SET_DATA_REG;                   /*!< (@ 0x5000300E) P2 Set port pins Register                              */
  __IO uint16_t  P3_SET_DATA_REG;                   /*!< (@ 0x50003010) P3 Set port pins Register                              */
  __IO uint16_t  P4_SET_DATA_REG;                   /*!< (@ 0x50003012) P4 Set port pins Register                              */
  __IO uint16_t  P0_RESET_DATA_REG;                 /*!< (@ 0x50003014) P0 Reset port pins Register                            */
  __IO uint16_t  P1_RESET_DATA_REG;                 /*!< (@ 0x50003016) P1 Reset port pins Register                            */
  __IO uint16_t  P2_RESET_DATA_REG;                 /*!< (@ 0x50003018) P2 Reset port pins Register                            */
  __IO uint16_t  P3_RESET_DATA_REG;                 /*!< (@ 0x5000301A) P3 Reset port pins Register                            */
  __IO uint16_t  P4_RESET_DATA_REG;                 /*!< (@ 0x5000301C) P4 Reset port pins Register                            */
  __IO uint16_t  P00_MODE_REG;                      /*!< (@ 0x5000301E) P00 Mode Register                                      */
  __IO uint16_t  P01_MODE_REG;                      /*!< (@ 0x50003020) P01 Mode Register                                      */
  __IO uint16_t  P02_MODE_REG;                      /*!< (@ 0x50003022) P02 Mode Register                                      */
  __IO uint16_t  P03_MODE_REG;                      /*!< (@ 0x50003024) P03 Mode Register                                      */
  __IO uint16_t  P04_MODE_REG;                      /*!< (@ 0x50003026) P04 Mode Register                                      */
  __IO uint16_t  P05_MODE_REG;                      /*!< (@ 0x50003028) P05 Mode Register                                      */
  __IO uint16_t  P06_MODE_REG;                      /*!< (@ 0x5000302A) P06 Mode Register                                      */
  __IO uint16_t  P07_MODE_REG;                      /*!< (@ 0x5000302C) P07 Mode Register                                      */
  __IO uint16_t  P10_MODE_REG;                      /*!< (@ 0x5000302E) P10 Mode Register                                      */
  __IO uint16_t  P11_MODE_REG;                      /*!< (@ 0x50003030) P11 Mode Register                                      */
  __IO uint16_t  P12_MODE_REG;                      /*!< (@ 0x50003032) P12 Mode Register                                      */
  __IO uint16_t  P13_MODE_REG;                      /*!< (@ 0x50003034) P13 Mode Register                                      */
  __IO uint16_t  P14_MODE_REG;                      /*!< (@ 0x50003036) P14 Mode Register                                      */
  __IO uint16_t  P15_MODE_REG;                      /*!< (@ 0x50003038) P15 Mode Register                                      */
  __IO uint16_t  P16_MODE_REG;                      /*!< (@ 0x5000303A) P24 Mode Register                                      */
  __IO uint16_t  P17_MODE_REG;                      /*!< (@ 0x5000303C) P25 Mode Register                                      */
  __IO uint16_t  P20_MODE_REG;                      /*!< (@ 0x5000303E) P20 Mode Register                                      */
  __IO uint16_t  P21_MODE_REG;                      /*!< (@ 0x50003040) P21 Mode Register                                      */
  __IO uint16_t  P22_MODE_REG;                      /*!< (@ 0x50003042) P22 Mode Register                                      */
  __IO uint16_t  P23_MODE_REG;                      /*!< (@ 0x50003044) P23 Mode Register                                      */
  __IO uint16_t  P24_MODE_REG;                      /*!< (@ 0x50003046) P24 Mode Register                                      */
  __I  uint16_t  RESERVED[3];
  __IO uint16_t  P30_MODE_REG;                      /*!< (@ 0x5000304E) P30 Mode Register                                      */
  __IO uint16_t  P31_MODE_REG;                      /*!< (@ 0x50003050) P31 Mode Register                                      */
  __IO uint16_t  P32_MODE_REG;                      /*!< (@ 0x50003052) P32 Mode Register                                      */
  __IO uint16_t  P33_MODE_REG;                      /*!< (@ 0x50003054) P33 Mode Register                                      */
  __IO uint16_t  P34_MODE_REG;                      /*!< (@ 0x50003056) P34 Mode Register                                      */
  __IO uint16_t  P35_MODE_REG;                      /*!< (@ 0x50003058) P35 Mode Register                                      */
  __IO uint16_t  P36_MODE_REG;                      /*!< (@ 0x5000305A) P36 Mode Register                                      */
  __IO uint16_t  P37_MODE_REG;                      /*!< (@ 0x5000305C) P37 Mode Register                                      */
  __IO uint16_t  P40_MODE_REG;                      /*!< (@ 0x5000305E) P40 Mode Register                                      */
  __IO uint16_t  P41_MODE_REG;                      /*!< (@ 0x50003060) P41 Mode Register                                      */
  __IO uint16_t  P42_MODE_REG;                      /*!< (@ 0x50003062) P42 Mode Register                                      */
  __IO uint16_t  P43_MODE_REG;                      /*!< (@ 0x50003064) P43 Mode Register                                      */
  __IO uint16_t  P44_MODE_REG;                      /*!< (@ 0x50003066) P44 Mode Register                                      */
  __IO uint16_t  P45_MODE_REG;                      /*!< (@ 0x50003068) P45 Mode Register                                      */
  __IO uint16_t  P46_MODE_REG;                      /*!< (@ 0x5000306A) P46 Mode Register                                      */
  __IO uint16_t  P47_MODE_REG;                      /*!< (@ 0x5000306C) P47 Mode Register                                      */
  __I  uint16_t  RESERVED1[41];
  __IO uint16_t  P0_PADPWR_CTRL_REG;                /*!< (@ 0x500030C0) P0 Output Power Control Register                       */
  __IO uint16_t  P1_PADPWR_CTRL_REG;                /*!< (@ 0x500030C2) P1 Output Power Control Register                       */
  __IO uint16_t  P2_PADPWR_CTRL_REG;                /*!< (@ 0x500030C4) P2 Output Power Control Register                       */
  __IO uint16_t  P3_PADPWR_CTRL_REG;                /*!< (@ 0x500030C6) P3 Output Power Control Register                       */
  __IO uint16_t  P4_PADPWR_CTRL_REG;                /*!< (@ 0x500030C8) P4 Output Power Control Register                       */
  __I  uint16_t  RESERVED2[3];
  __IO uint16_t  GPIO_CLK_SEL;                      /*!< (@ 0x500030D0) Select which clock to map on port in PPA               */
  __I  uint16_t  RESERVED3[7];
  __IO uint16_t  BIST_CTRL_REG;                     /*!< (@ 0x500030E0) BIST_CTRL_REG                                          */
  __IO uint16_t  RAMBIST_STATUS1_REG;               /*!< (@ 0x500030E2) RAMBIST_STATUS1_REG                                    */
  __IO uint16_t  RAMBIST_STATUS2_REG;               /*!< (@ 0x500030E4) RAMBIST_STATUS2_REG                                    */
  __IO uint16_t  RAMBIST_STATUS3_REG;               /*!< (@ 0x500030E6) RAMBIST_STATUS3_REG                                    */
  __IO uint16_t  ROMBIST_RESULTL_REG;               /*!< (@ 0x500030E8) ROMBIST_RESULTL_REG                                    */
  __IO uint16_t  ROMBIST_RESULTH_REG;               /*!< (@ 0x500030EA) ROMBIST_RESULTH_REG                                    */
  __I  uint32_t  RESERVED4;
  __IO uint16_t  TEST_CTRL_REG;                     /*!< (@ 0x500030F0) TEST_CTRL_REG                                          */
  __IO uint16_t  TEST_CTRL2_REG;                    /*!< (@ 0x500030F2) TEST_CTRL2_REG                                         */
  __IO uint16_t  TEST_CTRL3_REG;                    /*!< (@ 0x500030F4) TEST_CTRL3_REG                                         */
  __IO uint16_t  TEST_CTRL4_REG;                    /*!< (@ 0x500030F6) TEST_CTRL4_REG                                         */
  __IO uint16_t  TEST_CTRL5_REG;                    /*!< (@ 0x500030F8) TEST_CTRL5_REG                                         */
} GPIO_Type;


/* ================================================================================ */
/* ================                      GPREG                     ================ */
/* ================================================================================ */


/**
  * @brief GPREG registers (GPREG)
  */

typedef struct {                                    /*!< (@ 0x50003300) GPREG Structure                                        */
  __IO uint16_t  SET_FREEZE_REG;                    /*!< (@ 0x50003300) Controls freezing of various timers/counters
                                                         (incl. DMA and USB).                                                  */
  __IO uint16_t  RESET_FREEZE_REG;                  /*!< (@ 0x50003302) Controls unfreezing of various timers/counters
                                                         (incl. DMA and USB).                                                  */
  __IO uint16_t  DEBUG_REG;                         /*!< (@ 0x50003304) Various debug information register.                    */
  __IO uint16_t  GP_STATUS_REG;                     /*!< (@ 0x50003306) General purpose system status register.                */
  __IO uint16_t  GP_CONTROL_REG;                    /*!< (@ 0x50003308) General purpose system control register.               */
  __IO uint16_t  ECC_BASE_ADDR_REG;                 /*!< (@ 0x5000330A) Base address of the ECC Crypto memory register.        */
  __IO uint16_t  LED_CONTROL_REG;                   /*!< (@ 0x5000330C) Controls muxing and enabling of the LEDs.              */
  __IO uint16_t  BLE_FINECNT_SAMP_REG;              /*!< (@ 0x5000330E) BLE FINECNT sampled value while in deep sleep
                                                         state.                                                                */
  __IO uint16_t  PLL_SYS_CTRL1_REG;                 /*!< (@ 0x50003310) System PLL control register 1.                         */
  __IO uint16_t  PLL_SYS_CTRL2_REG;                 /*!< (@ 0x50003312) System PLL control register 2.                         */
  __IO uint16_t  PLL_SYS_CTRL3_REG;                 /*!< (@ 0x50003314) System PLL control register 3.                         */
  __IO uint16_t  PLL_SYS_STATUS_REG;                /*!< (@ 0x50003316) System PLL status register.                            */
  __IO uint16_t  PLL_SYS_TEST_REG;                  /*!< (@ 0x50003318) System PLL test register.                              */
} GPREG_Type;


/* ================================================================================ */
/* ================                       I2C                      ================ */
/* ================================================================================ */


/**
  * @brief I2C registers (I2C)
  */

typedef struct {                                    /*!< (@ 0x50001400) I2C Structure                                          */
  __IO uint16_t  I2C_CON_REG;                       /*!< (@ 0x50001400) I2C Control Register                                   */
  __I  uint16_t  RESERVED;
  __IO uint16_t  I2C_TAR_REG;                       /*!< (@ 0x50001404) I2C Target Address Register                            */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  I2C_SAR_REG;                       /*!< (@ 0x50001408) I2C Slave Address Register                             */
  __I  uint16_t  RESERVED2[3];
  __IO uint16_t  I2C_DATA_CMD_REG;                  /*!< (@ 0x50001410) I2C Rx/Tx Data Buffer and Command Register             */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  I2C_SS_SCL_HCNT_REG;               /*!< (@ 0x50001414) Standard Speed I2C Clock SCL High Count Register       */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  I2C_SS_SCL_LCNT_REG;               /*!< (@ 0x50001418) Standard Speed I2C Clock SCL Low Count Register        */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  I2C_FS_SCL_HCNT_REG;               /*!< (@ 0x5000141C) Fast Speed I2C Clock SCL High Count Register           */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  I2C_FS_SCL_LCNT_REG;               /*!< (@ 0x50001420) Fast Speed I2C Clock SCL Low Count Register            */
  __I  uint16_t  RESERVED7[5];
  __IO uint16_t  I2C_INTR_STAT_REG;                 /*!< (@ 0x5000142C) I2C Interrupt Status Register                          */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  I2C_INTR_MASK_REG;                 /*!< (@ 0x50001430) I2C Interrupt Mask Register                            */
  __I  uint16_t  RESERVED9;
  __IO uint16_t  I2C_RAW_INTR_STAT_REG;             /*!< (@ 0x50001434) I2C Raw Interrupt Status Register                      */
  __I  uint16_t  RESERVED10;
  __IO uint16_t  I2C_RX_TL_REG;                     /*!< (@ 0x50001438) I2C Receive FIFO Threshold Register                    */
  __I  uint16_t  RESERVED11;
  __IO uint16_t  I2C_TX_TL_REG;                     /*!< (@ 0x5000143C) I2C Transmit FIFO Threshold Register                   */
  __I  uint16_t  RESERVED12;
  __IO uint16_t  I2C_CLR_INTR_REG;                  /*!< (@ 0x50001440) Clear Combined and Individual Interrupt Register       */
  __I  uint16_t  RESERVED13;
  __IO uint16_t  I2C_CLR_RX_UNDER_REG;              /*!< (@ 0x50001444) Clear RX_UNDER Interrupt Register                      */
  __I  uint16_t  RESERVED14;
  __IO uint16_t  I2C_CLR_RX_OVER_REG;               /*!< (@ 0x50001448) Clear RX_OVER Interrupt Register                       */
  __I  uint16_t  RESERVED15;
  __IO uint16_t  I2C_CLR_TX_OVER_REG;               /*!< (@ 0x5000144C) Clear TX_OVER Interrupt Register                       */
  __I  uint16_t  RESERVED16;
  __IO uint16_t  I2C_CLR_RD_REQ_REG;                /*!< (@ 0x50001450) Clear RD_REQ Interrupt Register                        */
  __I  uint16_t  RESERVED17;
  __IO uint16_t  I2C_CLR_TX_ABRT_REG;               /*!< (@ 0x50001454) Clear TX_ABRT Interrupt Register                       */
  __I  uint16_t  RESERVED18;
  __IO uint16_t  I2C_CLR_RX_DONE_REG;               /*!< (@ 0x50001458) Clear RX_DONE Interrupt Register                       */
  __I  uint16_t  RESERVED19;
  __IO uint16_t  I2C_CLR_ACTIVITY_REG;              /*!< (@ 0x5000145C) Clear ACTIVITY Interrupt Register                      */
  __I  uint16_t  RESERVED20;
  __IO uint16_t  I2C_CLR_STOP_DET_REG;              /*!< (@ 0x50001460) Clear STOP_DET Interrupt Register                      */
  __I  uint16_t  RESERVED21;
  __IO uint16_t  I2C_CLR_START_DET_REG;             /*!< (@ 0x50001464) Clear START_DET Interrupt Register                     */
  __I  uint16_t  RESERVED22;
  __IO uint16_t  I2C_CLR_GEN_CALL_REG;              /*!< (@ 0x50001468) Clear GEN_CALL Interrupt Register                      */
  __I  uint16_t  RESERVED23;
  __IO uint16_t  I2C_ENABLE_REG;                    /*!< (@ 0x5000146C) I2C Enable Register                                    */
  __I  uint16_t  RESERVED24;
  __IO uint16_t  I2C_STATUS_REG;                    /*!< (@ 0x50001470) I2C Status Register                                    */
  __I  uint16_t  RESERVED25;
  __IO uint16_t  I2C_TXFLR_REG;                     /*!< (@ 0x50001474) I2C Transmit FIFO Level Register                       */
  __I  uint16_t  RESERVED26;
  __IO uint16_t  I2C_RXFLR_REG;                     /*!< (@ 0x50001478) I2C Receive FIFO Level Register                        */
  __I  uint16_t  RESERVED27;
  __IO uint16_t  I2C_SDA_HOLD_REG;                  /*!< (@ 0x5000147C) I2C SDA Hold Time Length Register                      */
  __I  uint16_t  RESERVED28;
  __IO uint16_t  I2C_TX_ABRT_SOURCE_REG;            /*!< (@ 0x50001480) I2C Transmit Abort Source Register                     */
  __I  uint16_t  RESERVED29[3];
  __IO uint16_t  I2C_DMA_CR_REG;                    /*!< (@ 0x50001488) DMA Control Register                                   */
  __I  uint16_t  RESERVED30;
  __IO uint16_t  I2C_DMA_TDLR_REG;                  /*!< (@ 0x5000148C) DMA Transmit Data Level Register                       */
  __I  uint16_t  RESERVED31;
  __IO uint16_t  I2C_DMA_RDLR_REG;                  /*!< (@ 0x50001490) I2C Receive Data Level Register                        */
  __I  uint16_t  RESERVED32;
  __IO uint16_t  I2C_SDA_SETUP_REG;                 /*!< (@ 0x50001494) I2C SDA Setup Register                                 */
  __I  uint16_t  RESERVED33;
  __IO uint16_t  I2C_ACK_GENERAL_CALL_REG;          /*!< (@ 0x50001498) I2C ACK General Call Register                          */
  __I  uint16_t  RESERVED34;
  __IO uint16_t  I2C_ENABLE_STATUS_REG;             /*!< (@ 0x5000149C) I2C Enable Status Register                             */
  __I  uint16_t  RESERVED35;
  __IO uint16_t  I2C_IC_FS_SPKLEN_REG;              /*!< (@ 0x500014A0) I2C SS and FS spike suppression limit Size             */
  __I  uint16_t  RESERVED36[41];
  __IO uint16_t  I2C_COMP_PARAM1_REG;               /*!< (@ 0x500014F4) Component Parameter Register                           */
  __IO uint16_t  I2C_COMP_PARAM2_REG;               /*!< (@ 0x500014F6) Component Parameter Register 2                         */
  __IO uint16_t  I2C_COMP_VERSION_REG;              /*!< (@ 0x500014F8) I2C Component Version Register                         */
  __IO uint16_t  I2C_COMP2_VERSION;                 /*!< (@ 0x500014FA) I2C Component2 Version Register                        */
  __IO uint16_t  I2C_COMP_TYPE_REG;                 /*!< (@ 0x500014FC) I2C Component Type Register                            */
  __IO uint16_t  I2C_COMP_TYPE2_REG;                /*!< (@ 0x500014FE) I2C Component2 Type Register                           */
} I2C_Type;


/* ================================================================================ */
/* ================                      I2C2                      ================ */
/* ================================================================================ */


/**
  * @brief I2C2 registers (I2C2)
  */

