openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
typedef struct {                                    /*!< (@ 0x50002D00) PLLDIG Structure                                       */
  __IO uint16_t  RF_SYNTH_CTRL1_BLE_REG;            /*!< (@ 0x50002D00) RF_SYNTH_CTRL1_BLE_REG                                 */
  __IO uint16_t  RF_SYNTH_CTRL1_FTDF_REG;           /*!< (@ 0x50002D02) RF_SYNTH_CTRL1_FTDF_REG                                */
  __IO uint16_t  RF_SYNTH_CTRL2_BLE_REG;            /*!< (@ 0x50002D04) RF_SYNTH_CTRL2_BLE_REG                                 */
  __IO uint16_t  RF_SYNTH_CTRL2_FTDF_REG;           /*!< (@ 0x50002D06) RF_SYNTH_CTRL2_FTDF_REG                                */
  __IO uint16_t  RF_SYNTH_CTRL3_REG;                /*!< (@ 0x50002D08) RF_SYNTH_CTRL3_REG                                     */
  __IO uint16_t  RF_VCOCAL_CTRL_REG;                /*!< (@ 0x50002D0A) RF_VCOCAL_CTRL_REG                                     */
  __IO uint16_t  RF_MGAIN_CTRL_BLE_REG;             /*!< (@ 0x50002D0C) RF_MGAIN_CTRL_BLE_REG                                  */
  __IO uint16_t  RF_MGAIN_CTRL_FTDF_REG;            /*!< (@ 0x50002D0E) RF_MGAIN_CTRL_FTDF_REG                                 */
  __IO uint16_t  RF_MGAIN_CTRL2_REG;                /*!< (@ 0x50002D10) RF_MGAIN_CTRL2_REG                                     */
  __IO uint16_t  RF_VCO_CALCAP_BIT14_REG;           /*!< (@ 0x50002D12) RF_VCO_CALCAP_BIT14_REG                                */
  __IO uint16_t  RF_VCO_CALCAP_BIT15_REG;           /*!< (@ 0x50002D14) RF_VCO_CALCAP_BIT15_REG                                */
  __IO uint16_t  RF_BMCW_REG;                       /*!< (@ 0x50002D16) RF_BMCW_REG                                            */
  __IO uint16_t  RF_KMOD_ALPHA_BLE_REG;             /*!< (@ 0x50002D18) RF_KMOD_ALPHA_BLE_REG                                  */
  __IO uint16_t  RF_KMOD_ALPHA_FTDF_REG;            /*!< (@ 0x50002D1A) RF_KMOD_ALPHA_FTDF_REG                                 */
  __I  uint16_t  RESERVED;
  __IO uint16_t  RF_SYNTH_RESULT_BLE_REG;           /*!< (@ 0x50002D1E) Must be Retained                                       */
  __IO uint16_t  RF_SYNTH_RESULT_FTDF_REG;          /*!< (@ 0x50002D20) Must be Retained                                       */
  __IO uint16_t  RF_SYNTH_RESULT2_BLE_REG;          /*!< (@ 0x50002D22) Must be Retained                                       */
  __IO uint16_t  RF_SYNTH_RESULT2_FTDF_REG;         /*!< (@ 0x50002D24) Must be Retained                                       */
  __IO uint16_t  RF_SYNTH_RESULT3_FTDF_REG;         /*!< (@ 0x50002D26) RF_SYNTH_RESULT3_FTDF_REG                              */
  __IO uint16_t  RF_CALCAP1_REG;                    /*!< (@ 0x50002D28) RF_CALCAP1_REG                                         */
  __IO uint16_t  RF_CALCAP2_REG;                    /*!< (@ 0x50002D2A) RF_CALCAP2_REG                                         */
  __IO uint16_t  RF_NMD_OFFSET_REG;                 /*!< (@ 0x50002D2C) Offset values for phase alignment after VCO calibration. */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  RF_FTDF_PHYATTR_REG;               /*!< (@ 0x50002D30) RF_FTDF_PHYATTR_REG                                    */
  __IO uint16_t  RF_CALTRIM_STEP1_REG;              /*!< (@ 0x50002D32) RF_CALTRIM_STEP1_REG                                   */
  __IO uint16_t  RF_CALTRIM_STEP2_REG;              /*!< (@ 0x50002D34) RF_CALTRIM_STEP2_REG                                   */
  __IO uint16_t  RF_CALTRIM_STEP3_REG;              /*!< (@ 0x50002D36) RF_CALTRIM_STEP3_REG                                   */
  __IO uint16_t  RF_CALTRIM_STEP4_REG;              /*!< (@ 0x50002D38) RF_CALTRIM_STEP4_REG                                   */
  __IO uint16_t  RF_MGAIN_CTRL3_REG;                /*!< (@ 0x50002D3A) RF_MGAIN_CTRL3_REG                                     */
  __IO uint16_t  RF_VCO_FREQ_EST_REG;               /*!< (@ 0x50002D3C) RF_VCO_FREQ_EST_REG                                    */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  RF_SYNTH_SPARE_REG;                /*!< (@ 0x50002D40) MSK modulator control register                         */
  __IO uint16_t  RF_MSKMOD_CTRL1_REG;               /*!< (@ 0x50002D42) MSK modulator control register                         */
  __IO uint16_t  RF_MSKMOD_CHIPL_REG;               /*!< (@ 0x50002D44) MSK modulator CHIP control lower 16 bit                */
  __IO uint16_t  RF_MSKMOD_CHIPH_REG;               /*!< (@ 0x50002D46) MSK modulator CHIP control upper 16 bit                */
  __IO uint16_t  RF_TXDAC_TEST_REG;                 /*!< (@ 0x50002D48) Register to provide value to TXDAC                     */
  __I  uint16_t  RESERVED3[3];
  __IO uint16_t  RF_MGAIN_COMP_VAL0_REG;            /*!< (@ 0x50002D50) RF_MGAIN_COMP_VAL0_REG                                 */
  __IO uint16_t  RF_MGAIN_COMP_VAL1_REG;            /*!< (@ 0x50002D52) RF_MGAIN_COMP_VAL1_REG                                 */
  __IO uint16_t  RF_MGAIN_COMP_VAL2_REG;            /*!< (@ 0x50002D54) RF_MGAIN_COMP_VAL2_REG                                 */
  __IO uint16_t  RF_MGAIN_COMP_VAL3_REG;            /*!< (@ 0x50002D56) RF_MGAIN_COMP_VAL3_REG                                 */
  __IO uint16_t  RF_MGAIN_COMP_VAL4_REG;            /*!< (@ 0x50002D58) RF_MGAIN_COMP_VAL4_REG                                 */
  __IO uint16_t  RF_MGAIN_COMP_VAL5_REG;            /*!< (@ 0x50002D5A) RF_MGAIN_COMP_VAL5_REG                                 */
  __IO uint16_t  RF_MGAIN_COMP_VAL6_REG;            /*!< (@ 0x50002D5C) RF_MGAIN_COMP_VAL6_REG                                 */
  __IO uint16_t  RF_MGAIN_COMP_VAL7_REG;            /*!< (@ 0x50002D5E) RF_MGAIN_COMP_VAL7_REG                                 */
  __IO uint16_t  RF_PULSE_TBL_0_REG;                /*!< (@ 0x50002D60) RF_PULSE_TBL_0_REG                                     */
  __IO uint16_t  RF_PULSE_TBL_1_REG;                /*!< (@ 0x50002D62) RF_PULSE_TBL_1_REG                                     */
  __IO uint16_t  RF_PULSE_TBL_2_REG;                /*!< (@ 0x50002D64) RF_PULSE_TBL_2_REG                                     */
  __IO uint16_t  RF_PULSE_TBL_3_REG;                /*!< (@ 0x50002D66) RF_PULSE_TBL_3_REG                                     */
  __IO uint16_t  RF_PULSE_TBL_4_REG;                /*!< (@ 0x50002D68) RF_PULSE_TBL_4_REG                                     */
  __IO uint16_t  RF_PULSE_TBL_5_REG;                /*!< (@ 0x50002D6A) RF_PULSE_TBL_5_REG                                     */
  __IO uint16_t  RF_PULSE_TBL_6_REG;                /*!< (@ 0x50002D6C) RF_PULSE_TBL_6_REG                                     */
  __IO uint16_t  RF_PULSE_TBL_7_REG;                /*!< (@ 0x50002D6E) RF_PULSE_TBL_7_REG                                     */
  __IO uint16_t  RF_PULSE_CTRL_REG;                 /*!< (@ 0x50002D70) RF_PULSE_CTRL_REG                                      */
} PLLDIG_Type;


/* ================================================================================ */
/* ================                      QSPIC                     ================ */
/* ================================================================================ */


/**
  * @brief QSPIC registers (QSPIC)
  */

