openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
typedef struct {                                    /*!< (@ 0x0C000000) QSPIC Structure                                        */
  __IO uint32_t  QSPIC_CTRLBUS_REG;                 /*!< (@ 0x0C000000) SPI Bus control register for the Manual mode           */
  __IO uint32_t  QSPIC_CTRLMODE_REG;                /*!< (@ 0x0C000004) Mode Control register                                  */
  __IO uint32_t  QSPIC_RECVDATA_REG;                /*!< (@ 0x0C000008) Received data for the Manual mode                      */
  __IO uint32_t  QSPIC_BURSTCMDA_REG;               /*!< (@ 0x0C00000C) The way of reading in Auto mode (command register
                                                         A)                                                                    */
  __IO uint32_t  QSPIC_BURSTCMDB_REG;               /*!< (@ 0x0C000010) The way of reading in Auto mode (command register
                                                         B)                                                                    */
  __IO uint32_t  QSPIC_STATUS_REG;                  /*!< (@ 0x0C000014) The status register of the QSPI controller             */
  __IO uint32_t  QSPIC_WRITEDATA_REG;               /*!< (@ 0x0C000018) Write data to SPI Bus for the Manual mode              */
  __IO uint32_t  QSPIC_READDATA_REG;                /*!< (@ 0x0C00001C) Read data from SPI Bus for the Manual mode             */
  __IO uint32_t  QSPIC_DUMMYDATA_REG;               /*!< (@ 0x0C000020) Send dummy clocks to SPI Bus for the Manual mode       */
  __IO uint32_t  QSPIC_ERASECTRL_REG;               /*!< (@ 0x0C000024) QSPI Erase control register                            */
  __IO uint32_t  QSPIC_ERASECMDA_REG;               /*!< (@ 0x0C000028) The way of erasing in Auto mode (command register
                                                         A)                                                                    */
  __IO uint32_t  QSPIC_ERASECMDB_REG;               /*!< (@ 0x0C00002C) The way of erasing in Auto mode (command register
                                                         B)                                                                    */
  __IO uint32_t  QSPIC_BURSTBRK_REG;                /*!< (@ 0x0C000030) Read break sequence in Auto mode                       */
  __IO uint32_t  QSPIC_STATUSCMD_REG;               /*!< (@ 0x0C000034) The way of reading the status of external device
                                                         in Auto mode                                                          */
  __IO uint32_t  QSPIC_CHCKERASE_REG;               /*!< (@ 0x0C000038) Check erase progress in Auto mode                      */
  __IO uint32_t  QSPIC_GP_REG;                      /*!< (@ 0x0C00003C) QSPI General Purpose control register                  */
  __IO uint32_t  QSPIC_UCODE_START;                 /*!< (@ 0x0C000040) QSPIC uCode memory                                     */
} QSPIC_Type;


/* ================================================================================ */
/* ================                      QUAD                      ================ */
/* ================================================================================ */


/**
  * @brief QUAD registers (QUAD)
  */

typedef struct {                                    /*!< (@ 0x50001A00) QUAD Structure                                         */
  __IO uint16_t  QDEC_CTRL_REG;                     /*!< (@ 0x50001A00) Quad decoder control register                          */
  __IO uint16_t  QDEC_XCNT_REG;                     /*!< (@ 0x50001A02) Counter value of the X Axis                            */
  __IO uint16_t  QDEC_YCNT_REG;                     /*!< (@ 0x50001A04) Counter value of the Y Axis                            */
  __IO uint16_t  QDEC_ZCNT_REG;                     /*!< (@ 0x50001A06) Counter value of the Z Axis                            */
  __IO uint16_t  QDEC_CLOCKDIV_REG;                 /*!< (@ 0x50001A08) Quad decoder clock divider register                    */
} QUAD_Type;


/* ================================================================================ */
/* ================                      RFCU                      ================ */
/* ================================================================================ */


/**
  * @brief RFCU registers (RFCU)
  */

typedef struct {                                    /*!< (@ 0x50002000) RFCU Structure                                         */
  __I  uint32_t  RESERVED[4];
  __IO uint16_t  RF_OVERRULE_REG;                   /*!< (@ 0x50002010) RF_OVERRULE_REG                                        */
  __IO uint16_t  RF_DIAGIRQ01_REG;                  /*!< (@ 0x50002012) BLE/RF Diagnostic IRQ Control Register                 */
  __IO uint16_t  RF_DIAGIRQ23_REG;                  /*!< (@ 0x50002014) BLE/RF Diagnostic IRQ Control Register                 */
  __IO uint16_t  RF_DIAGIRQ_STAT_REG;               /*!< (@ 0x50002016) BLE/RF Diagnostic IRQ Status Register                  */
  __IO uint16_t  RF_AGC_EXT1_LUT_REG;               /*!< (@ 0x50002018) RF_AGC_EXT1_LUT_REG                                    */
  __I  uint16_t  RESERVED1[3];
  __IO uint16_t  RF_CALSTATE_REG;                   /*!< (@ 0x50002020) RF_CALSTATE_REG                                        */
  __I  uint16_t  RESERVED2[15];
  __IO uint16_t  RF_SCAN_FEEDBACK_REG;              /*!< (@ 0x50002040) RF_SCAN_FEEDBACK_REG                                   */
  __IO uint16_t  RF_REF_OSC_BLE_REG;                /*!< (@ 0x50002042) RF_REF_OSC_BLE_REG                                     */
  __IO uint16_t  RF_REF_OSC_FTDF_REG;               /*!< (@ 0x50002044) RF_REF_OSC_FTDF_REG                                    */
  __I  uint16_t  RESERVED3[5];
  __IO uint16_t  RF_CAL_CTRL_REG;                   /*!< (@ 0x50002050) RF_CAL_CTRL_REG                                        */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  RF_IRQ_CTRL_REG;                   /*!< (@ 0x50002054) RF_IRQ_CTRL_REG                                        */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  RF_ADCI_DC_OFFSET_REG;             /*!< (@ 0x50002058) Must be Retained                                       */
  __IO uint16_t  RF_ADCQ_DC_OFFSET_REG;             /*!< (@ 0x5000205A) Must be Retained                                       */
  __I  uint32_t  RESERVED6[9];
  __IO uint16_t  RF_SPARE1_BLE_REG;                 /*!< (@ 0x50002080) RF_SPARE1_BLE_REG                                      */
  __IO uint16_t  RF_SPARE1_FTDF_REG;                /*!< (@ 0x50002082) RF_SPARE1_FTDF_REG                                     */
  __IO uint16_t  RF_BIAS_CTRL1_BLE_REG;             /*!< (@ 0x50002084) RF_BIAS_CTRL1_BLE_REG                                  */
  __IO uint16_t  RF_BIAS_CTRL1_FTDF_REG;            /*!< (@ 0x50002086) RF_BIAS_CTRL1_FTDF_REG                                 */
  __IO uint16_t  RF_IFF_CTRL1_REG;                  /*!< (@ 0x50002088) RF_IFF_CTRL1_REG                                       */
  __IO uint16_t  RF_ADC_CTRL1_REG;                  /*!< (@ 0x5000208A) RF_ADC_CTRL1_REG                                       */
  __IO uint16_t  RF_ADC_CTRL2_REG;                  /*!< (@ 0x5000208C) RF_ADC_CTRL2_REG                                       */
  __IO uint16_t  RF_ADC_CTRL3_REG;                  /*!< (@ 0x5000208E) RF_ADC_CTRL3_REG                                       */
  __IO uint16_t  RF_PA_CTRL_REG;                    /*!< (@ 0x50002090) Removed obsolete values of bits 10:7, pa_pw back
                                                         to 4                                                                  */
  __IO uint16_t  RF_MGC_CTRL_REG;                   /*!< (@ 0x50002092) RF_MGC_CTRL_REG                                        */
  __IO uint16_t  RF_VCOVAR_CTRL_REG;                /*!< (@ 0x50002094) RF_VCOVAR_CTRL_REG                                     */
  __IO uint16_t  RF_PFD_CTRL_REG;                   /*!< (@ 0x50002096) RF_PFD_CTRL_REG                                        */
  __IO uint16_t  RF_CP_CTRL_BLE_REG;                /*!< (@ 0x50002098) RF_CP_CTRL_BLE_REG                                     */
  __IO uint16_t  RF_CP_CTRL_FTDF_REG;               /*!< (@ 0x5000209A) RF_CP_CTRL_FTDF_REG                                    */
  __IO uint16_t  RF_LF_RES_CTRL_BLE_REG;            /*!< (@ 0x5000209C) LF resistor setting in BLE mode                        */
  __IO uint16_t  RF_LF_RES_CTRL_FTDF_REG;           /*!< (@ 0x5000209E) LF resistor setting in FTDF mode                       */
  __IO uint16_t  RF_MIXER_CTRL1_BLE_REG;            /*!< (@ 0x500020A0) RF_MIXER_CTRL1_BLE_REG                                 */
  __IO uint16_t  RF_MIXER_CTRL1_FTDF_REG;           /*!< (@ 0x500020A2) RF_MIXER_CTRL1_FTDF_REG                                */
  __IO uint16_t  RF_MIXER_CTRL2_REG;                /*!< (@ 0x500020A4) RF_MIXER_CTRL2_REG                                     */
  __IO uint16_t  RF_LF_CTRL_REG;                    /*!< (@ 0x500020A6) RF_LF_CTRL_REG                                         */
  __IO uint16_t  RF_TDC_CTRL_REG;                   /*!< (@ 0x500020A8) TDC settings                                           */
  __IO uint16_t  RF_IO_CTRL1_REG;                   /*!< (@ 0x500020AA) RF_IO_CTRL1_REG                                        */
  __IO uint16_t  RF_LNA_CTRL1_REG;                  /*!< (@ 0x500020AC) RF_LNA_CTRL1_REG                                       */
  __IO uint16_t  RF_LNA_CTRL2_REG;                  /*!< (@ 0x500020AE) RF_LNA_CTRL2_REG                                       */
  __IO uint16_t  RF_LNA_CTRL3_REG;                  /*!< (@ 0x500020B0) RF_LNA_CTRL3_REG                                       */
  __IO uint16_t  RF_VCO_AMP_CTRL1_REG;              /*!< (@ 0x500020B2) RF_VCO_AMP_CTRL1_REG                                   */
  __IO uint16_t  RF_VCO_AMP_CTRL2_REG;              /*!< (@ 0x500020B4) RF_VCO_AMP_CTRL2_REG                                   */
  __I  uint16_t  RESERVED7[5];
  __IO uint16_t  RF_TX_PWR_BLE_REG;                 /*!< (@ 0x500020C0) TX Power setting                                       */
  __IO uint16_t  RF_TX_PWR_LUT_1_REG;               /*!< (@ 0x500020C2) TX Power setting 1                                     */
  __IO uint16_t  RF_TX_PWR_LUT_2_REG;               /*!< (@ 0x500020C4) TX Power setting 2                                     */
  __IO uint16_t  RF_TX_PWR_LUT_3_REG;               /*!< (@ 0x500020C6) TX Power setting 3                                     */
  __IO uint16_t  RF_TX_PWR_LUT_4_REG;               /*!< (@ 0x500020C8) TX Power setting 4                                     */
  __IO uint16_t  RF_TX_PWR_LUT_5_REG;               /*!< (@ 0x500020CA) TX Power setting 5                                     */
  __IO uint16_t  RF_TX_PWR_LUT_6_REG;               /*!< (@ 0x500020CC) TX Power setting 6                                     */
  __IO uint16_t  RF_TX_PWR_LUT_7_REG;               /*!< (@ 0x500020CE) TX Power setting 7                                     */
  __IO uint16_t  RF_TX_PWR_FTDF_REG;                /*!< (@ 0x500020D0) TX Power setting                                       */
  __IO uint16_t  RF_TX_PWR_LUT_RD_REG;              /*!< (@ 0x500020D2) TX Power read back                                     */
  __IO uint16_t  RF_DIV_IQ_RX_REG;                  /*!< (@ 0x500020D4) Bias trimming of IQ divider                            */
  __IO uint16_t  RF_DIV_IQ_TX_REG;                  /*!< (@ 0x500020D6) Bias trimming of IQ divider                            */
  __IO uint16_t  RF_LO_IQ_TRIM_REG;                 /*!< (@ 0x500020D8) Trim settings for IQ LO path                           */
  __IO uint16_t  RF_TXDAC_CTRL_REG;                 /*!< (@ 0x500020DA) Control settings for the TXDAC                         */
  __IO uint16_t  RF_TXDAC_CAL_CAP_STAT_REG;         /*!< (@ 0x500020DC) Current CAL CAP value for TXDAC                        */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  RF_IFF_RESULT_REG;                 /*!< (@ 0x500020E0) Not retained                                           */
  __IO uint16_t  RF_IFF_CC_BLE_SET1_REG;            /*!< (@ 0x500020E2) Must be retained                                       */
  __IO uint16_t  RF_IFF_CC_BLE_SET2_REG;            /*!< (@ 0x500020E4) Must be retained                                       */
  __IO uint16_t  RF_IFF_CC_FTDF_SET1_REG;           /*!< (@ 0x500020E6) Must be retained                                       */
  __IO uint16_t  RF_IFF_CC_FTDF_SET2_REG;           /*!< (@ 0x500020E8) Must be retained                                       */
  __IO uint16_t  RF_IFF_CAL_CAP_STAT_REG;           /*!< (@ 0x500020EA) Current CAL_CAP value applied to IF                    */
  __IO uint16_t  RF_MIX_CAL_CAP_STAT_REG;           /*!< (@ 0x500020EC) Current CAL_CAP value applied to IF                    */
  __IO uint16_t  RF_LF_CAL_CAP_STAT_REG;            /*!< (@ 0x500020EE) Current CAL_CAP value applied to IF                    */
} RFCU_Type;


/* ================================================================================ */
/* ================                   RFCU_POWER                   ================ */
/* ================================================================================ */


/**
  * @brief RFCU_POWER registers (RFCU_POWER)
  */

