openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
typedef struct {                                    /*!< (@ 0x50002200) RFCU_POWER Structure                                   */
  __IO uint16_t  RF_ENABLE_CONFIG0_REG;             /*!< (@ 0x50002200) RF_ENABLE_CONFIG0_REG                                  */
  __IO uint16_t  RF_ENABLE_CONFIG1_REG;             /*!< (@ 0x50002202) RF_ENABLE_CONFIG1_REG                                  */
  __IO uint16_t  RF_ENABLE_CONFIG2_REG;             /*!< (@ 0x50002204) RF_ENABLE_CONFIG2_REG                                  */
  __IO uint16_t  RF_ENABLE_CONFIG3_REG;             /*!< (@ 0x50002206) RF_ENABLE_CONFIG3_REG                                  */
  __IO uint16_t  RF_ENABLE_CONFIG4_REG;             /*!< (@ 0x50002208) RF_ENABLE_CONFIG4_REG                                  */
  __IO uint16_t  RF_ENABLE_CONFIG5_REG;             /*!< (@ 0x5000220A) RF_ENABLE_CONFIG5_REG                                  */
  __IO uint16_t  RF_ENABLE_CONFIG6_REG;             /*!< (@ 0x5000220C) RF_ENABLE_CONFIG6_REG                                  */
  __IO uint16_t  RF_ENABLE_CONFIG7_REG;             /*!< (@ 0x5000220E) RF_ENABLE_CONFIG7_REG                                  */
  __IO uint16_t  RF_ENABLE_CONFIG8_REG;             /*!< (@ 0x50002210) RF_ENABLE_CONFIG8_REG                                  */
  __IO uint16_t  RF_ENABLE_CONFIG9_REG;             /*!< (@ 0x50002212) RF_ENABLE_CONFIG9_REG                                  */
  __IO uint16_t  RF_ENABLE_CONFIG10_REG;            /*!< (@ 0x50002214) RF_ENABLE_CONFIG10_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG11_REG;            /*!< (@ 0x50002216) RF_ENABLE_CONFIG11_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG12_REG;            /*!< (@ 0x50002218) RF_ENABLE_CONFIG12_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG13_REG;            /*!< (@ 0x5000221A) RF_ENABLE_CONFIG13_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG14_REG;            /*!< (@ 0x5000221C) RF_ENABLE_CONFIG14_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG15_REG;            /*!< (@ 0x5000221E) RF_ENABLE_CONFIG15_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG16_REG;            /*!< (@ 0x50002220) RF_ENABLE_CONFIG16_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG17_REG;            /*!< (@ 0x50002222) RF_ENABLE_CONFIG17_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG18_REG;            /*!< (@ 0x50002224) RF_ENABLE_CONFIG18_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG19_REG;            /*!< (@ 0x50002226) RF_ENABLE_CONFIG19_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG20_REG;            /*!< (@ 0x50002228) RF_ENABLE_CONFIG20_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG21_REG;            /*!< (@ 0x5000222A) RF_ENABLE_CONFIG21_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG22_REG;            /*!< (@ 0x5000222C) RF_ENABLE_CONFIG22_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG23_BLE_REG;        /*!< (@ 0x5000222E) RF_ENABLE_CONFIG23_BLE_REG                             */
  __IO uint16_t  RF_ENABLE_CONFIG24_BLE_REG;        /*!< (@ 0x50002230) RF_ENABLE_CONFIG24_BLE_REG                             */
  __IO uint16_t  RF_ENABLE_CONFIG25_REG;            /*!< (@ 0x50002232) RF_ENABLE_CONFIG25_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG26_REG;            /*!< (@ 0x50002234) RF_ENABLE_CONFIG26_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG27_REG;            /*!< (@ 0x50002236) RF_ENABLE_CONFIG27_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG28_REG;            /*!< (@ 0x50002238) RF_ENABLE_CONFIG28_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG29_REG;            /*!< (@ 0x5000223A) RF_ENABLE_CONFIG29_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG30_REG;            /*!< (@ 0x5000223C) RF_ENABLE_CONFIG30_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG31_BLE_REG;        /*!< (@ 0x5000223E) RF_ENABLE_CONFIG31_BLE_REG                             */
  __IO uint16_t  RF_ENABLE_CONFIG32_REG;            /*!< (@ 0x50002240) RF_ENABLE_CONFIG32_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG33_REG;            /*!< (@ 0x50002242) RF_ENABLE_CONFIG33_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG34_REG;            /*!< (@ 0x50002244) RF_ENABLE_CONFIG34_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG35_BLE_REG;        /*!< (@ 0x50002246) RF_ENABLE_CONFIG35_BLE_REG                             */
  __IO uint16_t  RF_ENABLE_CONFIG36_REG;            /*!< (@ 0x50002248) RF_ENABLE_CONFIG36_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG37_BLE_REG;        /*!< (@ 0x5000224A) RF_ENABLE_CONFIG37_BLE_REG                             */
  __IO uint16_t  RF_ENABLE_CONFIG38_BLE_REG;        /*!< (@ 0x5000224C) RF_ENABLE_CONFIG38_BLE_REG                             */
  __IO uint16_t  RF_ENABLE_CONFIG39_REG;            /*!< (@ 0x5000224E) RF_ENABLE_CONFIG39_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG40_REG;            /*!< (@ 0x50002250) RF_ENABLE_CONFIG40_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG41_REG;            /*!< (@ 0x50002252) RF_ENABLE_CONFIG41_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG42_REG;            /*!< (@ 0x50002254) RF_ENABLE_CONFIG42_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG43_REG;            /*!< (@ 0x50002256) RF_ENABLE_CONFIG43_REG                                 */
  __IO uint16_t  RF_ENABLE_CONFIG44_BLE_REG;        /*!< (@ 0x50002258) RF_ENABLE_CONFIG44_BLE_REG                             */
  __IO uint16_t  RF_ENABLE_CONFIG45_BLE_REG;        /*!< (@ 0x5000225A) RF_ENABLE_CONFIG45_BLE_REG                             */
  __IO uint16_t  RF_ENABLE_CONFIG46_BLE_REG;        /*!< (@ 0x5000225C) RF_ENABLE_CONFIG46_BLE_REG                             */
  __IO uint16_t  RF_ENABLE_CONFIG47_BLE_REG;        /*!< (@ 0x5000225E) RF_ENABLE_CONFIG47_BLE_REG                             */
  __IO uint16_t  RF_ENABLE_CONFIG48_BLE_REG;        /*!< (@ 0x50002260) RF_ENABLE_CONFIG48_BLE_REG                             */
  __IO uint16_t  RF_ENABLE_CONFIG49_BLE_REG;        /*!< (@ 0x50002262) RF_ENABLE_CONFIG49_BLE_REG                             */
  __I  uint16_t  RESERVED[37];
  __IO uint16_t  RF_ENABLE_CONFIG23_FTDF_REG;       /*!< (@ 0x500022AE) RF_ENABLE_CONFIG23_FTDF_REG                            */
  __IO uint16_t  RF_ENABLE_CONFIG24_FTDF_REG;       /*!< (@ 0x500022B0) RF_ENABLE_CONFIG24_FTDF_REG                            */
  __I  uint16_t  RESERVED1[6];
  __IO uint16_t  RF_ENABLE_CONFIG31_FTDF_REG;       /*!< (@ 0x500022BE) RF_ENABLE_CONFIG31_FTDF_REG                            */
  __I  uint16_t  RESERVED2[3];
  __IO uint16_t  RF_ENABLE_CONFIG35_FTDF_REG;       /*!< (@ 0x500022C6) RF_ENABLE_CONFIG35_FTDF_REG                            */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  RF_ENABLE_CONFIG37_FTDF_REG;       /*!< (@ 0x500022CA) RF_ENABLE_CONFIG37_FTDF_REG                            */
  __IO uint16_t  RF_ENABLE_CONFIG38_FTDF_REG;       /*!< (@ 0x500022CC) RF_ENABLE_CONFIG38_FTDF_REG                            */
  __I  uint16_t  RESERVED4[5];
  __IO uint16_t  RF_ENABLE_CONFIG44_FTDF_REG;       /*!< (@ 0x500022D8) RF_ENABLE_CONFIG44_FTDF_REG                            */
  __IO uint16_t  RF_ENABLE_CONFIG45_FTDF_REG;       /*!< (@ 0x500022DA) RF_ENABLE_CONFIG45_FTDF_REG                            */
  __IO uint16_t  RF_ENABLE_CONFIG46_FTDF_REG;       /*!< (@ 0x500022DC) RF_ENABLE_CONFIG46_FTDF_REG                            */
  __IO uint16_t  RF_ENABLE_CONFIG47_FTDF_REG;       /*!< (@ 0x500022DE) RF_ENABLE_CONFIG47_FTDF_REG                            */
  __IO uint16_t  RF_ENABLE_CONFIG48_FTDF_REG;       /*!< (@ 0x500022E0) RF_ENABLE_CONFIG48_FTDF_REG                            */
  __IO uint16_t  RF_ENABLE_CONFIG49_FTDF_REG;       /*!< (@ 0x500022E2) RF_ENABLE_CONFIG49_FTDF_REG                            */
  __I  uint16_t  RESERVED5[15];
  __IO uint16_t  RF_CNTRL_TIMER_1_REG;              /*!< (@ 0x50002302) RF_CNTRL_TIMER_1_REG                                   */
  __IO uint16_t  RF_CNTRL_TIMER_2_REG;              /*!< (@ 0x50002304) RF_CNTRL_TIMER_2_REG                                   */
  __IO uint16_t  RF_CNTRL_TIMER_3_REG;              /*!< (@ 0x50002306) RF_CNTRL_TIMER_3_REG                                   */
  __IO uint16_t  RF_CNTRL_TIMER_4_REG;              /*!< (@ 0x50002308) RF_CNTRL_TIMER_4_REG                                   */
  __IO uint16_t  RF_CNTRL_TIMER_5_REG;              /*!< (@ 0x5000230A) RF_CNTRL_TIMER_5_REG                                   */
  __IO uint16_t  RF_CNTRL_TIMER_6_REG;              /*!< (@ 0x5000230C) RF_CNTRL_TIMER_6_REG                                   */
  __IO uint16_t  RF_CNTRL_TIMER_7_REG;              /*!< (@ 0x5000230E) RF_CNTRL_TIMER_7_REG                                   */
  __IO uint16_t  RF_CNTRL_TIMER_8_REG;              /*!< (@ 0x50002310) RF_CNTRL_TIMER_8_REG                                   */
  __IO uint16_t  RF_CNTRL_TIMER_9_REG;              /*!< (@ 0x50002312) RF_CNTRL_TIMER_9_REG                                   */
  __IO uint16_t  RF_CNTRL_TIMER_10_REG;             /*!< (@ 0x50002314) RF_CNTRL_TIMER_10_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_11_REG;             /*!< (@ 0x50002316) RF_CNTRL_TIMER_11_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_12_REG;             /*!< (@ 0x50002318) RF_CNTRL_TIMER_12_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_13_REG;             /*!< (@ 0x5000231A) RF_CNTRL_TIMER_13_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_14_REG;             /*!< (@ 0x5000231C) RF_CNTRL_TIMER_14_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_15_REG;             /*!< (@ 0x5000231E) RF_CNTRL_TIMER_15_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_16_REG;             /*!< (@ 0x50002320) RF_CNTRL_TIMER_16_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_17_REG;             /*!< (@ 0x50002322) RF_CNTRL_TIMER_17_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_18_REG;             /*!< (@ 0x50002324) RF_CNTRL_TIMER_18_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_19_REG;             /*!< (@ 0x50002326) RF_CNTRL_TIMER_19_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_20_REG;             /*!< (@ 0x50002328) RF_CNTRL_TIMER_20_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_21_REG;             /*!< (@ 0x5000232A) RF_CNTRL_TIMER_21_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_22_REG;             /*!< (@ 0x5000232C) RF_CNTRL_TIMER_22_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_23_REG;             /*!< (@ 0x5000232E) RF_CNTRL_TIMER_23_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_24_REG;             /*!< (@ 0x50002330) RF_CNTRL_TIMER_24_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_25_REG;             /*!< (@ 0x50002332) RF_CNTRL_TIMER_25_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_26_REG;             /*!< (@ 0x50002334) RF_CNTRL_TIMER_26_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_27_REG;             /*!< (@ 0x50002336) RF_CNTRL_TIMER_27_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_28_REG;             /*!< (@ 0x50002338) RF_CNTRL_TIMER_28_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_29_REG;             /*!< (@ 0x5000233A) RF_CNTRL_TIMER_29_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_30_REG;             /*!< (@ 0x5000233C) RF_CNTRL_TIMER_30_REG                                  */
  __IO uint16_t  RF_CNTRL_TIMER_31_REG;             /*!< (@ 0x5000233E) RF_CNTRL_TIMER_31_REG                                  */
  __I  uint32_t  RESERVED6[16];
  __IO uint16_t  RF_ALWAYS_EN1_REG;                 /*!< (@ 0x50002380) RF_ALWAYS_EN1_REG                                      */
  __IO uint16_t  RF_ALWAYS_EN2_REG;                 /*!< (@ 0x50002382) RF_ALWAYS_EN2_REG                                      */
  __IO uint16_t  RF_ALWAYS_EN3_REG;                 /*!< (@ 0x50002384) RF_ALWAYS_EN3_REG                                      */
  __IO uint16_t  RF_ALWAYS_EN4_REG;                 /*!< (@ 0x50002386) RF_ALWAYS_EN4_REG                                      */
  __IO uint16_t  RF_PORT_EN_BLE_REG;                /*!< (@ 0x50002388) RF_PORT_EN_BLE_REG                                     */
  __IO uint16_t  RF_PORT_EN_FTDF_REG;               /*!< (@ 0x5000238A) RF_PORT_EN_FTDF_REG                                    */
  __IO uint16_t  RF_PORT_POL_REG;                   /*!< (@ 0x5000238C) RF_PORT_POL_REG                                        */
} RFCU_POWER_Type;


/* ================================================================================ */
/* ================                      RFPT                      ================ */
/* ================================================================================ */


/**
  * @brief RFPT registers (RFPT)
  */

typedef struct {                                    /*!< (@ 0x50003600) RFPT Structure                                         */
  __IO uint16_t  RFPT_CTRL_REG;                     /*!< (@ 0x50003600) Control register                                       */
  __IO uint16_t  RFPT_ADDRL_REG;                    /*!< (@ 0x50003602) AHB master start address (Low part)                    */
  __IO uint16_t  RFPT_ADDRH_REG;                    /*!< (@ 0x50003604) AHB master start address (High part)                   */
  __IO uint16_t  RFPT_LEN_REG;                      /*!< (@ 0x50003606) Data length register                                   */
  __IO uint16_t  RFPT_STAT_REG;                     /*!< (@ 0x50003608) Status register                                        */
  __IO uint16_t  RFPT_CRV_ADDRL_REG;                /*!< (@ 0x5000360A) AHB master current address (Low part)                  */
  __IO uint16_t  RFPT_CRV_ADDRH_REG;                /*!< (@ 0x5000360C) AHB master current address (High part)                 */
  __IO uint16_t  RFPT_CRV_LEN_REG;                  /*!< (@ 0x5000360E) The remaining data to be transferred                   */
} RFPT_Type;


/* ================================================================================ */
/* ================                       SPI                      ================ */
/* ================================================================================ */


/**
  * @brief SPI registers (SPI)
  */

