openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* -------------------------  ANAMISC_CHARGER_STATUS_REG  ------------------------- */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_CC_MODE_Pos (0UL)            /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_CC_MODE (Bit 0)         */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_CC_MODE_Msk (0x1UL)          /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_CC_MODE (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_CV_MODE_Pos (1UL)            /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_CV_MODE (Bit 1)         */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_CV_MODE_Msk (0x2UL)          /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_CV_MODE (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_STATUS_REG_END_OF_CHARGE_Pos (2UL)              /*!< ANAMISC CHARGER_STATUS_REG: END_OF_CHARGE (Bit 2)           */
#define ANAMISC_CHARGER_STATUS_REG_END_OF_CHARGE_Msk (0x4UL)            /*!< ANAMISC CHARGER_STATUS_REG: END_OF_CHARGE (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_BATTEMP_LOW_Pos (3UL)        /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_BATTEMP_LOW (Bit 3)     */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_BATTEMP_LOW_Msk (0x8UL)      /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_BATTEMP_LOW (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_BATTEMP_OK_Pos (4UL)         /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_BATTEMP_OK (Bit 4)      */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_BATTEMP_OK_Msk (0x10UL)      /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_BATTEMP_OK (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_BATTEMP_HIGH_Pos (5UL)       /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_BATTEMP_HIGH (Bit 5)    */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_BATTEMP_HIGH_Msk (0x20UL)    /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_BATTEMP_HIGH (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_TMODE_PROT_Pos (6UL)         /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_TMODE_PROT (Bit 6)      */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_TMODE_PROT_Msk (0x40UL)      /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_TMODE_PROT (Bitfield-Mask: 0x01) */

/* ----------------------------  ANAMISC_SOC_CTRL1_REG  --------------------------- */
#define ANAMISC_SOC_CTRL1_REG_SOC_ENABLE_Pos  (0UL)                     /*!< ANAMISC SOC_CTRL1_REG: SOC_ENABLE (Bit 0)                   */
#define ANAMISC_SOC_CTRL1_REG_SOC_ENABLE_Msk  (0x1UL)                   /*!< ANAMISC SOC_CTRL1_REG: SOC_ENABLE (Bitfield-Mask: 0x01)     */
#define ANAMISC_SOC_CTRL1_REG_SOC_RESET_CHARGE_Pos (1UL)                /*!< ANAMISC SOC_CTRL1_REG: SOC_RESET_CHARGE (Bit 1)             */
#define ANAMISC_SOC_CTRL1_REG_SOC_RESET_CHARGE_Msk (0x2UL)              /*!< ANAMISC SOC_CTRL1_REG: SOC_RESET_CHARGE (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_CTRL1_REG_SOC_RESET_AVG_Pos (2UL)                   /*!< ANAMISC SOC_CTRL1_REG: SOC_RESET_AVG (Bit 2)                */
#define ANAMISC_SOC_CTRL1_REG_SOC_RESET_AVG_Msk (0x4UL)                 /*!< ANAMISC SOC_CTRL1_REG: SOC_RESET_AVG (Bitfield-Mask: 0x01)  */
#define ANAMISC_SOC_CTRL1_REG_SOC_MUTE_Pos    (3UL)                     /*!< ANAMISC SOC_CTRL1_REG: SOC_MUTE (Bit 3)                     */
#define ANAMISC_SOC_CTRL1_REG_SOC_MUTE_Msk    (0x8UL)                   /*!< ANAMISC SOC_CTRL1_REG: SOC_MUTE (Bitfield-Mask: 0x01)       */
#define ANAMISC_SOC_CTRL1_REG_SOC_GPIO_Pos    (4UL)                     /*!< ANAMISC SOC_CTRL1_REG: SOC_GPIO (Bit 4)                     */
#define ANAMISC_SOC_CTRL1_REG_SOC_GPIO_Msk    (0x10UL)                  /*!< ANAMISC SOC_CTRL1_REG: SOC_GPIO (Bitfield-Mask: 0x01)       */
#define ANAMISC_SOC_CTRL1_REG_SOC_SIGN_Pos    (5UL)                     /*!< ANAMISC SOC_CTRL1_REG: SOC_SIGN (Bit 5)                     */
#define ANAMISC_SOC_CTRL1_REG_SOC_SIGN_Msk    (0x20UL)                  /*!< ANAMISC SOC_CTRL1_REG: SOC_SIGN (Bitfield-Mask: 0x01)       */
#define ANAMISC_SOC_CTRL1_REG_SOC_IDAC_Pos    (6UL)                     /*!< ANAMISC SOC_CTRL1_REG: SOC_IDAC (Bit 6)                     */
#define ANAMISC_SOC_CTRL1_REG_SOC_IDAC_Msk    (0xc0UL)                  /*!< ANAMISC SOC_CTRL1_REG: SOC_IDAC (Bitfield-Mask: 0x03)       */
#define ANAMISC_SOC_CTRL1_REG_SOC_LPF_Pos     (8UL)                     /*!< ANAMISC SOC_CTRL1_REG: SOC_LPF (Bit 8)                      */
#define ANAMISC_SOC_CTRL1_REG_SOC_LPF_Msk     (0x100UL)                 /*!< ANAMISC SOC_CTRL1_REG: SOC_LPF (Bitfield-Mask: 0x01)        */
#define ANAMISC_SOC_CTRL1_REG_SOC_CLK_Pos     (9UL)                     /*!< ANAMISC SOC_CTRL1_REG: SOC_CLK (Bit 9)                      */
#define ANAMISC_SOC_CTRL1_REG_SOC_CLK_Msk     (0xe00UL)                 /*!< ANAMISC SOC_CTRL1_REG: SOC_CLK (Bitfield-Mask: 0x07)        */
#define ANAMISC_SOC_CTRL1_REG_SOC_BIAS_Pos    (12UL)                    /*!< ANAMISC SOC_CTRL1_REG: SOC_BIAS (Bit 12)                    */
#define ANAMISC_SOC_CTRL1_REG_SOC_BIAS_Msk    (0x3000UL)                /*!< ANAMISC SOC_CTRL1_REG: SOC_BIAS (Bitfield-Mask: 0x03)       */
#define ANAMISC_SOC_CTRL1_REG_SOC_CINT_Pos    (14UL)                    /*!< ANAMISC SOC_CTRL1_REG: SOC_CINT (Bit 14)                    */
#define ANAMISC_SOC_CTRL1_REG_SOC_CINT_Msk    (0xc000UL)                /*!< ANAMISC SOC_CTRL1_REG: SOC_CINT (Bitfield-Mask: 0x03)       */

/* ----------------------------  ANAMISC_SOC_CTRL2_REG  --------------------------- */
#define ANAMISC_SOC_CTRL2_REG_SOC_RVI_Pos     (0UL)                     /*!< ANAMISC SOC_CTRL2_REG: SOC_RVI (Bit 0)                      */
#define ANAMISC_SOC_CTRL2_REG_SOC_RVI_Msk     (0x3UL)                   /*!< ANAMISC SOC_CTRL2_REG: SOC_RVI (Bitfield-Mask: 0x03)        */
#define ANAMISC_SOC_CTRL2_REG_SOC_SCYCLE_Pos  (2UL)                     /*!< ANAMISC SOC_CTRL2_REG: SOC_SCYCLE (Bit 2)                   */
#define ANAMISC_SOC_CTRL2_REG_SOC_SCYCLE_Msk  (0x1cUL)                  /*!< ANAMISC SOC_CTRL2_REG: SOC_SCYCLE (Bitfield-Mask: 0x07)     */
#define ANAMISC_SOC_CTRL2_REG_SOC_DCYCLE_Pos  (5UL)                     /*!< ANAMISC SOC_CTRL2_REG: SOC_DCYCLE (Bit 5)                   */
#define ANAMISC_SOC_CTRL2_REG_SOC_DCYCLE_Msk  (0x20UL)                  /*!< ANAMISC SOC_CTRL2_REG: SOC_DCYCLE (Bitfield-Mask: 0x01)     */
#define ANAMISC_SOC_CTRL2_REG_SOC_ICM_Pos     (6UL)                     /*!< ANAMISC SOC_CTRL2_REG: SOC_ICM (Bit 6)                      */
#define ANAMISC_SOC_CTRL2_REG_SOC_ICM_Msk     (0xc0UL)                  /*!< ANAMISC SOC_CTRL2_REG: SOC_ICM (Bitfield-Mask: 0x03)        */
#define ANAMISC_SOC_CTRL2_REG_SOC_CHOP_Pos    (8UL)                     /*!< ANAMISC SOC_CTRL2_REG: SOC_CHOP (Bit 8)                     */
#define ANAMISC_SOC_CTRL2_REG_SOC_CHOP_Msk    (0x700UL)                 /*!< ANAMISC SOC_CTRL2_REG: SOC_CHOP (Bitfield-Mask: 0x07)       */
#define ANAMISC_SOC_CTRL2_REG_SOC_CMIREG_ENABLE_Pos (11UL)              /*!< ANAMISC SOC_CTRL2_REG: SOC_CMIREG_ENABLE (Bit 11)           */
#define ANAMISC_SOC_CTRL2_REG_SOC_CMIREG_ENABLE_Msk (0x800UL)           /*!< ANAMISC SOC_CTRL2_REG: SOC_CMIREG_ENABLE (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_CTRL2_REG_SOC_MAW_Pos     (12UL)                    /*!< ANAMISC SOC_CTRL2_REG: SOC_MAW (Bit 12)                     */
#define ANAMISC_SOC_CTRL2_REG_SOC_MAW_Msk     (0x7000UL)                /*!< ANAMISC SOC_CTRL2_REG: SOC_MAW (Bitfield-Mask: 0x07)        */
#define ANAMISC_SOC_CTRL2_REG_SOC_DYNAVG_Pos  (15UL)                    /*!< ANAMISC SOC_CTRL2_REG: SOC_DYNAVG (Bit 15)                  */
#define ANAMISC_SOC_CTRL2_REG_SOC_DYNAVG_Msk  (0x8000UL)                /*!< ANAMISC SOC_CTRL2_REG: SOC_DYNAVG (Bitfield-Mask: 0x01)     */

