openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* ---------------------------  ANAMISC_CLK_REF_CNT_REG  -------------------------- */
#define ANAMISC_CLK_REF_CNT_REG_REF_CNT_VAL_Pos (0UL)                   /*!< ANAMISC CLK_REF_CNT_REG: REF_CNT_VAL (Bit 0)                */
#define ANAMISC_CLK_REF_CNT_REG_REF_CNT_VAL_Msk (0xffffUL)              /*!< ANAMISC CLK_REF_CNT_REG: REF_CNT_VAL (Bitfield-Mask: 0xffff) */

/* --------------------------  ANAMISC_CLK_REF_VAL_L_REG  ------------------------- */
#define ANAMISC_CLK_REF_VAL_L_REG_XTAL_CNT_VAL_Pos (0UL)                /*!< ANAMISC CLK_REF_VAL_L_REG: XTAL_CNT_VAL (Bit 0)             */
#define ANAMISC_CLK_REF_VAL_L_REG_XTAL_CNT_VAL_Msk (0xffffUL)           /*!< ANAMISC CLK_REF_VAL_L_REG: XTAL_CNT_VAL (Bitfield-Mask: 0xffff) */

/* --------------------------  ANAMISC_CLK_REF_VAL_H_REG  ------------------------- */
#define ANAMISC_CLK_REF_VAL_H_REG_XTAL_CNT_VAL_Pos (0UL)                /*!< ANAMISC CLK_REF_VAL_H_REG: XTAL_CNT_VAL (Bit 0)             */
#define ANAMISC_CLK_REF_VAL_H_REG_XTAL_CNT_VAL_Msk (0xffffUL)           /*!< ANAMISC CLK_REF_VAL_H_REG: XTAL_CNT_VAL (Bitfield-Mask: 0xffff) */


/* ================================================================================ */
/* ================          struct 'APU' Position & Mask          ================ */
/* ================================================================================ */


/* ------------------------------  APU_SRC1_CTRL_REG  ----------------------------- */
#define APU_SRC1_CTRL_REG_SRC_EN_Pos          (0UL)                     /*!< APU SRC1_CTRL_REG: SRC_EN (Bit 0)                           */
#define APU_SRC1_CTRL_REG_SRC_EN_Msk          (0x1UL)                   /*!< APU SRC1_CTRL_REG: SRC_EN (Bitfield-Mask: 0x01)             */
#define APU_SRC1_CTRL_REG_SRC_IN_AMODE_Pos    (1UL)                     /*!< APU SRC1_CTRL_REG: SRC_IN_AMODE (Bit 1)                     */
#define APU_SRC1_CTRL_REG_SRC_IN_AMODE_Msk    (0x2UL)                   /*!< APU SRC1_CTRL_REG: SRC_IN_AMODE (Bitfield-Mask: 0x01)       */
#define APU_SRC1_CTRL_REG_SRC_IN_CAL_BYPASS_Pos (2UL)                   /*!< APU SRC1_CTRL_REG: SRC_IN_CAL_BYPASS (Bit 2)                */
#define APU_SRC1_CTRL_REG_SRC_IN_CAL_BYPASS_Msk (0x4UL)                 /*!< APU SRC1_CTRL_REG: SRC_IN_CAL_BYPASS (Bitfield-Mask: 0x01)  */
#define APU_SRC1_CTRL_REG_SRC_IN_DS_Pos       (4UL)                     /*!< APU SRC1_CTRL_REG: SRC_IN_DS (Bit 4)                        */
#define APU_SRC1_CTRL_REG_SRC_IN_DS_Msk       (0x30UL)                  /*!< APU SRC1_CTRL_REG: SRC_IN_DS (Bitfield-Mask: 0x03)          */
#define APU_SRC1_CTRL_REG_SRC_IN_OK_Pos       (6UL)                     /*!< APU SRC1_CTRL_REG: SRC_IN_OK (Bit 6)                        */
#define APU_SRC1_CTRL_REG_SRC_IN_OK_Msk       (0x40UL)                  /*!< APU SRC1_CTRL_REG: SRC_IN_OK (Bitfield-Mask: 0x01)          */
#define APU_SRC1_CTRL_REG_SRC_DITHER_DISABLE_Pos (7UL)                  /*!< APU SRC1_CTRL_REG: SRC_DITHER_DISABLE (Bit 7)               */
#define APU_SRC1_CTRL_REG_SRC_DITHER_DISABLE_Msk (0x80UL)               /*!< APU SRC1_CTRL_REG: SRC_DITHER_DISABLE (Bitfield-Mask: 0x01) */
#define APU_SRC1_CTRL_REG_SRC_OUT_AMODE_Pos   (13UL)                    /*!< APU SRC1_CTRL_REG: SRC_OUT_AMODE (Bit 13)                   */
#define APU_SRC1_CTRL_REG_SRC_OUT_AMODE_Msk   (0x2000UL)                /*!< APU SRC1_CTRL_REG: SRC_OUT_AMODE (Bitfield-Mask: 0x01)      */
#define APU_SRC1_CTRL_REG_SRC_OUT_CAL_BYPASS_Pos (14UL)                 /*!< APU SRC1_CTRL_REG: SRC_OUT_CAL_BYPASS (Bit 14)              */
#define APU_SRC1_CTRL_REG_SRC_OUT_CAL_BYPASS_Msk (0x4000UL)             /*!< APU SRC1_CTRL_REG: SRC_OUT_CAL_BYPASS (Bitfield-Mask: 0x01) */
#define APU_SRC1_CTRL_REG_SRC_OUT_US_Pos      (16UL)                    /*!< APU SRC1_CTRL_REG: SRC_OUT_US (Bit 16)                      */
#define APU_SRC1_CTRL_REG_SRC_OUT_US_Msk      (0x30000UL)               /*!< APU SRC1_CTRL_REG: SRC_OUT_US (Bitfield-Mask: 0x03)         */
#define APU_SRC1_CTRL_REG_SRC_OUT_OK_Pos      (18UL)                    /*!< APU SRC1_CTRL_REG: SRC_OUT_OK (Bit 18)                      */
#define APU_SRC1_CTRL_REG_SRC_OUT_OK_Msk      (0x40000UL)               /*!< APU SRC1_CTRL_REG: SRC_OUT_OK (Bitfield-Mask: 0x01)         */
#define APU_SRC1_CTRL_REG_SRC_RESYNC_Pos      (19UL)                    /*!< APU SRC1_CTRL_REG: SRC_RESYNC (Bit 19)                      */
#define APU_SRC1_CTRL_REG_SRC_RESYNC_Msk      (0x80000UL)               /*!< APU SRC1_CTRL_REG: SRC_RESYNC (Bitfield-Mask: 0x01)         */
#define APU_SRC1_CTRL_REG_SRC_IN_OVFLOW_Pos   (20UL)                    /*!< APU SRC1_CTRL_REG: SRC_IN_OVFLOW (Bit 20)                   */
#define APU_SRC1_CTRL_REG_SRC_IN_OVFLOW_Msk   (0x100000UL)              /*!< APU SRC1_CTRL_REG: SRC_IN_OVFLOW (Bitfield-Mask: 0x01)      */
#define APU_SRC1_CTRL_REG_SRC_IN_UNFLOW_Pos   (21UL)                    /*!< APU SRC1_CTRL_REG: SRC_IN_UNFLOW (Bit 21)                   */
#define APU_SRC1_CTRL_REG_SRC_IN_UNFLOW_Msk   (0x200000UL)              /*!< APU SRC1_CTRL_REG: SRC_IN_UNFLOW (Bitfield-Mask: 0x01)      */
#define APU_SRC1_CTRL_REG_SRC_OUT_OVFLOW_Pos  (22UL)                    /*!< APU SRC1_CTRL_REG: SRC_OUT_OVFLOW (Bit 22)                  */
#define APU_SRC1_CTRL_REG_SRC_OUT_OVFLOW_Msk  (0x400000UL)              /*!< APU SRC1_CTRL_REG: SRC_OUT_OVFLOW (Bitfield-Mask: 0x01)     */
#define APU_SRC1_CTRL_REG_SRC_OUT_UNFLOW_Pos  (23UL)                    /*!< APU SRC1_CTRL_REG: SRC_OUT_UNFLOW (Bit 23)                  */
#define APU_SRC1_CTRL_REG_SRC_OUT_UNFLOW_Msk  (0x800000UL)              /*!< APU SRC1_CTRL_REG: SRC_OUT_UNFLOW (Bitfield-Mask: 0x01)     */
#define APU_SRC1_CTRL_REG_SRC_IN_FLOWCLR_Pos  (24UL)                    /*!< APU SRC1_CTRL_REG: SRC_IN_FLOWCLR (Bit 24)                  */
#define APU_SRC1_CTRL_REG_SRC_IN_FLOWCLR_Msk  (0x1000000UL)             /*!< APU SRC1_CTRL_REG: SRC_IN_FLOWCLR (Bitfield-Mask: 0x01)     */
#define APU_SRC1_CTRL_REG_SRC_OUT_FLOWCLR_Pos (25UL)                    /*!< APU SRC1_CTRL_REG: SRC_OUT_FLOWCLR (Bit 25)                 */
#define APU_SRC1_CTRL_REG_SRC_OUT_FLOWCLR_Msk (0x2000000UL)             /*!< APU SRC1_CTRL_REG: SRC_OUT_FLOWCLR (Bitfield-Mask: 0x01)    */
#define APU_SRC1_CTRL_REG_SRC_PDM_DI_DEL_Pos  (26UL)                    /*!< APU SRC1_CTRL_REG: SRC_PDM_DI_DEL (Bit 26)                  */
#define APU_SRC1_CTRL_REG_SRC_PDM_DI_DEL_Msk  (0xc000000UL)             /*!< APU SRC1_CTRL_REG: SRC_PDM_DI_DEL (Bitfield-Mask: 0x03)     */
#define APU_SRC1_CTRL_REG_SRC_PDM_MODE_Pos    (28UL)                    /*!< APU SRC1_CTRL_REG: SRC_PDM_MODE (Bit 28)                    */
#define APU_SRC1_CTRL_REG_SRC_PDM_MODE_Msk    (0x30000000UL)            /*!< APU SRC1_CTRL_REG: SRC_PDM_MODE (Bitfield-Mask: 0x03)       */
#define APU_SRC1_CTRL_REG_SRC_PDM_DO_DEL_Pos  (30UL)                    /*!< APU SRC1_CTRL_REG: SRC_PDM_DO_DEL (Bit 30)                  */
#define APU_SRC1_CTRL_REG_SRC_PDM_DO_DEL_Msk  (0xc0000000UL)            /*!< APU SRC1_CTRL_REG: SRC_PDM_DO_DEL (Bitfield-Mask: 0x03)     */

/* -----------------------------  APU_SRC1_IN_FS_REG  ----------------------------- */
#define APU_SRC1_IN_FS_REG_SRC_IN_FS_Pos      (0UL)                     /*!< APU SRC1_IN_FS_REG: SRC_IN_FS (Bit 0)                       */
#define APU_SRC1_IN_FS_REG_SRC_IN_FS_Msk      (0xffffffUL)              /*!< APU SRC1_IN_FS_REG: SRC_IN_FS (Bitfield-Mask: 0xffffff)     */

/* -----------------------------  APU_SRC1_OUT_FS_REG  ---------------------------- */
#define APU_SRC1_OUT_FS_REG_SRC_OUT_FS_Pos    (0UL)                     /*!< APU SRC1_OUT_FS_REG: SRC_OUT_FS (Bit 0)                     */
#define APU_SRC1_OUT_FS_REG_SRC_OUT_FS_Msk    (0xffffffUL)              /*!< APU SRC1_OUT_FS_REG: SRC_OUT_FS (Bitfield-Mask: 0xffffff)   */

/* ------------------------------  APU_SRC1_IN1_REG  ------------------------------ */
#define APU_SRC1_IN1_REG_SRC_IN_Pos           (8UL)                     /*!< APU SRC1_IN1_REG: SRC_IN (Bit 8)                            */
#define APU_SRC1_IN1_REG_SRC_IN_Msk           (0xffffff00UL)            /*!< APU SRC1_IN1_REG: SRC_IN (Bitfield-Mask: 0xffffff)          */

/* ------------------------------  APU_SRC1_IN2_REG  ------------------------------ */
#define APU_SRC1_IN2_REG_SRC_IN_Pos           (8UL)                     /*!< APU SRC1_IN2_REG: SRC_IN (Bit 8)                            */
#define APU_SRC1_IN2_REG_SRC_IN_Msk           (0xffffff00UL)            /*!< APU SRC1_IN2_REG: SRC_IN (Bitfield-Mask: 0xffffff)          */

/* ------------------------------  APU_SRC1_OUT1_REG  ----------------------------- */
#define APU_SRC1_OUT1_REG_SRC_OUT_Pos         (8UL)                     /*!< APU SRC1_OUT1_REG: SRC_OUT (Bit 8)                          */
#define APU_SRC1_OUT1_REG_SRC_OUT_Msk         (0xffffff00UL)            /*!< APU SRC1_OUT1_REG: SRC_OUT (Bitfield-Mask: 0xffffff)        */

/* ------------------------------  APU_SRC1_OUT2_REG  ----------------------------- */
#define APU_SRC1_OUT2_REG_SRC_OUT_Pos         (8UL)                     /*!< APU SRC1_OUT2_REG: SRC_OUT (Bit 8)                          */
#define APU_SRC1_OUT2_REG_SRC_OUT_Msk         (0xffffff00UL)            /*!< APU SRC1_OUT2_REG: SRC_OUT (Bitfield-Mask: 0xffffff)        */

/* -------------------------------  APU_APU_MUX_REG  ------------------------------ */
#define APU_APU_MUX_REG_SRC1_MUX_IN_Pos       (0UL)                     /*!< APU APU_MUX_REG: SRC1_MUX_IN (Bit 0)                        */
#define APU_APU_MUX_REG_SRC1_MUX_IN_Msk       (0x7UL)                   /*!< APU APU_MUX_REG: SRC1_MUX_IN (Bitfield-Mask: 0x07)          */
#define APU_APU_MUX_REG_PCM1_MUX_IN_Pos       (3UL)                     /*!< APU APU_MUX_REG: PCM1_MUX_IN (Bit 3)                        */
#define APU_APU_MUX_REG_PCM1_MUX_IN_Msk       (0x38UL)                  /*!< APU APU_MUX_REG: PCM1_MUX_IN (Bitfield-Mask: 0x07)          */
#define APU_APU_MUX_REG_PDM1_MUX_IN_Pos       (6UL)                     /*!< APU APU_MUX_REG: PDM1_MUX_IN (Bit 6)                        */
#define APU_APU_MUX_REG_PDM1_MUX_IN_Msk       (0x40UL)                  /*!< APU APU_MUX_REG: PDM1_MUX_IN (Bitfield-Mask: 0x01)          */

/* -----------------------------  APU_COEF10_SET1_REG  ---------------------------- */
#define APU_COEF10_SET1_REG_SRC_COEF0_Pos     (0UL)                     /*!< APU COEF10_SET1_REG: SRC_COEF0 (Bit 0)                      */
#define APU_COEF10_SET1_REG_SRC_COEF0_Msk     (0xffffUL)                /*!< APU COEF10_SET1_REG: SRC_COEF0 (Bitfield-Mask: 0xffff)      */
#define APU_COEF10_SET1_REG_SRC_COEF1_Pos     (16UL)                    /*!< APU COEF10_SET1_REG: SRC_COEF1 (Bit 16)                     */
#define APU_COEF10_SET1_REG_SRC_COEF1_Msk     (0xffff0000UL)            /*!< APU COEF10_SET1_REG: SRC_COEF1 (Bitfield-Mask: 0xffff)      */

/* -----------------------------  APU_COEF32_SET1_REG  ---------------------------- */
#define APU_COEF32_SET1_REG_SRC_COEF2_Pos     (0UL)                     /*!< APU COEF32_SET1_REG: SRC_COEF2 (Bit 0)                      */
#define APU_COEF32_SET1_REG_SRC_COEF2_Msk     (0xffffUL)                /*!< APU COEF32_SET1_REG: SRC_COEF2 (Bitfield-Mask: 0xffff)      */
#define APU_COEF32_SET1_REG_SRC_COEF3_Pos     (16UL)                    /*!< APU COEF32_SET1_REG: SRC_COEF3 (Bit 16)                     */
#define APU_COEF32_SET1_REG_SRC_COEF3_Msk     (0xffff0000UL)            /*!< APU COEF32_SET1_REG: SRC_COEF3 (Bitfield-Mask: 0xffff)      */

/* -----------------------------  APU_COEF54_SET1_REG  ---------------------------- */
#define APU_COEF54_SET1_REG_SRC_COEF4_Pos     (0UL)                     /*!< APU COEF54_SET1_REG: SRC_COEF4 (Bit 0)                      */
#define APU_COEF54_SET1_REG_SRC_COEF4_Msk     (0xffffUL)                /*!< APU COEF54_SET1_REG: SRC_COEF4 (Bitfield-Mask: 0xffff)      */
#define APU_COEF54_SET1_REG_SRC_COEF5_Pos     (16UL)                    /*!< APU COEF54_SET1_REG: SRC_COEF5 (Bit 16)                     */
#define APU_COEF54_SET1_REG_SRC_COEF5_Msk     (0xffff0000UL)            /*!< APU COEF54_SET1_REG: SRC_COEF5 (Bitfield-Mask: 0xffff)      */

