openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* -----------------------  CHIP_VERSION_CHIP_REVISION_REG  ----------------------- */
#define CHIP_VERSION_CHIP_REVISION_REG_REVISION_ID_Pos (0UL)            /*!< CHIP_VERSION CHIP_REVISION_REG: REVISION_ID (Bit 0)         */
#define CHIP_VERSION_CHIP_REVISION_REG_REVISION_ID_Msk (0xffUL)         /*!< CHIP_VERSION CHIP_REVISION_REG: REVISION_ID (Bitfield-Mask: 0xff) */

/* ------------------------  CHIP_VERSION_CHIP_CONFIG1_REG  ----------------------- */
#define CHIP_VERSION_CHIP_CONFIG1_REG_CHIP_CONFIG1_Pos (0UL)            /*!< CHIP_VERSION CHIP_CONFIG1_REG: CHIP_CONFIG1 (Bit 0)         */
#define CHIP_VERSION_CHIP_CONFIG1_REG_CHIP_CONFIG1_Msk (0xffUL)         /*!< CHIP_VERSION CHIP_CONFIG1_REG: CHIP_CONFIG1 (Bitfield-Mask: 0xff) */

/* ------------------------  CHIP_VERSION_CHIP_CONFIG2_REG  ----------------------- */
#define CHIP_VERSION_CHIP_CONFIG2_REG_CHIP_CONFIG2_Pos (0UL)            /*!< CHIP_VERSION CHIP_CONFIG2_REG: CHIP_CONFIG2 (Bit 0)         */
#define CHIP_VERSION_CHIP_CONFIG2_REG_CHIP_CONFIG2_Msk (0xffUL)         /*!< CHIP_VERSION CHIP_CONFIG2_REG: CHIP_CONFIG2 (Bitfield-Mask: 0xff) */

/* ------------------------  CHIP_VERSION_CHIP_CONFIG3_REG  ----------------------- */
#define CHIP_VERSION_CHIP_CONFIG3_REG_CHIP_CONFIG3_Pos (0UL)            /*!< CHIP_VERSION CHIP_CONFIG3_REG: CHIP_CONFIG3 (Bit 0)         */
#define CHIP_VERSION_CHIP_CONFIG3_REG_CHIP_CONFIG3_Msk (0xffUL)         /*!< CHIP_VERSION CHIP_CONFIG3_REG: CHIP_CONFIG3 (Bitfield-Mask: 0xff) */


/* ================================================================================ */
/* ================          struct 'COEX' Position & Mask         ================ */
/* ================================================================================ */


/* -----------------------------  COEX_COEX_CTRL_REG  ----------------------------- */
#define COEX_COEX_CTRL_REG_PRGING_ARBITER_Pos (0UL)                     /*!< COEX COEX_CTRL_REG: PRGING_ARBITER (Bit 0)                  */
#define COEX_COEX_CTRL_REG_PRGING_ARBITER_Msk (0x1UL)                   /*!< COEX COEX_CTRL_REG: PRGING_ARBITER (Bitfield-Mask: 0x01)    */
#define COEX_COEX_CTRL_REG_DECISION_SW_ALL_Pos (1UL)                    /*!< COEX COEX_CTRL_REG: DECISION_SW_ALL (Bit 1)                 */
#define COEX_COEX_CTRL_REG_DECISION_SW_ALL_Msk (0x2UL)                  /*!< COEX COEX_CTRL_REG: DECISION_SW_ALL (Bitfield-Mask: 0x01)   */
#define COEX_COEX_CTRL_REG_TXRX_MON_FTDF_ALL_Pos (2UL)                  /*!< COEX COEX_CTRL_REG: TXRX_MON_FTDF_ALL (Bit 2)               */
#define COEX_COEX_CTRL_REG_TXRX_MON_FTDF_ALL_Msk (0x4UL)                /*!< COEX COEX_CTRL_REG: TXRX_MON_FTDF_ALL (Bitfield-Mask: 0x01) */
#define COEX_COEX_CTRL_REG_TXRX_MON_BLE_ALL_Pos (3UL)                   /*!< COEX COEX_CTRL_REG: TXRX_MON_BLE_ALL (Bit 3)                */
#define COEX_COEX_CTRL_REG_TXRX_MON_BLE_ALL_Msk (0x8UL)                 /*!< COEX COEX_CTRL_REG: TXRX_MON_BLE_ALL (Bitfield-Mask: 0x01)  */
#define COEX_COEX_CTRL_REG_SMART_ACT_IMPL_Pos (4UL)                     /*!< COEX COEX_CTRL_REG: SMART_ACT_IMPL (Bit 4)                  */
#define COEX_COEX_CTRL_REG_SMART_ACT_IMPL_Msk (0x10UL)                  /*!< COEX COEX_CTRL_REG: SMART_ACT_IMPL (Bitfield-Mask: 0x01)    */
#define COEX_COEX_CTRL_REG_SEL_COEX_DIAG_Pos  (5UL)                     /*!< COEX COEX_CTRL_REG: SEL_COEX_DIAG (Bit 5)                   */
#define COEX_COEX_CTRL_REG_SEL_COEX_DIAG_Msk  (0x60UL)                  /*!< COEX COEX_CTRL_REG: SEL_COEX_DIAG (Bitfield-Mask: 0x03)     */
#define COEX_COEX_CTRL_REG_SEL_FTDF_CCA_Pos   (7UL)                     /*!< COEX COEX_CTRL_REG: SEL_FTDF_CCA (Bit 7)                    */
#define COEX_COEX_CTRL_REG_SEL_FTDF_CCA_Msk   (0x80UL)                  /*!< COEX COEX_CTRL_REG: SEL_FTDF_CCA (Bitfield-Mask: 0x01)      */
#define COEX_COEX_CTRL_REG_SEL_FTDF_PTI_Pos   (8UL)                     /*!< COEX COEX_CTRL_REG: SEL_FTDF_PTI (Bit 8)                    */
#define COEX_COEX_CTRL_REG_SEL_FTDF_PTI_Msk   (0x100UL)                 /*!< COEX COEX_CTRL_REG: SEL_FTDF_PTI (Bitfield-Mask: 0x01)      */
#define COEX_COEX_CTRL_REG_SEL_BLE_PTI_Pos    (9UL)                     /*!< COEX COEX_CTRL_REG: SEL_BLE_PTI (Bit 9)                     */
#define COEX_COEX_CTRL_REG_SEL_BLE_PTI_Msk    (0x200UL)                 /*!< COEX COEX_CTRL_REG: SEL_BLE_PTI (Bitfield-Mask: 0x01)       */
#define COEX_COEX_CTRL_REG_SEL_BLE_WLAN_TX_RX_Pos (10UL)                /*!< COEX COEX_CTRL_REG: SEL_BLE_WLAN_TX_RX (Bit 10)             */
#define COEX_COEX_CTRL_REG_SEL_BLE_WLAN_TX_RX_Msk (0x400UL)             /*!< COEX COEX_CTRL_REG: SEL_BLE_WLAN_TX_RX (Bitfield-Mask: 0x01) */
#define COEX_COEX_CTRL_REG_SEL_BLE_RADIO_BUSY_Pos (11UL)                /*!< COEX COEX_CTRL_REG: SEL_BLE_RADIO_BUSY (Bit 11)             */
#define COEX_COEX_CTRL_REG_SEL_BLE_RADIO_BUSY_Msk (0x1800UL)            /*!< COEX COEX_CTRL_REG: SEL_BLE_RADIO_BUSY (Bitfield-Mask: 0x03) */
#define COEX_COEX_CTRL_REG_IGNORE_EXT_Pos     (13UL)                    /*!< COEX COEX_CTRL_REG: IGNORE_EXT (Bit 13)                     */
#define COEX_COEX_CTRL_REG_IGNORE_EXT_Msk     (0x2000UL)                /*!< COEX COEX_CTRL_REG: IGNORE_EXT (Bitfield-Mask: 0x01)        */
#define COEX_COEX_CTRL_REG_IGNORE_FTDF_Pos    (14UL)                    /*!< COEX COEX_CTRL_REG: IGNORE_FTDF (Bit 14)                    */
#define COEX_COEX_CTRL_REG_IGNORE_FTDF_Msk    (0x4000UL)                /*!< COEX COEX_CTRL_REG: IGNORE_FTDF (Bitfield-Mask: 0x01)       */
#define COEX_COEX_CTRL_REG_IGNORE_BLE_Pos     (15UL)                    /*!< COEX COEX_CTRL_REG: IGNORE_BLE (Bit 15)                     */
#define COEX_COEX_CTRL_REG_IGNORE_BLE_Msk     (0x8000UL)                /*!< COEX COEX_CTRL_REG: IGNORE_BLE (Bitfield-Mask: 0x01)        */

/* -----------------------------  COEX_COEX_STAT_REG  ----------------------------- */
#define COEX_COEX_STAT_REG_COEX_DECISION_PTR_Pos (0UL)                  /*!< COEX COEX_STAT_REG: COEX_DECISION_PTR (Bit 0)               */
#define COEX_COEX_STAT_REG_COEX_DECISION_PTR_Msk (0xfUL)                /*!< COEX COEX_STAT_REG: COEX_DECISION_PTR (Bitfield-Mask: 0x0f) */
#define COEX_COEX_STAT_REG_COEX_DECISION_Pos  (5UL)                     /*!< COEX COEX_STAT_REG: COEX_DECISION (Bit 5)                   */
#define COEX_COEX_STAT_REG_COEX_DECISION_Msk  (0x60UL)                  /*!< COEX COEX_STAT_REG: COEX_DECISION (Bitfield-Mask: 0x03)     */
#define COEX_COEX_STAT_REG_COEX_CLOSING_Pos   (7UL)                     /*!< COEX COEX_STAT_REG: COEX_CLOSING (Bit 7)                    */
#define COEX_COEX_STAT_REG_COEX_CLOSING_Msk   (0x80UL)                  /*!< COEX COEX_STAT_REG: COEX_CLOSING (Bitfield-Mask: 0x01)      */
#define COEX_COEX_STAT_REG_SMART_ACT_Pos      (8UL)                     /*!< COEX COEX_STAT_REG: SMART_ACT (Bit 8)                       */
#define COEX_COEX_STAT_REG_SMART_ACT_Msk      (0x100UL)                 /*!< COEX COEX_STAT_REG: SMART_ACT (Bitfield-Mask: 0x01)         */
#define COEX_COEX_STAT_REG_SMART_PRI_Pos      (9UL)                     /*!< COEX COEX_STAT_REG: SMART_PRI (Bit 9)                       */
#define COEX_COEX_STAT_REG_SMART_PRI_Msk      (0x200UL)                 /*!< COEX COEX_STAT_REG: SMART_PRI (Bitfield-Mask: 0x01)         */
#define COEX_COEX_STAT_REG_EXT_ACT0_Pos       (10UL)                    /*!< COEX COEX_STAT_REG: EXT_ACT0 (Bit 10)                       */
#define COEX_COEX_STAT_REG_EXT_ACT0_Msk       (0x400UL)                 /*!< COEX COEX_STAT_REG: EXT_ACT0 (Bitfield-Mask: 0x01)          */
#define COEX_COEX_STAT_REG_EXT_ACT1_Pos       (11UL)                    /*!< COEX COEX_STAT_REG: EXT_ACT1 (Bit 11)                       */
#define COEX_COEX_STAT_REG_EXT_ACT1_Msk       (0x800UL)                 /*!< COEX COEX_STAT_REG: EXT_ACT1 (Bitfield-Mask: 0x01)          */
#define COEX_COEX_STAT_REG_COEX_RADIO_BUSY_Pos (12UL)                   /*!< COEX COEX_STAT_REG: COEX_RADIO_BUSY (Bit 12)                */
#define COEX_COEX_STAT_REG_COEX_RADIO_BUSY_Msk (0x1000UL)               /*!< COEX COEX_STAT_REG: COEX_RADIO_BUSY (Bitfield-Mask: 0x01)   */
#define COEX_COEX_STAT_REG_IGNORE_EXT_STAT_Pos (13UL)                   /*!< COEX COEX_STAT_REG: IGNORE_EXT_STAT (Bit 13)                */
#define COEX_COEX_STAT_REG_IGNORE_EXT_STAT_Msk (0x2000UL)               /*!< COEX COEX_STAT_REG: IGNORE_EXT_STAT (Bitfield-Mask: 0x01)   */
#define COEX_COEX_STAT_REG_IGNORE_FTDF_STAT_Pos (14UL)                  /*!< COEX COEX_STAT_REG: IGNORE_FTDF_STAT (Bit 14)               */
#define COEX_COEX_STAT_REG_IGNORE_FTDF_STAT_Msk (0x4000UL)              /*!< COEX COEX_STAT_REG: IGNORE_FTDF_STAT (Bitfield-Mask: 0x01)  */
#define COEX_COEX_STAT_REG_IGNORE_BLE_STAT_Pos (15UL)                   /*!< COEX COEX_STAT_REG: IGNORE_BLE_STAT (Bit 15)                */
#define COEX_COEX_STAT_REG_IGNORE_BLE_STAT_Msk (0x8000UL)               /*!< COEX COEX_STAT_REG: IGNORE_BLE_STAT (Bitfield-Mask: 0x01)   */

/* -----------------------------  COEX_COEX_STAT2_REG  ---------------------------- */
#define COEX_COEX_STAT2_REG_COEX_DECISION_WITH_CLOSING_Pos (0UL)        /*!< COEX COEX_STAT2_REG: COEX_DECISION_WITH_CLOSING (Bit 0)     */
#define COEX_COEX_STAT2_REG_COEX_DECISION_WITH_CLOSING_Msk (0x7UL)      /*!< COEX COEX_STAT2_REG: COEX_DECISION_WITH_CLOSING (Bitfield-Mask: 0x07) */
#define COEX_COEX_STAT2_REG_COEX_FTDF_ACTIVE_Pos (3UL)                  /*!< COEX COEX_STAT2_REG: COEX_FTDF_ACTIVE (Bit 3)               */
#define COEX_COEX_STAT2_REG_COEX_FTDF_ACTIVE_Msk (0x8UL)                /*!< COEX COEX_STAT2_REG: COEX_FTDF_ACTIVE (Bitfield-Mask: 0x01) */
#define COEX_COEX_STAT2_REG_COEX_FTDF_RX_EN_Pos (4UL)                   /*!< COEX COEX_STAT2_REG: COEX_FTDF_RX_EN (Bit 4)                */
#define COEX_COEX_STAT2_REG_COEX_FTDF_RX_EN_Msk (0x10UL)                /*!< COEX COEX_STAT2_REG: COEX_FTDF_RX_EN (Bitfield-Mask: 0x01)  */
#define COEX_COEX_STAT2_REG_COEX_FTDF_TX_EN_Pos (5UL)                   /*!< COEX COEX_STAT2_REG: COEX_FTDF_TX_EN (Bit 5)                */
#define COEX_COEX_STAT2_REG_COEX_FTDF_TX_EN_Msk (0x20UL)                /*!< COEX COEX_STAT2_REG: COEX_FTDF_TX_EN (Bitfield-Mask: 0x01)  */
#define COEX_COEX_STAT2_REG_COEX_FTDF_PTI_INT_Pos (6UL)                 /*!< COEX COEX_STAT2_REG: COEX_FTDF_PTI_INT (Bit 6)              */
#define COEX_COEX_STAT2_REG_COEX_FTDF_PTI_INT_Msk (0x1c0UL)             /*!< COEX COEX_STAT2_REG: COEX_FTDF_PTI_INT (Bitfield-Mask: 0x07) */
#define COEX_COEX_STAT2_REG_COEX_BLE_ACTIVE_Pos (9UL)                   /*!< COEX COEX_STAT2_REG: COEX_BLE_ACTIVE (Bit 9)                */
#define COEX_COEX_STAT2_REG_COEX_BLE_ACTIVE_Msk (0x200UL)               /*!< COEX COEX_STAT2_REG: COEX_BLE_ACTIVE (Bitfield-Mask: 0x01)  */
#define COEX_COEX_STAT2_REG_COEX_BLE_RX_EN_Pos (10UL)                   /*!< COEX COEX_STAT2_REG: COEX_BLE_RX_EN (Bit 10)                */
#define COEX_COEX_STAT2_REG_COEX_BLE_RX_EN_Msk (0x400UL)                /*!< COEX COEX_STAT2_REG: COEX_BLE_RX_EN (Bitfield-Mask: 0x01)   */
#define COEX_COEX_STAT2_REG_COEX_BLE_TX_EN_Pos (11UL)                   /*!< COEX COEX_STAT2_REG: COEX_BLE_TX_EN (Bit 11)                */
#define COEX_COEX_STAT2_REG_COEX_BLE_TX_EN_Msk (0x800UL)                /*!< COEX COEX_STAT2_REG: COEX_BLE_TX_EN (Bitfield-Mask: 0x01)   */
#define COEX_COEX_STAT2_REG_COEX_BLE_PTI_INT_Pos (12UL)                 /*!< COEX COEX_STAT2_REG: COEX_BLE_PTI_INT (Bit 12)              */
#define COEX_COEX_STAT2_REG_COEX_BLE_PTI_INT_Msk (0x7000UL)             /*!< COEX COEX_STAT2_REG: COEX_BLE_PTI_INT (Bitfield-Mask: 0x07) */
#define COEX_COEX_STAT2_REG_COEX_EXT_ACT_Pos  (15UL)                    /*!< COEX COEX_STAT2_REG: COEX_EXT_ACT (Bit 15)                  */
#define COEX_COEX_STAT2_REG_COEX_EXT_ACT_Msk  (0x8000UL)                /*!< COEX COEX_STAT2_REG: COEX_EXT_ACT (Bitfield-Mask: 0x01)     */

