openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* -----------------------------  CRG_PER_SRC_DIV_REG  ---------------------------- */
#define CRG_PER_SRC_DIV_REG_SRC_DIV_Pos       (0UL)                     /*!< CRG_PER SRC_DIV_REG: SRC_DIV (Bit 0)                        */
#define CRG_PER_SRC_DIV_REG_SRC_DIV_Msk       (0xffUL)                  /*!< CRG_PER SRC_DIV_REG: SRC_DIV (Bitfield-Mask: 0xff)          */
#define CRG_PER_SRC_DIV_REG_CLK_SRC_EN_Pos    (8UL)                     /*!< CRG_PER SRC_DIV_REG: CLK_SRC_EN (Bit 8)                     */
#define CRG_PER_SRC_DIV_REG_CLK_SRC_EN_Msk    (0x100UL)                 /*!< CRG_PER SRC_DIV_REG: CLK_SRC_EN (Bitfield-Mask: 0x01)       */

/* -------------------------------  CRG_PER_EH_REG  ------------------------------- */
#define CRG_PER_EH_REG_EH_EN_Pos              (0UL)                     /*!< CRG_PER EH_REG: EH_EN (Bit 0)                               */
#define CRG_PER_EH_REG_EH_EN_Msk              (0x1UL)                   /*!< CRG_PER EH_REG: EH_EN (Bitfield-Mask: 0x01)                 */

/* -----------------------------  CRG_PER_USBPAD_REG  ----------------------------- */
#define CRG_PER_USBPAD_REG_USBPAD_EN_Pos      (0UL)                     /*!< CRG_PER USBPAD_REG: USBPAD_EN (Bit 0)                       */
#define CRG_PER_USBPAD_REG_USBPAD_EN_Msk      (0x1UL)                   /*!< CRG_PER USBPAD_REG: USBPAD_EN (Bitfield-Mask: 0x01)         */
#define CRG_PER_USBPAD_REG_USBPHY_FORCE_SW1_OFF_Pos (1UL)               /*!< CRG_PER USBPAD_REG: USBPHY_FORCE_SW1_OFF (Bit 1)            */
#define CRG_PER_USBPAD_REG_USBPHY_FORCE_SW1_OFF_Msk (0x2UL)             /*!< CRG_PER USBPAD_REG: USBPHY_FORCE_SW1_OFF (Bitfield-Mask: 0x01) */
#define CRG_PER_USBPAD_REG_USBPHY_FORCE_SW2_ON_Pos (2UL)                /*!< CRG_PER USBPAD_REG: USBPHY_FORCE_SW2_ON (Bit 2)             */
#define CRG_PER_USBPAD_REG_USBPHY_FORCE_SW2_ON_Msk (0x4UL)              /*!< CRG_PER USBPAD_REG: USBPHY_FORCE_SW2_ON (Bitfield-Mask: 0x01) */


/* ================================================================================ */
/* ================        struct 'CRG_TOP' Position & Mask        ================ */
/* ================================================================================ */


/* ----------------------------  CRG_TOP_CLK_AMBA_REG  ---------------------------- */
#define CRG_TOP_CLK_AMBA_REG_HCLK_DIV_Pos     (0UL)                     /*!< CRG_TOP CLK_AMBA_REG: HCLK_DIV (Bit 0)                      */
#define CRG_TOP_CLK_AMBA_REG_HCLK_DIV_Msk     (0x7UL)                   /*!< CRG_TOP CLK_AMBA_REG: HCLK_DIV (Bitfield-Mask: 0x07)        */
#define CRG_TOP_CLK_AMBA_REG_PCLK_DIV_Pos     (4UL)                     /*!< CRG_TOP CLK_AMBA_REG: PCLK_DIV (Bit 4)                      */
#define CRG_TOP_CLK_AMBA_REG_PCLK_DIV_Msk     (0x30UL)                  /*!< CRG_TOP CLK_AMBA_REG: PCLK_DIV (Bitfield-Mask: 0x03)        */
#define CRG_TOP_CLK_AMBA_REG_AES_CLK_ENABLE_Pos (6UL)                   /*!< CRG_TOP CLK_AMBA_REG: AES_CLK_ENABLE (Bit 6)                */
#define CRG_TOP_CLK_AMBA_REG_AES_CLK_ENABLE_Msk (0x40UL)                /*!< CRG_TOP CLK_AMBA_REG: AES_CLK_ENABLE (Bitfield-Mask: 0x01)  */
#define CRG_TOP_CLK_AMBA_REG_ECC_CLK_ENABLE_Pos (7UL)                   /*!< CRG_TOP CLK_AMBA_REG: ECC_CLK_ENABLE (Bit 7)                */
#define CRG_TOP_CLK_AMBA_REG_ECC_CLK_ENABLE_Msk (0x80UL)                /*!< CRG_TOP CLK_AMBA_REG: ECC_CLK_ENABLE (Bitfield-Mask: 0x01)  */
#define CRG_TOP_CLK_AMBA_REG_TRNG_CLK_ENABLE_Pos (8UL)                  /*!< CRG_TOP CLK_AMBA_REG: TRNG_CLK_ENABLE (Bit 8)               */
#define CRG_TOP_CLK_AMBA_REG_TRNG_CLK_ENABLE_Msk (0x100UL)              /*!< CRG_TOP CLK_AMBA_REG: TRNG_CLK_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_AMBA_REG_OTP_ENABLE_Pos   (9UL)                     /*!< CRG_TOP CLK_AMBA_REG: OTP_ENABLE (Bit 9)                    */
#define CRG_TOP_CLK_AMBA_REG_OTP_ENABLE_Msk   (0x200UL)                 /*!< CRG_TOP CLK_AMBA_REG: OTP_ENABLE (Bitfield-Mask: 0x01)      */
#define CRG_TOP_CLK_AMBA_REG_QSPI_DIV_Pos     (10UL)                    /*!< CRG_TOP CLK_AMBA_REG: QSPI_DIV (Bit 10)                     */
#define CRG_TOP_CLK_AMBA_REG_QSPI_DIV_Msk     (0xc00UL)                 /*!< CRG_TOP CLK_AMBA_REG: QSPI_DIV (Bitfield-Mask: 0x03)        */
#define CRG_TOP_CLK_AMBA_REG_QSPI_ENABLE_Pos  (12UL)                    /*!< CRG_TOP CLK_AMBA_REG: QSPI_ENABLE (Bit 12)                  */
#define CRG_TOP_CLK_AMBA_REG_QSPI_ENABLE_Msk  (0x1000UL)                /*!< CRG_TOP CLK_AMBA_REG: QSPI_ENABLE (Bitfield-Mask: 0x01)     */

/* --------------------------  CRG_TOP_CLK_FREQ_TRIM_REG  ------------------------- */
#define CRG_TOP_CLK_FREQ_TRIM_REG_FINE_ADJ_Pos (0UL)                    /*!< CRG_TOP CLK_FREQ_TRIM_REG: FINE_ADJ (Bit 0)                 */
#define CRG_TOP_CLK_FREQ_TRIM_REG_FINE_ADJ_Msk (0xffUL)                 /*!< CRG_TOP CLK_FREQ_TRIM_REG: FINE_ADJ (Bitfield-Mask: 0xff)   */
#define CRG_TOP_CLK_FREQ_TRIM_REG_COARSE_ADJ_Pos (8UL)                  /*!< CRG_TOP CLK_FREQ_TRIM_REG: COARSE_ADJ (Bit 8)               */
#define CRG_TOP_CLK_FREQ_TRIM_REG_COARSE_ADJ_Msk (0x700UL)              /*!< CRG_TOP CLK_FREQ_TRIM_REG: COARSE_ADJ (Bitfield-Mask: 0x07) */

/* ----------------------------  CRG_TOP_CLK_RADIO_REG  --------------------------- */
#define CRG_TOP_CLK_RADIO_REG_RFCU_DIV_Pos    (0UL)                     /*!< CRG_TOP CLK_RADIO_REG: RFCU_DIV (Bit 0)                     */
#define CRG_TOP_CLK_RADIO_REG_RFCU_DIV_Msk    (0x3UL)                   /*!< CRG_TOP CLK_RADIO_REG: RFCU_DIV (Bitfield-Mask: 0x03)       */
#define CRG_TOP_CLK_RADIO_REG_RFCU_ENABLE_Pos (3UL)                     /*!< CRG_TOP CLK_RADIO_REG: RFCU_ENABLE (Bit 3)                  */
#define CRG_TOP_CLK_RADIO_REG_RFCU_ENABLE_Msk (0x8UL)                   /*!< CRG_TOP CLK_RADIO_REG: RFCU_ENABLE (Bitfield-Mask: 0x01)    */
#define CRG_TOP_CLK_RADIO_REG_BLE_DIV_Pos     (4UL)                     /*!< CRG_TOP CLK_RADIO_REG: BLE_DIV (Bit 4)                      */
#define CRG_TOP_CLK_RADIO_REG_BLE_DIV_Msk     (0x30UL)                  /*!< CRG_TOP CLK_RADIO_REG: BLE_DIV (Bitfield-Mask: 0x03)        */
#define CRG_TOP_CLK_RADIO_REG_BLE_LP_RESET_Pos (6UL)                    /*!< CRG_TOP CLK_RADIO_REG: BLE_LP_RESET (Bit 6)                 */
#define CRG_TOP_CLK_RADIO_REG_BLE_LP_RESET_Msk (0x40UL)                 /*!< CRG_TOP CLK_RADIO_REG: BLE_LP_RESET (Bitfield-Mask: 0x01)   */
#define CRG_TOP_CLK_RADIO_REG_BLE_ENABLE_Pos  (7UL)                     /*!< CRG_TOP CLK_RADIO_REG: BLE_ENABLE (Bit 7)                   */
#define CRG_TOP_CLK_RADIO_REG_BLE_ENABLE_Msk  (0x80UL)                  /*!< CRG_TOP CLK_RADIO_REG: BLE_ENABLE (Bitfield-Mask: 0x01)     */
#define CRG_TOP_CLK_RADIO_REG_FTDF_MAC_DIV_Pos (8UL)                    /*!< CRG_TOP CLK_RADIO_REG: FTDF_MAC_DIV (Bit 8)                 */
#define CRG_TOP_CLK_RADIO_REG_FTDF_MAC_DIV_Msk (0x300UL)                /*!< CRG_TOP CLK_RADIO_REG: FTDF_MAC_DIV (Bitfield-Mask: 0x03)   */
#define CRG_TOP_CLK_RADIO_REG_FTDF_MAC_ENABLE_Pos (11UL)                /*!< CRG_TOP CLK_RADIO_REG: FTDF_MAC_ENABLE (Bit 11)             */
#define CRG_TOP_CLK_RADIO_REG_FTDF_MAC_ENABLE_Msk (0x800UL)             /*!< CRG_TOP CLK_RADIO_REG: FTDF_MAC_ENABLE (Bitfield-Mask: 0x01) */

/* ----------------------------  CRG_TOP_CLK_CTRL_REG  ---------------------------- */
#define CRG_TOP_CLK_CTRL_REG_SYS_CLK_SEL_Pos  (0UL)                     /*!< CRG_TOP CLK_CTRL_REG: SYS_CLK_SEL (Bit 0)                   */
#define CRG_TOP_CLK_CTRL_REG_SYS_CLK_SEL_Msk  (0x3UL)                   /*!< CRG_TOP CLK_CTRL_REG: SYS_CLK_SEL (Bitfield-Mask: 0x03)     */
#define CRG_TOP_CLK_CTRL_REG_XTAL16M_DISABLE_Pos (2UL)                  /*!< CRG_TOP CLK_CTRL_REG: XTAL16M_DISABLE (Bit 2)               */
#define CRG_TOP_CLK_CTRL_REG_XTAL16M_DISABLE_Msk (0x4UL)                /*!< CRG_TOP CLK_CTRL_REG: XTAL16M_DISABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_XTAL32M_MODE_Pos (3UL)                     /*!< CRG_TOP CLK_CTRL_REG: XTAL32M_MODE (Bit 3)                  */
#define CRG_TOP_CLK_CTRL_REG_XTAL32M_MODE_Msk (0x8UL)                   /*!< CRG_TOP CLK_CTRL_REG: XTAL32M_MODE (Bitfield-Mask: 0x01)    */
#define CRG_TOP_CLK_CTRL_REG_USB_CLK_SRC_Pos  (4UL)                     /*!< CRG_TOP CLK_CTRL_REG: USB_CLK_SRC (Bit 4)                   */
#define CRG_TOP_CLK_CTRL_REG_USB_CLK_SRC_Msk  (0x10UL)                  /*!< CRG_TOP CLK_CTRL_REG: USB_CLK_SRC (Bitfield-Mask: 0x01)     */
#define CRG_TOP_CLK_CTRL_REG_PLL_DIV2_Pos     (5UL)                     /*!< CRG_TOP CLK_CTRL_REG: PLL_DIV2 (Bit 5)                      */
#define CRG_TOP_CLK_CTRL_REG_PLL_DIV2_Msk     (0x20UL)                  /*!< CRG_TOP CLK_CTRL_REG: PLL_DIV2 (Bitfield-Mask: 0x01)        */
#define CRG_TOP_CLK_CTRL_REG_DIVN_XTAL32M_MODE_Pos (6UL)                /*!< CRG_TOP CLK_CTRL_REG: DIVN_XTAL32M_MODE (Bit 6)             */
#define CRG_TOP_CLK_CTRL_REG_DIVN_XTAL32M_MODE_Msk (0x40UL)             /*!< CRG_TOP CLK_CTRL_REG: DIVN_XTAL32M_MODE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_DIVN_SYNC_LEVEL_Pos (7UL)                  /*!< CRG_TOP CLK_CTRL_REG: DIVN_SYNC_LEVEL (Bit 7)               */
#define CRG_TOP_CLK_CTRL_REG_DIVN_SYNC_LEVEL_Msk (0x80UL)               /*!< CRG_TOP CLK_CTRL_REG: DIVN_SYNC_LEVEL (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_CLK32K_SOURCE_Pos (8UL)                    /*!< CRG_TOP CLK_CTRL_REG: CLK32K_SOURCE (Bit 8)                 */
#define CRG_TOP_CLK_CTRL_REG_CLK32K_SOURCE_Msk (0x300UL)                /*!< CRG_TOP CLK_CTRL_REG: CLK32K_SOURCE (Bitfield-Mask: 0x03)   */
#define CRG_TOP_CLK_CTRL_REG_DIVN_SHIFT_SEL_Pos (10UL)                  /*!< CRG_TOP CLK_CTRL_REG: DIVN_SHIFT_SEL (Bit 10)               */
#define CRG_TOP_CLK_CTRL_REG_DIVN_SHIFT_SEL_Msk (0x400UL)               /*!< CRG_TOP CLK_CTRL_REG: DIVN_SHIFT_SEL (Bitfield-Mask: 0x01)  */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_32K_Pos (12UL)                  /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_32K (Bit 12)               */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_32K_Msk (0x1000UL)              /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_32K (Bitfield-Mask: 0x01)  */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_RC16M_Pos (13UL)                /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_RC16M (Bit 13)             */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_RC16M_Msk (0x2000UL)            /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_RC16M (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_XTAL16M_Pos (14UL)              /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_XTAL16M (Bit 14)           */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_XTAL16M_Msk (0x4000UL)          /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_XTAL16M (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_PLL96M_Pos (15UL)               /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_PLL96M (Bit 15)            */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_PLL96M_Msk (0x8000UL)           /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_PLL96M (Bitfield-Mask: 0x01) */

