openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* -----------------------------  CRG_TOP_CLK_TMR_REG  ---------------------------- */
#define CRG_TOP_CLK_TMR_REG_TMR0_DIV_Pos      (0UL)                     /*!< CRG_TOP CLK_TMR_REG: TMR0_DIV (Bit 0)                       */
#define CRG_TOP_CLK_TMR_REG_TMR0_DIV_Msk      (0x3UL)                   /*!< CRG_TOP CLK_TMR_REG: TMR0_DIV (Bitfield-Mask: 0x03)         */
#define CRG_TOP_CLK_TMR_REG_TMR0_ENABLE_Pos   (2UL)                     /*!< CRG_TOP CLK_TMR_REG: TMR0_ENABLE (Bit 2)                    */
#define CRG_TOP_CLK_TMR_REG_TMR0_ENABLE_Msk   (0x4UL)                   /*!< CRG_TOP CLK_TMR_REG: TMR0_ENABLE (Bitfield-Mask: 0x01)      */
#define CRG_TOP_CLK_TMR_REG_TMR0_CLK_SEL_Pos  (3UL)                     /*!< CRG_TOP CLK_TMR_REG: TMR0_CLK_SEL (Bit 3)                   */
#define CRG_TOP_CLK_TMR_REG_TMR0_CLK_SEL_Msk  (0x8UL)                   /*!< CRG_TOP CLK_TMR_REG: TMR0_CLK_SEL (Bitfield-Mask: 0x01)     */
#define CRG_TOP_CLK_TMR_REG_TMR1_DIV_Pos      (4UL)                     /*!< CRG_TOP CLK_TMR_REG: TMR1_DIV (Bit 4)                       */
#define CRG_TOP_CLK_TMR_REG_TMR1_DIV_Msk      (0x30UL)                  /*!< CRG_TOP CLK_TMR_REG: TMR1_DIV (Bitfield-Mask: 0x03)         */
#define CRG_TOP_CLK_TMR_REG_TMR1_ENABLE_Pos   (6UL)                     /*!< CRG_TOP CLK_TMR_REG: TMR1_ENABLE (Bit 6)                    */
#define CRG_TOP_CLK_TMR_REG_TMR1_ENABLE_Msk   (0x40UL)                  /*!< CRG_TOP CLK_TMR_REG: TMR1_ENABLE (Bitfield-Mask: 0x01)      */
#define CRG_TOP_CLK_TMR_REG_TMR1_CLK_SEL_Pos  (7UL)                     /*!< CRG_TOP CLK_TMR_REG: TMR1_CLK_SEL (Bit 7)                   */
#define CRG_TOP_CLK_TMR_REG_TMR1_CLK_SEL_Msk  (0x80UL)                  /*!< CRG_TOP CLK_TMR_REG: TMR1_CLK_SEL (Bitfield-Mask: 0x01)     */
#define CRG_TOP_CLK_TMR_REG_TMR2_DIV_Pos      (8UL)                     /*!< CRG_TOP CLK_TMR_REG: TMR2_DIV (Bit 8)                       */
#define CRG_TOP_CLK_TMR_REG_TMR2_DIV_Msk      (0x300UL)                 /*!< CRG_TOP CLK_TMR_REG: TMR2_DIV (Bitfield-Mask: 0x03)         */
#define CRG_TOP_CLK_TMR_REG_TMR2_ENABLE_Pos   (10UL)                    /*!< CRG_TOP CLK_TMR_REG: TMR2_ENABLE (Bit 10)                   */
#define CRG_TOP_CLK_TMR_REG_TMR2_ENABLE_Msk   (0x400UL)                 /*!< CRG_TOP CLK_TMR_REG: TMR2_ENABLE (Bitfield-Mask: 0x01)      */
#define CRG_TOP_CLK_TMR_REG_TMR2_CLK_SEL_Pos  (11UL)                    /*!< CRG_TOP CLK_TMR_REG: TMR2_CLK_SEL (Bit 11)                  */
#define CRG_TOP_CLK_TMR_REG_TMR2_CLK_SEL_Msk  (0x800UL)                 /*!< CRG_TOP CLK_TMR_REG: TMR2_CLK_SEL (Bitfield-Mask: 0x01)     */
#define CRG_TOP_CLK_TMR_REG_BREATH_ENABLE_Pos (12UL)                    /*!< CRG_TOP CLK_TMR_REG: BREATH_ENABLE (Bit 12)                 */
#define CRG_TOP_CLK_TMR_REG_BREATH_ENABLE_Msk (0x1000UL)                /*!< CRG_TOP CLK_TMR_REG: BREATH_ENABLE (Bitfield-Mask: 0x01)    */
#define CRG_TOP_CLK_TMR_REG_WAKEUPCT_ENABLE_Pos (13UL)                  /*!< CRG_TOP CLK_TMR_REG: WAKEUPCT_ENABLE (Bit 13)               */
#define CRG_TOP_CLK_TMR_REG_WAKEUPCT_ENABLE_Msk (0x2000UL)              /*!< CRG_TOP CLK_TMR_REG: WAKEUPCT_ENABLE (Bitfield-Mask: 0x01)  */
#define CRG_TOP_CLK_TMR_REG_P06_TMR1_PWM_MODE_Pos (14UL)                /*!< CRG_TOP CLK_TMR_REG: P06_TMR1_PWM_MODE (Bit 14)             */
#define CRG_TOP_CLK_TMR_REG_P06_TMR1_PWM_MODE_Msk (0x4000UL)            /*!< CRG_TOP CLK_TMR_REG: P06_TMR1_PWM_MODE (Bitfield-Mask: 0x01) */

/* ----------------------------  CRG_TOP_PMU_CTRL_REG  ---------------------------- */
#define CRG_TOP_PMU_CTRL_REG_PERIPH_SLEEP_Pos (0UL)                     /*!< CRG_TOP PMU_CTRL_REG: PERIPH_SLEEP (Bit 0)                  */
#define CRG_TOP_PMU_CTRL_REG_PERIPH_SLEEP_Msk (0x1UL)                   /*!< CRG_TOP PMU_CTRL_REG: PERIPH_SLEEP (Bitfield-Mask: 0x01)    */
#define CRG_TOP_PMU_CTRL_REG_RADIO_SLEEP_Pos  (1UL)                     /*!< CRG_TOP PMU_CTRL_REG: RADIO_SLEEP (Bit 1)                   */
#define CRG_TOP_PMU_CTRL_REG_RADIO_SLEEP_Msk  (0x2UL)                   /*!< CRG_TOP PMU_CTRL_REG: RADIO_SLEEP (Bitfield-Mask: 0x01)     */
#define CRG_TOP_PMU_CTRL_REG_BLE_SLEEP_Pos    (2UL)                     /*!< CRG_TOP PMU_CTRL_REG: BLE_SLEEP (Bit 2)                     */
#define CRG_TOP_PMU_CTRL_REG_BLE_SLEEP_Msk    (0x4UL)                   /*!< CRG_TOP PMU_CTRL_REG: BLE_SLEEP (Bitfield-Mask: 0x01)       */
#define CRG_TOP_PMU_CTRL_REG_FTDF_SLEEP_Pos   (3UL)                     /*!< CRG_TOP PMU_CTRL_REG: FTDF_SLEEP (Bit 3)                    */
#define CRG_TOP_PMU_CTRL_REG_FTDF_SLEEP_Msk   (0x8UL)                   /*!< CRG_TOP PMU_CTRL_REG: FTDF_SLEEP (Bitfield-Mask: 0x01)      */
#define CRG_TOP_PMU_CTRL_REG_MAP_BANDGAP_EN_Pos (4UL)                   /*!< CRG_TOP PMU_CTRL_REG: MAP_BANDGAP_EN (Bit 4)                */
#define CRG_TOP_PMU_CTRL_REG_MAP_BANDGAP_EN_Msk (0x10UL)                /*!< CRG_TOP PMU_CTRL_REG: MAP_BANDGAP_EN (Bitfield-Mask: 0x01)  */
#define CRG_TOP_PMU_CTRL_REG_RESET_ON_WAKEUP_Pos (5UL)                  /*!< CRG_TOP PMU_CTRL_REG: RESET_ON_WAKEUP (Bit 5)               */
#define CRG_TOP_PMU_CTRL_REG_RESET_ON_WAKEUP_Msk (0x20UL)               /*!< CRG_TOP PMU_CTRL_REG: RESET_ON_WAKEUP (Bitfield-Mask: 0x01) */
#define CRG_TOP_PMU_CTRL_REG_OTP_COPY_DIV_Pos (6UL)                     /*!< CRG_TOP PMU_CTRL_REG: OTP_COPY_DIV (Bit 6)                  */
#define CRG_TOP_PMU_CTRL_REG_OTP_COPY_DIV_Msk (0xc0UL)                  /*!< CRG_TOP PMU_CTRL_REG: OTP_COPY_DIV (Bitfield-Mask: 0x03)    */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_RAM_Pos   (8UL)                     /*!< CRG_TOP PMU_CTRL_REG: RETAIN_RAM (Bit 8)                    */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_RAM_Msk   (0x1f00UL)                /*!< CRG_TOP PMU_CTRL_REG: RETAIN_RAM (Bitfield-Mask: 0x1f)      */
#define CRG_TOP_PMU_CTRL_REG_ENABLE_CLKLESS_Pos (13UL)                  /*!< CRG_TOP PMU_CTRL_REG: ENABLE_CLKLESS (Bit 13)               */
#define CRG_TOP_PMU_CTRL_REG_ENABLE_CLKLESS_Msk (0x2000UL)              /*!< CRG_TOP PMU_CTRL_REG: ENABLE_CLKLESS (Bitfield-Mask: 0x01)  */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_CACHE_Pos (14UL)                    /*!< CRG_TOP PMU_CTRL_REG: RETAIN_CACHE (Bit 14)                 */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_CACHE_Msk (0x4000UL)                /*!< CRG_TOP PMU_CTRL_REG: RETAIN_CACHE (Bitfield-Mask: 0x01)    */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_ECCRAM_Pos (15UL)                   /*!< CRG_TOP PMU_CTRL_REG: RETAIN_ECCRAM (Bit 15)                */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_ECCRAM_Msk (0x8000UL)               /*!< CRG_TOP PMU_CTRL_REG: RETAIN_ECCRAM (Bitfield-Mask: 0x01)   */

/* ----------------------------  CRG_TOP_SYS_CTRL_REG  ---------------------------- */
#define CRG_TOP_SYS_CTRL_REG_REMAP_ADR0_Pos   (0UL)                     /*!< CRG_TOP SYS_CTRL_REG: REMAP_ADR0 (Bit 0)                    */
#define CRG_TOP_SYS_CTRL_REG_REMAP_ADR0_Msk   (0x7UL)                   /*!< CRG_TOP SYS_CTRL_REG: REMAP_ADR0 (Bitfield-Mask: 0x07)      */
#define CRG_TOP_SYS_CTRL_REG_REMAP_RAMS_Pos   (3UL)                     /*!< CRG_TOP SYS_CTRL_REG: REMAP_RAMS (Bit 3)                    */
#define CRG_TOP_SYS_CTRL_REG_REMAP_RAMS_Msk   (0x18UL)                  /*!< CRG_TOP SYS_CTRL_REG: REMAP_RAMS (Bitfield-Mask: 0x03)      */
#define CRG_TOP_SYS_CTRL_REG_PAD_LATCH_EN_Pos (5UL)                     /*!< CRG_TOP SYS_CTRL_REG: PAD_LATCH_EN (Bit 5)                  */
#define CRG_TOP_SYS_CTRL_REG_PAD_LATCH_EN_Msk (0x20UL)                  /*!< CRG_TOP SYS_CTRL_REG: PAD_LATCH_EN (Bitfield-Mask: 0x01)    */
#define CRG_TOP_SYS_CTRL_REG_OTPC_RESET_REQ_Pos (6UL)                   /*!< CRG_TOP SYS_CTRL_REG: OTPC_RESET_REQ (Bit 6)                */
#define CRG_TOP_SYS_CTRL_REG_OTPC_RESET_REQ_Msk (0x40UL)                /*!< CRG_TOP SYS_CTRL_REG: OTPC_RESET_REQ (Bitfield-Mask: 0x01)  */
#define CRG_TOP_SYS_CTRL_REG_DEBUGGER_ENABLE_Pos (7UL)                  /*!< CRG_TOP SYS_CTRL_REG: DEBUGGER_ENABLE (Bit 7)               */
#define CRG_TOP_SYS_CTRL_REG_DEBUGGER_ENABLE_Msk (0x80UL)               /*!< CRG_TOP SYS_CTRL_REG: DEBUGGER_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_CTRL_REG_DRA_OFF_Pos      (8UL)                     /*!< CRG_TOP SYS_CTRL_REG: DRA_OFF (Bit 8)                       */
#define CRG_TOP_SYS_CTRL_REG_DRA_OFF_Msk      (0x100UL)                 /*!< CRG_TOP SYS_CTRL_REG: DRA_OFF (Bitfield-Mask: 0x01)         */
#define CRG_TOP_SYS_CTRL_REG_TIMEOUT_DISABLE_Pos (9UL)                  /*!< CRG_TOP SYS_CTRL_REG: TIMEOUT_DISABLE (Bit 9)               */
#define CRG_TOP_SYS_CTRL_REG_TIMEOUT_DISABLE_Msk (0x200UL)              /*!< CRG_TOP SYS_CTRL_REG: TIMEOUT_DISABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_CTRL_REG_CACHERAM_MUX_Pos (10UL)                    /*!< CRG_TOP SYS_CTRL_REG: CACHERAM_MUX (Bit 10)                 */
#define CRG_TOP_SYS_CTRL_REG_CACHERAM_MUX_Msk (0x400UL)                 /*!< CRG_TOP SYS_CTRL_REG: CACHERAM_MUX (Bitfield-Mask: 0x01)    */
#define CRG_TOP_SYS_CTRL_REG_DEV_PHASE_Pos    (11UL)                    /*!< CRG_TOP SYS_CTRL_REG: DEV_PHASE (Bit 11)                    */
#define CRG_TOP_SYS_CTRL_REG_DEV_PHASE_Msk    (0x800UL)                 /*!< CRG_TOP SYS_CTRL_REG: DEV_PHASE (Bitfield-Mask: 0x01)       */
#define CRG_TOP_SYS_CTRL_REG_QSPI_INIT_Pos    (12UL)                    /*!< CRG_TOP SYS_CTRL_REG: QSPI_INIT (Bit 12)                    */
#define CRG_TOP_SYS_CTRL_REG_QSPI_INIT_Msk    (0x1000UL)                /*!< CRG_TOP SYS_CTRL_REG: QSPI_INIT (Bitfield-Mask: 0x01)       */
#define CRG_TOP_SYS_CTRL_REG_OTP_COPY_Pos     (13UL)                    /*!< CRG_TOP SYS_CTRL_REG: OTP_COPY (Bit 13)                     */
#define CRG_TOP_SYS_CTRL_REG_OTP_COPY_Msk     (0x2000UL)                /*!< CRG_TOP SYS_CTRL_REG: OTP_COPY (Bitfield-Mask: 0x01)        */
#define CRG_TOP_SYS_CTRL_REG_REMAP_INTVECT_Pos (14UL)                   /*!< CRG_TOP SYS_CTRL_REG: REMAP_INTVECT (Bit 14)                */
#define CRG_TOP_SYS_CTRL_REG_REMAP_INTVECT_Msk (0x4000UL)               /*!< CRG_TOP SYS_CTRL_REG: REMAP_INTVECT (Bitfield-Mask: 0x01)   */
#define CRG_TOP_SYS_CTRL_REG_SW_RESET_Pos     (15UL)                    /*!< CRG_TOP SYS_CTRL_REG: SW_RESET (Bit 15)                     */
#define CRG_TOP_SYS_CTRL_REG_SW_RESET_Msk     (0x8000UL)                /*!< CRG_TOP SYS_CTRL_REG: SW_RESET (Bitfield-Mask: 0x01)        */

/* ----------------------------  CRG_TOP_SYS_STAT_REG  ---------------------------- */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_DOWN_Pos  (0UL)                     /*!< CRG_TOP SYS_STAT_REG: RAD_IS_DOWN (Bit 0)                   */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_DOWN_Msk  (0x1UL)                   /*!< CRG_TOP SYS_STAT_REG: RAD_IS_DOWN (Bitfield-Mask: 0x01)     */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_UP_Pos    (1UL)                     /*!< CRG_TOP SYS_STAT_REG: RAD_IS_UP (Bit 1)                     */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_UP_Msk    (0x2UL)                   /*!< CRG_TOP SYS_STAT_REG: RAD_IS_UP (Bitfield-Mask: 0x01)       */
#define CRG_TOP_SYS_STAT_REG_PER_IS_DOWN_Pos  (2UL)                     /*!< CRG_TOP SYS_STAT_REG: PER_IS_DOWN (Bit 2)                   */
#define CRG_TOP_SYS_STAT_REG_PER_IS_DOWN_Msk  (0x4UL)                   /*!< CRG_TOP SYS_STAT_REG: PER_IS_DOWN (Bitfield-Mask: 0x01)     */
#define CRG_TOP_SYS_STAT_REG_PER_IS_UP_Pos    (3UL)                     /*!< CRG_TOP SYS_STAT_REG: PER_IS_UP (Bit 3)                     */
#define CRG_TOP_SYS_STAT_REG_PER_IS_UP_Msk    (0x8UL)                   /*!< CRG_TOP SYS_STAT_REG: PER_IS_UP (Bitfield-Mask: 0x01)       */
#define CRG_TOP_SYS_STAT_REG_XTAL16_SW2_Pos   (4UL)                     /*!< CRG_TOP SYS_STAT_REG: XTAL16_SW2 (Bit 4)                    */
#define CRG_TOP_SYS_STAT_REG_XTAL16_SW2_Msk   (0x10UL)                  /*!< CRG_TOP SYS_STAT_REG: XTAL16_SW2 (Bitfield-Mask: 0x01)      */
#define CRG_TOP_SYS_STAT_REG_DBG_IS_ACTIVE_Pos (5UL)                    /*!< CRG_TOP SYS_STAT_REG: DBG_IS_ACTIVE (Bit 5)                 */
#define CRG_TOP_SYS_STAT_REG_DBG_IS_ACTIVE_Msk (0x20UL)                 /*!< CRG_TOP SYS_STAT_REG: DBG_IS_ACTIVE (Bitfield-Mask: 0x01)   */
#define CRG_TOP_SYS_STAT_REG_XTAL16_TRIM_READY_Pos (6UL)                /*!< CRG_TOP SYS_STAT_REG: XTAL16_TRIM_READY (Bit 6)             */
#define CRG_TOP_SYS_STAT_REG_XTAL16_TRIM_READY_Msk (0x40UL)             /*!< CRG_TOP SYS_STAT_REG: XTAL16_TRIM_READY (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_STAT_REG_XTAL16_SETTLE_READY_Pos (7UL)              /*!< CRG_TOP SYS_STAT_REG: XTAL16_SETTLE_READY (Bit 7)           */
#define CRG_TOP_SYS_STAT_REG_XTAL16_SETTLE_READY_Msk (0x80UL)           /*!< CRG_TOP SYS_STAT_REG: XTAL16_SETTLE_READY (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_STAT_REG_BLE_IS_DOWN_Pos  (8UL)                     /*!< CRG_TOP SYS_STAT_REG: BLE_IS_DOWN (Bit 8)                   */
#define CRG_TOP_SYS_STAT_REG_BLE_IS_DOWN_Msk  (0x100UL)                 /*!< CRG_TOP SYS_STAT_REG: BLE_IS_DOWN (Bitfield-Mask: 0x01)     */
#define CRG_TOP_SYS_STAT_REG_BLE_IS_UP_Pos    (9UL)                     /*!< CRG_TOP SYS_STAT_REG: BLE_IS_UP (Bit 9)                     */
#define CRG_TOP_SYS_STAT_REG_BLE_IS_UP_Msk    (0x200UL)                 /*!< CRG_TOP SYS_STAT_REG: BLE_IS_UP (Bitfield-Mask: 0x01)       */
#define CRG_TOP_SYS_STAT_REG_FTDF_IS_DOWN_Pos (10UL)                    /*!< CRG_TOP SYS_STAT_REG: FTDF_IS_DOWN (Bit 10)                 */
#define CRG_TOP_SYS_STAT_REG_FTDF_IS_DOWN_Msk (0x400UL)                 /*!< CRG_TOP SYS_STAT_REG: FTDF_IS_DOWN (Bitfield-Mask: 0x01)    */
#define CRG_TOP_SYS_STAT_REG_FTDF_IS_UP_Pos   (11UL)                    /*!< CRG_TOP SYS_STAT_REG: FTDF_IS_UP (Bit 11)                   */
#define CRG_TOP_SYS_STAT_REG_FTDF_IS_UP_Msk   (0x800UL)                 /*!< CRG_TOP SYS_STAT_REG: FTDF_IS_UP (Bitfield-Mask: 0x01)      */

/* ----------------------------  CRG_TOP_TRIM_CTRL_REG  --------------------------- */
#define CRG_TOP_TRIM_CTRL_REG_XTAL_COUNT_N_Pos (0UL)                    /*!< CRG_TOP TRIM_CTRL_REG: XTAL_COUNT_N (Bit 0)                 */
#define CRG_TOP_TRIM_CTRL_REG_XTAL_COUNT_N_Msk (0x3fUL)                 /*!< CRG_TOP TRIM_CTRL_REG: XTAL_COUNT_N (Bitfield-Mask: 0x3f)   */
#define CRG_TOP_TRIM_CTRL_REG_XTAL_TRIM_SELECT_Pos (6UL)                /*!< CRG_TOP TRIM_CTRL_REG: XTAL_TRIM_SELECT (Bit 6)             */
#define CRG_TOP_TRIM_CTRL_REG_XTAL_TRIM_SELECT_Msk (0xc0UL)             /*!< CRG_TOP TRIM_CTRL_REG: XTAL_TRIM_SELECT (Bitfield-Mask: 0x03) */
#define CRG_TOP_TRIM_CTRL_REG_XTAL_SETTLE_N_Pos (8UL)                   /*!< CRG_TOP TRIM_CTRL_REG: XTAL_SETTLE_N (Bit 8)                */
#define CRG_TOP_TRIM_CTRL_REG_XTAL_SETTLE_N_Msk (0x3f00UL)              /*!< CRG_TOP TRIM_CTRL_REG: XTAL_SETTLE_N (Bitfield-Mask: 0x3f)  */

/* -----------------------------  CRG_TOP_CLK_32K_REG  ---------------------------- */
#define CRG_TOP_CLK_32K_REG_XTAL32K_ENABLE_Pos (0UL)                    /*!< CRG_TOP CLK_32K_REG: XTAL32K_ENABLE (Bit 0)                 */
#define CRG_TOP_CLK_32K_REG_XTAL32K_ENABLE_Msk (0x1UL)                  /*!< CRG_TOP CLK_32K_REG: XTAL32K_ENABLE (Bitfield-Mask: 0x01)   */
#define CRG_TOP_CLK_32K_REG_XTAL32K_RBIAS_Pos (1UL)                     /*!< CRG_TOP CLK_32K_REG: XTAL32K_RBIAS (Bit 1)                  */
#define CRG_TOP_CLK_32K_REG_XTAL32K_RBIAS_Msk (0x6UL)                   /*!< CRG_TOP CLK_32K_REG: XTAL32K_RBIAS (Bitfield-Mask: 0x03)    */
#define CRG_TOP_CLK_32K_REG_XTAL32K_CUR_Pos   (3UL)                     /*!< CRG_TOP CLK_32K_REG: XTAL32K_CUR (Bit 3)                    */
#define CRG_TOP_CLK_32K_REG_XTAL32K_CUR_Msk   (0x78UL)                  /*!< CRG_TOP CLK_32K_REG: XTAL32K_CUR (Bitfield-Mask: 0x0f)      */
#define CRG_TOP_CLK_32K_REG_RC32K_ENABLE_Pos  (7UL)                     /*!< CRG_TOP CLK_32K_REG: RC32K_ENABLE (Bit 7)                   */
#define CRG_TOP_CLK_32K_REG_RC32K_ENABLE_Msk  (0x80UL)                  /*!< CRG_TOP CLK_32K_REG: RC32K_ENABLE (Bitfield-Mask: 0x01)     */
#define CRG_TOP_CLK_32K_REG_RC32K_TRIM_Pos    (8UL)                     /*!< CRG_TOP CLK_32K_REG: RC32K_TRIM (Bit 8)                     */
#define CRG_TOP_CLK_32K_REG_RC32K_TRIM_Msk    (0xf00UL)                 /*!< CRG_TOP CLK_32K_REG: RC32K_TRIM (Bitfield-Mask: 0x0f)       */
#define CRG_TOP_CLK_32K_REG_XTAL32K_DISABLE_AMPREG_Pos (12UL)           /*!< CRG_TOP CLK_32K_REG: XTAL32K_DISABLE_AMPREG (Bit 12)        */
#define CRG_TOP_CLK_32K_REG_XTAL32K_DISABLE_AMPREG_Msk (0x1000UL)       /*!< CRG_TOP CLK_32K_REG: XTAL32K_DISABLE_AMPREG (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_32K_REG_XTAL32K_XTAL1_BIAS_DISABLE_Pos (13UL)       /*!< CRG_TOP CLK_32K_REG: XTAL32K_XTAL1_BIAS_DISABLE (Bit 13)    */
#define CRG_TOP_CLK_32K_REG_XTAL32K_XTAL1_BIAS_DISABLE_Msk (0x2000UL)   /*!< CRG_TOP CLK_32K_REG: XTAL32K_XTAL1_BIAS_DISABLE (Bitfield-Mask: 0x01) */

/* -----------------------------  CRG_TOP_CLK_16M_REG  ---------------------------- */
#define CRG_TOP_CLK_16M_REG_RC16M_ENABLE_Pos  (0UL)                     /*!< CRG_TOP CLK_16M_REG: RC16M_ENABLE (Bit 0)                   */
#define CRG_TOP_CLK_16M_REG_RC16M_ENABLE_Msk  (0x1UL)                   /*!< CRG_TOP CLK_16M_REG: RC16M_ENABLE (Bitfield-Mask: 0x01)     */
#define CRG_TOP_CLK_16M_REG_RC16M_TRIM_Pos    (1UL)                     /*!< CRG_TOP CLK_16M_REG: RC16M_TRIM (Bit 1)                     */
#define CRG_TOP_CLK_16M_REG_RC16M_TRIM_Msk    (0x1eUL)                  /*!< CRG_TOP CLK_16M_REG: RC16M_TRIM (Bitfield-Mask: 0x0f)       */
#define CRG_TOP_CLK_16M_REG_XTAL16_CUR_SET_Pos (5UL)                    /*!< CRG_TOP CLK_16M_REG: XTAL16_CUR_SET (Bit 5)                 */
#define CRG_TOP_CLK_16M_REG_XTAL16_CUR_SET_Msk (0xe0UL)                 /*!< CRG_TOP CLK_16M_REG: XTAL16_CUR_SET (Bitfield-Mask: 0x07)   */
#define CRG_TOP_CLK_16M_REG_XTAL16_MAX_CURRENT_Pos (8UL)                /*!< CRG_TOP CLK_16M_REG: XTAL16_MAX_CURRENT (Bit 8)             */
#define CRG_TOP_CLK_16M_REG_XTAL16_MAX_CURRENT_Msk (0x100UL)            /*!< CRG_TOP CLK_16M_REG: XTAL16_MAX_CURRENT (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_16M_REG_XTAL16_EXT_CLK_ENABLE_Pos (9UL)             /*!< CRG_TOP CLK_16M_REG: XTAL16_EXT_CLK_ENABLE (Bit 9)          */
#define CRG_TOP_CLK_16M_REG_XTAL16_EXT_CLK_ENABLE_Msk (0x200UL)         /*!< CRG_TOP CLK_16M_REG: XTAL16_EXT_CLK_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_16M_REG_XTAL16_AMP_TRIM_Pos (10UL)                  /*!< CRG_TOP CLK_16M_REG: XTAL16_AMP_TRIM (Bit 10)               */
#define CRG_TOP_CLK_16M_REG_XTAL16_AMP_TRIM_Msk (0x1c00UL)              /*!< CRG_TOP CLK_16M_REG: XTAL16_AMP_TRIM (Bitfield-Mask: 0x07)  */
#define CRG_TOP_CLK_16M_REG_XTAL16_SPIKE_FLT_BYPASS_Pos (13UL)          /*!< CRG_TOP CLK_16M_REG: XTAL16_SPIKE_FLT_BYPASS (Bit 13)       */
#define CRG_TOP_CLK_16M_REG_XTAL16_SPIKE_FLT_BYPASS_Msk (0x2000UL)      /*!< CRG_TOP CLK_16M_REG: XTAL16_SPIKE_FLT_BYPASS (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_16M_REG_XTAL16_HPASS_FLT_EN_Pos (14UL)              /*!< CRG_TOP CLK_16M_REG: XTAL16_HPASS_FLT_EN (Bit 14)           */
#define CRG_TOP_CLK_16M_REG_XTAL16_HPASS_FLT_EN_Msk (0x4000UL)          /*!< CRG_TOP CLK_16M_REG: XTAL16_HPASS_FLT_EN (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_16M_REG_RC16M_STARTUP_DISABLE_Pos (15UL)            /*!< CRG_TOP CLK_16M_REG: RC16M_STARTUP_DISABLE (Bit 15)         */
#define CRG_TOP_CLK_16M_REG_RC16M_STARTUP_DISABLE_Msk (0x8000UL)        /*!< CRG_TOP CLK_16M_REG: RC16M_STARTUP_DISABLE (Bitfield-Mask: 0x01) */

