openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* -------------------------  CRG_TOP_DISCHARGE_RAIL_REG  ------------------------- */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V14_Pos (0UL)                  /*!< CRG_TOP DISCHARGE_RAIL_REG: RESET_V14 (Bit 0)               */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V14_Msk (0x1UL)                /*!< CRG_TOP DISCHARGE_RAIL_REG: RESET_V14 (Bitfield-Mask: 0x01) */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V18_Pos (1UL)                  /*!< CRG_TOP DISCHARGE_RAIL_REG: RESET_V18 (Bit 1)               */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V18_Msk (0x2UL)                /*!< CRG_TOP DISCHARGE_RAIL_REG: RESET_V18 (Bitfield-Mask: 0x01) */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V18P_Pos (2UL)                 /*!< CRG_TOP DISCHARGE_RAIL_REG: RESET_V18P (Bit 2)              */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V18P_Msk (0x4UL)               /*!< CRG_TOP DISCHARGE_RAIL_REG: RESET_V18P (Bitfield-Mask: 0x01) */


/* ================================================================================ */
/* ================          struct 'DCDC' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------  DCDC_DCDC_CTRL_0_REG  ---------------------------- */
#define DCDC_DCDC_CTRL_0_REG_DCDC_MODE_Pos    (0UL)                     /*!< DCDC DCDC_CTRL_0_REG: DCDC_MODE (Bit 0)                     */
#define DCDC_DCDC_CTRL_0_REG_DCDC_MODE_Msk    (0x3UL)                   /*!< DCDC DCDC_CTRL_0_REG: DCDC_MODE (Bitfield-Mask: 0x03)       */
#define DCDC_DCDC_CTRL_0_REG_DCDC_FW_ENABLE_Pos (2UL)                   /*!< DCDC DCDC_CTRL_0_REG: DCDC_FW_ENABLE (Bit 2)                */
#define DCDC_DCDC_CTRL_0_REG_DCDC_FW_ENABLE_Msk (0x4UL)                 /*!< DCDC DCDC_CTRL_0_REG: DCDC_FW_ENABLE (Bitfield-Mask: 0x01)  */
#define DCDC_DCDC_CTRL_0_REG_DCDC_PRIORITY_Pos (3UL)                    /*!< DCDC DCDC_CTRL_0_REG: DCDC_PRIORITY (Bit 3)                 */
#define DCDC_DCDC_CTRL_0_REG_DCDC_PRIORITY_Msk (0x7f8UL)                /*!< DCDC DCDC_CTRL_0_REG: DCDC_PRIORITY (Bitfield-Mask: 0xff)   */
#define DCDC_DCDC_CTRL_0_REG_DCDC_IDLE_CLK_DIV_Pos (11UL)               /*!< DCDC DCDC_CTRL_0_REG: DCDC_IDLE_CLK_DIV (Bit 11)            */
#define DCDC_DCDC_CTRL_0_REG_DCDC_IDLE_CLK_DIV_Msk (0x1800UL)           /*!< DCDC DCDC_CTRL_0_REG: DCDC_IDLE_CLK_DIV (Bitfield-Mask: 0x03) */
#define DCDC_DCDC_CTRL_0_REG_DCDC_BROWNOUT_LV_MODE_Pos (13UL)           /*!< DCDC DCDC_CTRL_0_REG: DCDC_BROWNOUT_LV_MODE (Bit 13)        */
#define DCDC_DCDC_CTRL_0_REG_DCDC_BROWNOUT_LV_MODE_Msk (0x2000UL)       /*!< DCDC DCDC_CTRL_0_REG: DCDC_BROWNOUT_LV_MODE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_CTRL_0_REG_DCDC_FAST_STARTUP_Pos (14UL)               /*!< DCDC DCDC_CTRL_0_REG: DCDC_FAST_STARTUP (Bit 14)            */
#define DCDC_DCDC_CTRL_0_REG_DCDC_FAST_STARTUP_Msk (0x4000UL)           /*!< DCDC DCDC_CTRL_0_REG: DCDC_FAST_STARTUP (Bitfield-Mask: 0x01) */

/* ----------------------------  DCDC_DCDC_CTRL_1_REG  ---------------------------- */
#define DCDC_DCDC_CTRL_1_REG_DCDC_TIMEOUT_Pos (0UL)                     /*!< DCDC DCDC_CTRL_1_REG: DCDC_TIMEOUT (Bit 0)                  */
#define DCDC_DCDC_CTRL_1_REG_DCDC_TIMEOUT_Msk (0x1fUL)                  /*!< DCDC DCDC_CTRL_1_REG: DCDC_TIMEOUT (Bitfield-Mask: 0x1f)    */
#define DCDC_DCDC_CTRL_1_REG_DCDC_GLOBAL_MAX_IDLE_TIME_Pos (5UL)        /*!< DCDC DCDC_CTRL_1_REG: DCDC_GLOBAL_MAX_IDLE_TIME (Bit 5)     */
#define DCDC_DCDC_CTRL_1_REG_DCDC_GLOBAL_MAX_IDLE_TIME_Msk (0x7e0UL)    /*!< DCDC DCDC_CTRL_1_REG: DCDC_GLOBAL_MAX_IDLE_TIME (Bitfield-Mask: 0x3f) */
#define DCDC_DCDC_CTRL_1_REG_DCDC_STARTUP_DELAY_Pos (11UL)              /*!< DCDC DCDC_CTRL_1_REG: DCDC_STARTUP_DELAY (Bit 11)           */
#define DCDC_DCDC_CTRL_1_REG_DCDC_STARTUP_DELAY_Msk (0xf800UL)          /*!< DCDC DCDC_CTRL_1_REG: DCDC_STARTUP_DELAY (Bitfield-Mask: 0x1f) */

/* ----------------------------  DCDC_DCDC_CTRL_2_REG  ---------------------------- */
#define DCDC_DCDC_CTRL_2_REG_DCDC_HSGND_TRIM_Pos (0UL)                  /*!< DCDC DCDC_CTRL_2_REG: DCDC_HSGND_TRIM (Bit 0)               */
#define DCDC_DCDC_CTRL_2_REG_DCDC_HSGND_TRIM_Msk (0x7UL)                /*!< DCDC DCDC_CTRL_2_REG: DCDC_HSGND_TRIM (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_CTRL_2_REG_DCDC_LSSUP_TRIM_Pos (3UL)                  /*!< DCDC DCDC_CTRL_2_REG: DCDC_LSSUP_TRIM (Bit 3)               */
#define DCDC_DCDC_CTRL_2_REG_DCDC_LSSUP_TRIM_Msk (0x38UL)               /*!< DCDC DCDC_CTRL_2_REG: DCDC_LSSUP_TRIM (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_CTRL_2_REG_DCDC_TUNE_Pos    (6UL)                     /*!< DCDC DCDC_CTRL_2_REG: DCDC_TUNE (Bit 6)                     */
#define DCDC_DCDC_CTRL_2_REG_DCDC_TUNE_Msk    (0xc0UL)                  /*!< DCDC DCDC_CTRL_2_REG: DCDC_TUNE (Bitfield-Mask: 0x03)       */
#define DCDC_DCDC_CTRL_2_REG_DCDC_TIMEOUT_IRQ_RES_Pos (8UL)             /*!< DCDC DCDC_CTRL_2_REG: DCDC_TIMEOUT_IRQ_RES (Bit 8)          */
#define DCDC_DCDC_CTRL_2_REG_DCDC_TIMEOUT_IRQ_RES_Msk (0xf00UL)         /*!< DCDC DCDC_CTRL_2_REG: DCDC_TIMEOUT_IRQ_RES (Bitfield-Mask: 0x0f) */
#define DCDC_DCDC_CTRL_2_REG_DCDC_TIMEOUT_IRQ_TRIG_Pos (12UL)           /*!< DCDC DCDC_CTRL_2_REG: DCDC_TIMEOUT_IRQ_TRIG (Bit 12)        */
#define DCDC_DCDC_CTRL_2_REG_DCDC_TIMEOUT_IRQ_TRIG_Msk (0xf000UL)       /*!< DCDC DCDC_CTRL_2_REG: DCDC_TIMEOUT_IRQ_TRIG (Bitfield-Mask: 0x0f) */

/* -----------------------------  DCDC_DCDC_V14_0_REG  ---------------------------- */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_CUR_LIM_MIN_Pos (0UL)              /*!< DCDC DCDC_V14_0_REG: DCDC_V14_CUR_LIM_MIN (Bit 0)           */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_CUR_LIM_MIN_Msk (0x1fUL)           /*!< DCDC DCDC_V14_0_REG: DCDC_V14_CUR_LIM_MIN (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_CUR_LIM_MAX_HV_Pos (5UL)           /*!< DCDC DCDC_V14_0_REG: DCDC_V14_CUR_LIM_MAX_HV (Bit 5)        */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_CUR_LIM_MAX_HV_Msk (0x3e0UL)       /*!< DCDC DCDC_V14_0_REG: DCDC_V14_CUR_LIM_MAX_HV (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_VOLTAGE_Pos (10UL)                 /*!< DCDC DCDC_V14_0_REG: DCDC_V14_VOLTAGE (Bit 10)              */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_VOLTAGE_Msk (0x7c00UL)             /*!< DCDC DCDC_V14_0_REG: DCDC_V14_VOLTAGE (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_FAST_RAMPING_Pos (15UL)            /*!< DCDC DCDC_V14_0_REG: DCDC_V14_FAST_RAMPING (Bit 15)         */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_FAST_RAMPING_Msk (0x8000UL)        /*!< DCDC DCDC_V14_0_REG: DCDC_V14_FAST_RAMPING (Bitfield-Mask: 0x01) */

/* -----------------------------  DCDC_DCDC_V14_1_REG  ---------------------------- */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_IDLE_MIN_Pos (0UL)                 /*!< DCDC DCDC_V14_1_REG: DCDC_V14_IDLE_MIN (Bit 0)              */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_IDLE_MIN_Msk (0x1fUL)              /*!< DCDC DCDC_V14_1_REG: DCDC_V14_IDLE_MIN (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_IDLE_HYST_Pos (5UL)                /*!< DCDC DCDC_V14_1_REG: DCDC_V14_IDLE_HYST (Bit 5)             */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_IDLE_HYST_Msk (0x3e0UL)            /*!< DCDC DCDC_V14_1_REG: DCDC_V14_IDLE_HYST (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_CUR_LIM_MAX_LV_Pos (10UL)          /*!< DCDC DCDC_V14_1_REG: DCDC_V14_CUR_LIM_MAX_LV (Bit 10)       */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_CUR_LIM_MAX_LV_Msk (0x3c00UL)      /*!< DCDC DCDC_V14_1_REG: DCDC_V14_CUR_LIM_MAX_LV (Bitfield-Mask: 0x0f) */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_ENABLE_LV_Pos (14UL)               /*!< DCDC DCDC_V14_1_REG: DCDC_V14_ENABLE_LV (Bit 14)            */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_ENABLE_LV_Msk (0x4000UL)           /*!< DCDC DCDC_V14_1_REG: DCDC_V14_ENABLE_LV (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_ENABLE_HV_Pos (15UL)               /*!< DCDC DCDC_V14_1_REG: DCDC_V14_ENABLE_HV (Bit 15)            */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_ENABLE_HV_Msk (0x8000UL)           /*!< DCDC DCDC_V14_1_REG: DCDC_V14_ENABLE_HV (Bitfield-Mask: 0x01) */

