openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* --------------------------  DEM_RF_FTDF_COBI_HIGH_REG  ------------------------- */
#define DEM_RF_FTDF_COBI_HIGH_REG_COBI_Pos    (0UL)                     /*!< DEM RF_FTDF_COBI_HIGH_REG: COBI (Bit 0)                     */
#define DEM_RF_FTDF_COBI_HIGH_REG_COBI_Msk    (0xffffUL)                /*!< DEM RF_FTDF_COBI_HIGH_REG: COBI (Bitfield-Mask: 0xffff)     */

/* ---------------------------  DEM_RF_DEM_TESTMODE_REG  -------------------------- */
#define DEM_RF_DEM_TESTMODE_REG_DEM_TESTMODE_Pos (0UL)                  /*!< DEM RF_DEM_TESTMODE_REG: DEM_TESTMODE (Bit 0)               */
#define DEM_RF_DEM_TESTMODE_REG_DEM_TESTMODE_Msk (0x3ffUL)              /*!< DEM RF_DEM_TESTMODE_REG: DEM_TESTMODE (Bitfield-Mask: 0x3ff) */

/* --------------------------  DEM_RF_DEM_IQCORRECT_REG  -------------------------- */
#define DEM_RF_DEM_IQCORRECT_REG_IQCORR_BETA_Pos (0UL)                  /*!< DEM RF_DEM_IQCORRECT_REG: IQCORR_BETA (Bit 0)               */
#define DEM_RF_DEM_IQCORRECT_REG_IQCORR_BETA_Msk (0xffUL)               /*!< DEM RF_DEM_IQCORRECT_REG: IQCORR_BETA (Bitfield-Mask: 0xff) */
#define DEM_RF_DEM_IQCORRECT_REG_IQCORR_ALPHA_Pos (8UL)                 /*!< DEM RF_DEM_IQCORRECT_REG: IQCORR_ALPHA (Bit 8)              */
#define DEM_RF_DEM_IQCORRECT_REG_IQCORR_ALPHA_Msk (0xff00UL)            /*!< DEM RF_DEM_IQCORRECT_REG: IQCORR_ALPHA (Bitfield-Mask: 0xff) */

/* ---------------------------  DEM_RF_PAD_CNT_CTRL_REG  -------------------------- */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_POS_LIMIT_Pos (0UL)                 /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_POS_LIMIT (Bit 0)              */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_POS_LIMIT_Msk (0x7fUL)              /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_POS_LIMIT (Bitfield-Mask: 0x7f) */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_NEG_LIMIT_Pos (7UL)                 /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_NEG_LIMIT (Bit 7)              */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_NEG_LIMIT_Msk (0x3f80UL)            /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_NEG_LIMIT (Bitfield-Mask: 0x7f) */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_CLEAR_COUNT_Pos (14UL)              /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_CLEAR_COUNT (Bit 14)           */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_CLEAR_COUNT_Msk (0x4000UL)          /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_CLEAR_COUNT (Bitfield-Mask: 0x01) */

/* --------------------------  DEM_RF_PAD_CNT_RESULT_REG  ------------------------- */
#define DEM_RF_PAD_CNT_RESULT_REG_PAD_POS_CNT_RD_Pos (0UL)              /*!< DEM RF_PAD_CNT_RESULT_REG: PAD_POS_CNT_RD (Bit 0)           */
#define DEM_RF_PAD_CNT_RESULT_REG_PAD_POS_CNT_RD_Msk (0xffUL)           /*!< DEM RF_PAD_CNT_RESULT_REG: PAD_POS_CNT_RD (Bitfield-Mask: 0xff) */
#define DEM_RF_PAD_CNT_RESULT_REG_PAD_NEG_CNT_RD_Pos (8UL)              /*!< DEM RF_PAD_CNT_RESULT_REG: PAD_NEG_CNT_RD (Bit 8)           */
#define DEM_RF_PAD_CNT_RESULT_REG_PAD_NEG_CNT_RD_Msk (0xff00UL)         /*!< DEM RF_PAD_CNT_RESULT_REG: PAD_NEG_CNT_RD (Bitfield-Mask: 0xff) */

/* --------------------------  DEM_RF_FSSS_I_RESULT_REG  -------------------------- */
#define DEM_RF_FSSS_I_RESULT_REG_FSSS_I_RD_Pos (0UL)                    /*!< DEM RF_FSSS_I_RESULT_REG: FSSS_I_RD (Bit 0)                 */
#define DEM_RF_FSSS_I_RESULT_REG_FSSS_I_RD_Msk (0xffffUL)               /*!< DEM RF_FSSS_I_RESULT_REG: FSSS_I_RD (Bitfield-Mask: 0xffff) */

/* --------------------------  DEM_RF_FSSS_Q_RESULT_REG  -------------------------- */
#define DEM_RF_FSSS_Q_RESULT_REG_FSSS_Q_RD_Pos (0UL)                    /*!< DEM RF_FSSS_Q_RESULT_REG: FSSS_Q_RD (Bit 0)                 */
#define DEM_RF_FSSS_Q_RESULT_REG_FSSS_Q_RD_Msk (0xffffUL)               /*!< DEM RF_FSSS_Q_RESULT_REG: FSSS_Q_RD (Bitfield-Mask: 0xffff) */

/* -------------------------  DEM_RF_FSSS_MAG_RESULT_REG  ------------------------- */
#define DEM_RF_FSSS_MAG_RESULT_REG_FSSS_MAG_RD_Pos (0UL)                /*!< DEM RF_FSSS_MAG_RESULT_REG: FSSS_MAG_RD (Bit 0)             */
#define DEM_RF_FSSS_MAG_RESULT_REG_FSSS_MAG_RD_Msk (0xffffUL)           /*!< DEM RF_FSSS_MAG_RESULT_REG: FSSS_MAG_RD (Bitfield-Mask: 0xffff) */

/* ----------------------------  DEM_RF_CCA_RSSITH_REG  --------------------------- */
#define DEM_RF_CCA_RSSITH_REG_CCA_RSSITH_Pos  (0UL)                     /*!< DEM RF_CCA_RSSITH_REG: CCA_RSSITH (Bit 0)                   */
#define DEM_RF_CCA_RSSITH_REG_CCA_RSSITH_Msk  (0x1fffUL)                /*!< DEM RF_CCA_RSSITH_REG: CCA_RSSITH (Bitfield-Mask: 0x1fff)   */
#define DEM_RF_CCA_RSSITH_REG_SIGDET_TIMEOUT_LEN_Pos (13UL)             /*!< DEM RF_CCA_RSSITH_REG: SIGDET_TIMEOUT_LEN (Bit 13)          */
#define DEM_RF_CCA_RSSITH_REG_SIGDET_TIMEOUT_LEN_Msk (0xe000UL)         /*!< DEM RF_CCA_RSSITH_REG: SIGDET_TIMEOUT_LEN (Bitfield-Mask: 0x07) */

/* -------------------------  DEM_RF_FTDF_SIGDET_CTRL_REG  ------------------------ */
#define DEM_RF_FTDF_SIGDET_CTRL_REG_SIGDET_MODE_Pos (0UL)               /*!< DEM RF_FTDF_SIGDET_CTRL_REG: SIGDET_MODE (Bit 0)            */
#define DEM_RF_FTDF_SIGDET_CTRL_REG_SIGDET_MODE_Msk (0x3UL)             /*!< DEM RF_FTDF_SIGDET_CTRL_REG: SIGDET_MODE (Bitfield-Mask: 0x03) */
#define DEM_RF_FTDF_SIGDET_CTRL_REG_SIGDET_THRESHOLD_Pos (2UL)          /*!< DEM RF_FTDF_SIGDET_CTRL_REG: SIGDET_THRESHOLD (Bit 2)       */
#define DEM_RF_FTDF_SIGDET_CTRL_REG_SIGDET_THRESHOLD_Msk (0xfcUL)       /*!< DEM RF_FTDF_SIGDET_CTRL_REG: SIGDET_THRESHOLD (Bitfield-Mask: 0x3f) */
#define DEM_RF_FTDF_SIGDET_CTRL_REG_SIGDET_DIFF_Pos (8UL)               /*!< DEM RF_FTDF_SIGDET_CTRL_REG: SIGDET_DIFF (Bit 8)            */
#define DEM_RF_FTDF_SIGDET_CTRL_REG_SIGDET_DIFF_Msk (0x100UL)           /*!< DEM RF_FTDF_SIGDET_CTRL_REG: SIGDET_DIFF (Bitfield-Mask: 0x01) */
#define DEM_RF_FTDF_SIGDET_CTRL_REG_SIGDET_SFACTOR2_Pos (9UL)           /*!< DEM RF_FTDF_SIGDET_CTRL_REG: SIGDET_SFACTOR2 (Bit 9)        */
#define DEM_RF_FTDF_SIGDET_CTRL_REG_SIGDET_SFACTOR2_Msk (0x600UL)       /*!< DEM RF_FTDF_SIGDET_CTRL_REG: SIGDET_SFACTOR2 (Bitfield-Mask: 0x03) */
#define DEM_RF_FTDF_SIGDET_CTRL_REG_SIGDET_SFACTOR1_Pos (11UL)          /*!< DEM RF_FTDF_SIGDET_CTRL_REG: SIGDET_SFACTOR1 (Bit 11)       */
#define DEM_RF_FTDF_SIGDET_CTRL_REG_SIGDET_SFACTOR1_Msk (0x1800UL)      /*!< DEM RF_FTDF_SIGDET_CTRL_REG: SIGDET_SFACTOR1 (Bitfield-Mask: 0x03) */
#define DEM_RF_FTDF_SIGDET_CTRL_REG_SIGDET_DELAY_Pos (13UL)             /*!< DEM RF_FTDF_SIGDET_CTRL_REG: SIGDET_DELAY (Bit 13)          */
#define DEM_RF_FTDF_SIGDET_CTRL_REG_SIGDET_DELAY_Msk (0x6000UL)         /*!< DEM RF_FTDF_SIGDET_CTRL_REG: SIGDET_DELAY (Bitfield-Mask: 0x03) */


/* ================================================================================ */
/* ================          struct 'DMA' Position & Mask          ================ */
/* ================================================================================ */


/* ----------------------------  DMA_DMA0_A_STARTL_REG  --------------------------- */
#define DMA_DMA0_A_STARTL_REG_DMA0_A_STARTL_Pos (0UL)                   /*!< DMA DMA0_A_STARTL_REG: DMA0_A_STARTL (Bit 0)                */
#define DMA_DMA0_A_STARTL_REG_DMA0_A_STARTL_Msk (0xffffUL)              /*!< DMA DMA0_A_STARTL_REG: DMA0_A_STARTL (Bitfield-Mask: 0xffff) */

/* ----------------------------  DMA_DMA0_A_STARTH_REG  --------------------------- */
#define DMA_DMA0_A_STARTH_REG_DMA0_A_STARTH_Pos (0UL)                   /*!< DMA DMA0_A_STARTH_REG: DMA0_A_STARTH (Bit 0)                */
#define DMA_DMA0_A_STARTH_REG_DMA0_A_STARTH_Msk (0xffffUL)              /*!< DMA DMA0_A_STARTH_REG: DMA0_A_STARTH (Bitfield-Mask: 0xffff) */

/* ----------------------------  DMA_DMA0_B_STARTL_REG  --------------------------- */
#define DMA_DMA0_B_STARTL_REG_DMA0_B_STARTL_Pos (0UL)                   /*!< DMA DMA0_B_STARTL_REG: DMA0_B_STARTL (Bit 0)                */
#define DMA_DMA0_B_STARTL_REG_DMA0_B_STARTL_Msk (0xffffUL)              /*!< DMA DMA0_B_STARTL_REG: DMA0_B_STARTL (Bitfield-Mask: 0xffff) */

