openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* ----------------------------  FTDF_FTDF_RX_MASK_REG  --------------------------- */
#define FTDF_FTDF_RX_MASK_REG_RXSOF_M_Pos     (0UL)                     /*!< FTDF FTDF_RX_MASK_REG: RXSOF_M (Bit 0)                      */
#define FTDF_FTDF_RX_MASK_REG_RXSOF_M_Msk     (0x1UL)                   /*!< FTDF FTDF_RX_MASK_REG: RXSOF_M (Bitfield-Mask: 0x01)        */
#define FTDF_FTDF_RX_MASK_REG_RX_OVERFLOW_M_Pos (1UL)                   /*!< FTDF FTDF_RX_MASK_REG: RX_OVERFLOW_M (Bit 1)                */
#define FTDF_FTDF_RX_MASK_REG_RX_OVERFLOW_M_Msk (0x2UL)                 /*!< FTDF FTDF_RX_MASK_REG: RX_OVERFLOW_M (Bitfield-Mask: 0x01)  */
#define FTDF_FTDF_RX_MASK_REG_RX_BUF_AVAIL_M_Pos (2UL)                  /*!< FTDF FTDF_RX_MASK_REG: RX_BUF_AVAIL_M (Bit 2)               */
#define FTDF_FTDF_RX_MASK_REG_RX_BUF_AVAIL_M_Msk (0x4UL)                /*!< FTDF FTDF_RX_MASK_REG: RX_BUF_AVAIL_M (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_MASK_REG_RXBYTE_M_Pos    (3UL)                     /*!< FTDF FTDF_RX_MASK_REG: RXBYTE_M (Bit 3)                     */
#define FTDF_FTDF_RX_MASK_REG_RXBYTE_M_Msk    (0x8UL)                   /*!< FTDF FTDF_RX_MASK_REG: RXBYTE_M (Bitfield-Mask: 0x01)       */

/* ---------------------------  FTDF_FTDF_RX_STATUS_REG  -------------------------- */
#define FTDF_FTDF_RX_STATUS_REG_RX_BUFF_IS_FULL_Pos (0UL)               /*!< FTDF FTDF_RX_STATUS_REG: RX_BUFF_IS_FULL (Bit 0)            */
#define FTDF_FTDF_RX_STATUS_REG_RX_BUFF_IS_FULL_Msk (0x1UL)             /*!< FTDF FTDF_RX_STATUS_REG: RX_BUFF_IS_FULL (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_STATUS_REG_RX_WRITE_BUF_PTR_Pos (1UL)              /*!< FTDF FTDF_RX_STATUS_REG: RX_WRITE_BUF_PTR (Bit 1)           */
#define FTDF_FTDF_RX_STATUS_REG_RX_WRITE_BUF_PTR_Msk (0x1eUL)           /*!< FTDF FTDF_RX_STATUS_REG: RX_WRITE_BUF_PTR (Bitfield-Mask: 0x0f) */

/* ---------------------  FTDF_FTDF_SYMBOLTIMESNAPSHOTVAL_REG  -------------------- */
#define FTDF_FTDF_SYMBOLTIMESNAPSHOTVAL_REG_SYMBOLTIMESNAPSHOTVAL_Pos (0UL) /*!< FTDF FTDF_SYMBOLTIMESNAPSHOTVAL_REG: SYMBOLTIMESNAPSHOTVAL (Bit 0) */
#define FTDF_FTDF_SYMBOLTIMESNAPSHOTVAL_REG_SYMBOLTIMESNAPSHOTVAL_Msk (0xffffffffUL) /*!< FTDF FTDF_SYMBOLTIMESNAPSHOTVAL_REG: SYMBOLTIMESNAPSHOTVAL (Bitfield-Mask: 0xffffffff) */

/* ------------------------  FTDF_FTDF_RX_STATUS_DELTA_REG  ----------------------- */
#define FTDF_FTDF_RX_STATUS_DELTA_REG_RX_BUFF_IS_FULL_D_Pos (0UL)       /*!< FTDF FTDF_RX_STATUS_DELTA_REG: RX_BUFF_IS_FULL_D (Bit 0)    */
#define FTDF_FTDF_RX_STATUS_DELTA_REG_RX_BUFF_IS_FULL_D_Msk (0x1UL)     /*!< FTDF FTDF_RX_STATUS_DELTA_REG: RX_BUFF_IS_FULL_D (Bitfield-Mask: 0x01) */

/* ------------------------  FTDF_FTDF_RX_STATUS_MASK_REG  ------------------------ */
#define FTDF_FTDF_RX_STATUS_MASK_REG_RX_BUFF_IS_FULL_M_Pos (0UL)        /*!< FTDF FTDF_RX_STATUS_MASK_REG: RX_BUFF_IS_FULL_M (Bit 0)     */
#define FTDF_FTDF_RX_STATUS_MASK_REG_RX_BUFF_IS_FULL_M_Msk (0x1UL)      /*!< FTDF FTDF_RX_STATUS_MASK_REG: RX_BUFF_IS_FULL_M (Bitfield-Mask: 0x01) */

/* -------------------------  FTDF_FTDF_TX_CONTROL_0_REG  ------------------------- */
#define FTDF_FTDF_TX_CONTROL_0_REG_DBGTXTRANSPARENTMODE_Pos (0UL)       /*!< FTDF FTDF_TX_CONTROL_0_REG: DBGTXTRANSPARENTMODE (Bit 0)    */
#define FTDF_FTDF_TX_CONTROL_0_REG_DBGTXTRANSPARENTMODE_Msk (0x1UL)     /*!< FTDF FTDF_TX_CONTROL_0_REG: DBGTXTRANSPARENTMODE (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_TX_CONTROL_0_REG_MACMAXBE_Pos (4UL)                   /*!< FTDF FTDF_TX_CONTROL_0_REG: MACMAXBE (Bit 4)                */
#define FTDF_FTDF_TX_CONTROL_0_REG_MACMAXBE_Msk (0xf0UL)                /*!< FTDF FTDF_TX_CONTROL_0_REG: MACMAXBE (Bitfield-Mask: 0x0f)  */
#define FTDF_FTDF_TX_CONTROL_0_REG_MACMINBE_Pos (8UL)                   /*!< FTDF FTDF_TX_CONTROL_0_REG: MACMINBE (Bit 8)                */
#define FTDF_FTDF_TX_CONTROL_0_REG_MACMINBE_Msk (0xf00UL)               /*!< FTDF FTDF_TX_CONTROL_0_REG: MACMINBE (Bitfield-Mask: 0x0f)  */
#define FTDF_FTDF_TX_CONTROL_0_REG_MACMAXCSMABACKOFFS_Pos (12UL)        /*!< FTDF FTDF_TX_CONTROL_0_REG: MACMAXCSMABACKOFFS (Bit 12)     */
#define FTDF_FTDF_TX_CONTROL_0_REG_MACMAXCSMABACKOFFS_Msk (0x7000UL)    /*!< FTDF FTDF_TX_CONTROL_0_REG: MACMAXCSMABACKOFFS (Bitfield-Mask: 0x07) */

/* ----------------------------  FTDF_FTDF_FTDF_CE_REG  --------------------------- */
#define FTDF_FTDF_FTDF_CE_REG_FTDF_CE_Pos     (0UL)                     /*!< FTDF FTDF_FTDF_CE_REG: FTDF_CE (Bit 0)                      */
#define FTDF_FTDF_FTDF_CE_REG_FTDF_CE_Msk     (0x3fUL)                  /*!< FTDF FTDF_FTDF_CE_REG: FTDF_CE (Bitfield-Mask: 0x3f)        */

/* ----------------------------  FTDF_FTDF_FTDF_CM_REG  --------------------------- */
#define FTDF_FTDF_FTDF_CM_REG_FTDF_CM_Pos     (0UL)                     /*!< FTDF FTDF_FTDF_CM_REG: FTDF_CM (Bit 0)                      */
#define FTDF_FTDF_FTDF_CM_REG_FTDF_CM_Msk     (0x3fUL)                  /*!< FTDF FTDF_FTDF_CM_REG: FTDF_CM (Bitfield-Mask: 0x3f)        */

/* -----------------------  FTDF_FTDF_SYNCTIMESTAMPTHR_REG  ----------------------- */
#define FTDF_FTDF_SYNCTIMESTAMPTHR_REG_SYNCTIMESTAMPTHR_Pos (0UL)       /*!< FTDF FTDF_SYNCTIMESTAMPTHR_REG: SYNCTIMESTAMPTHR (Bit 0)    */
#define FTDF_FTDF_SYNCTIMESTAMPTHR_REG_SYNCTIMESTAMPTHR_Msk (0x1ffffffUL) /*!< FTDF FTDF_SYNCTIMESTAMPTHR_REG: SYNCTIMESTAMPTHR (Bitfield-Mask: 0x1ffffff) */

/* -----------------------  FTDF_FTDF_SYNCTIMESTAMPVAL_REG  ----------------------- */
#define FTDF_FTDF_SYNCTIMESTAMPVAL_REG_SYNCTIMESTAMPVAL_Pos (0UL)       /*!< FTDF FTDF_SYNCTIMESTAMPVAL_REG: SYNCTIMESTAMPVAL (Bit 0)    */
#define FTDF_FTDF_SYNCTIMESTAMPVAL_REG_SYNCTIMESTAMPVAL_Msk (0xffffffffUL) /*!< FTDF FTDF_SYNCTIMESTAMPVAL_REG: SYNCTIMESTAMPVAL (Bitfield-Mask: 0xffffffff) */

/* ------------------------  FTDF_FTDF_TIMER_CONTROL_1_REG  ----------------------- */
#define FTDF_FTDF_TIMER_CONTROL_1_REG_SYNCTIMESTAMPENA_Pos (1UL)        /*!< FTDF FTDF_TIMER_CONTROL_1_REG: SYNCTIMESTAMPENA (Bit 1)     */
#define FTDF_FTDF_TIMER_CONTROL_1_REG_SYNCTIMESTAMPENA_Msk (0x2UL)      /*!< FTDF FTDF_TIMER_CONTROL_1_REG: SYNCTIMESTAMPENA (Bitfield-Mask: 0x01) */

/* -----------------------  FTDF_FTDF_MACTXSTDACKFRMCNT_REG  ---------------------- */
#define FTDF_FTDF_MACTXSTDACKFRMCNT_REG_MACTXSTDACKFRMCNT_Pos (0UL)     /*!< FTDF FTDF_MACTXSTDACKFRMCNT_REG: MACTXSTDACKFRMCNT (Bit 0)  */
#define FTDF_FTDF_MACTXSTDACKFRMCNT_REG_MACTXSTDACKFRMCNT_Msk (0xffffffffUL) /*!< FTDF FTDF_MACTXSTDACKFRMCNT_REG: MACTXSTDACKFRMCNT (Bitfield-Mask: 0xffffffff) */

