openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* -------------------------  FTDF_FTDF_LONG_ADDR_0_0_REG  ------------------------ */
#define FTDF_FTDF_LONG_ADDR_0_0_REG_EXP_SA_L_Pos (0UL)                  /*!< FTDF FTDF_LONG_ADDR_0_0_REG: EXP_SA_L (Bit 0)               */
#define FTDF_FTDF_LONG_ADDR_0_0_REG_EXP_SA_L_Msk (0xffffffffUL)         /*!< FTDF FTDF_LONG_ADDR_0_0_REG: EXP_SA_L (Bitfield-Mask: 0xffffffff) */

/* -------------------------  FTDF_FTDF_LONG_ADDR_1_0_REG  ------------------------ */
#define FTDF_FTDF_LONG_ADDR_1_0_REG_EXP_SA_H_Pos (0UL)                  /*!< FTDF FTDF_LONG_ADDR_1_0_REG: EXP_SA_H (Bit 0)               */
#define FTDF_FTDF_LONG_ADDR_1_0_REG_EXP_SA_H_Msk (0xffffffffUL)         /*!< FTDF FTDF_LONG_ADDR_1_0_REG: EXP_SA_H (Bitfield-Mask: 0xffffffff) */

/* ------------------------  FTDF_FTDF_SIZE_AND_VAL_0_REG  ------------------------ */
#define FTDF_FTDF_SIZE_AND_VAL_0_REG_VALID_SA_Pos (0UL)                 /*!< FTDF FTDF_SIZE_AND_VAL_0_REG: VALID_SA (Bit 0)              */
#define FTDF_FTDF_SIZE_AND_VAL_0_REG_VALID_SA_Msk (0xfUL)               /*!< FTDF FTDF_SIZE_AND_VAL_0_REG: VALID_SA (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_SIZE_AND_VAL_0_REG_SHORT_LONGNOT_Pos (4UL)            /*!< FTDF FTDF_SIZE_AND_VAL_0_REG: SHORT_LONGNOT (Bit 4)         */
#define FTDF_FTDF_SIZE_AND_VAL_0_REG_SHORT_LONGNOT_Msk (0x10UL)         /*!< FTDF FTDF_SIZE_AND_VAL_0_REG: SHORT_LONGNOT (Bitfield-Mask: 0x01) */


/* ================================================================================ */
/* ================       struct 'GP_TIMERS' Position & Mask       ================ */
/* ================================================================================ */


/* --------------------------  GP_TIMERS_TIMER0_CTRL_REG  ------------------------- */
#define GP_TIMERS_TIMER0_CTRL_REG_TIM0_CTRL_Pos (0UL)                   /*!< GP_TIMERS TIMER0_CTRL_REG: TIM0_CTRL (Bit 0)                */
#define GP_TIMERS_TIMER0_CTRL_REG_TIM0_CTRL_Msk (0x1UL)                 /*!< GP_TIMERS TIMER0_CTRL_REG: TIM0_CTRL (Bitfield-Mask: 0x01)  */
#define GP_TIMERS_TIMER0_CTRL_REG_TIM0_CLK_SEL_Pos (1UL)                /*!< GP_TIMERS TIMER0_CTRL_REG: TIM0_CLK_SEL (Bit 1)             */
#define GP_TIMERS_TIMER0_CTRL_REG_TIM0_CLK_SEL_Msk (0x2UL)              /*!< GP_TIMERS TIMER0_CTRL_REG: TIM0_CLK_SEL (Bitfield-Mask: 0x01) */
#define GP_TIMERS_TIMER0_CTRL_REG_TIM0_CLK_DIV_Pos (2UL)                /*!< GP_TIMERS TIMER0_CTRL_REG: TIM0_CLK_DIV (Bit 2)             */
#define GP_TIMERS_TIMER0_CTRL_REG_TIM0_CLK_DIV_Msk (0x4UL)              /*!< GP_TIMERS TIMER0_CTRL_REG: TIM0_CLK_DIV (Bitfield-Mask: 0x01) */
#define GP_TIMERS_TIMER0_CTRL_REG_PWM_MODE_Pos (3UL)                    /*!< GP_TIMERS TIMER0_CTRL_REG: PWM_MODE (Bit 3)                 */
#define GP_TIMERS_TIMER0_CTRL_REG_PWM_MODE_Msk (0x8UL)                  /*!< GP_TIMERS TIMER0_CTRL_REG: PWM_MODE (Bitfield-Mask: 0x01)   */

/* ---------------------------  GP_TIMERS_TIMER0_ON_REG  -------------------------- */
#define GP_TIMERS_TIMER0_ON_REG_TIM0_ON_Pos   (0UL)                     /*!< GP_TIMERS TIMER0_ON_REG: TIM0_ON (Bit 0)                    */
#define GP_TIMERS_TIMER0_ON_REG_TIM0_ON_Msk   (0xffffUL)                /*!< GP_TIMERS TIMER0_ON_REG: TIM0_ON (Bitfield-Mask: 0xffff)    */

/* ------------------------  GP_TIMERS_TIMER0_RELOAD_M_REG  ----------------------- */
#define GP_TIMERS_TIMER0_RELOAD_M_REG_TIM0_M_Pos (0UL)                  /*!< GP_TIMERS TIMER0_RELOAD_M_REG: TIM0_M (Bit 0)               */
#define GP_TIMERS_TIMER0_RELOAD_M_REG_TIM0_M_Msk (0xffffUL)             /*!< GP_TIMERS TIMER0_RELOAD_M_REG: TIM0_M (Bitfield-Mask: 0xffff) */

/* ------------------------  GP_TIMERS_TIMER0_RELOAD_N_REG  ----------------------- */
#define GP_TIMERS_TIMER0_RELOAD_N_REG_TIM0_N_Pos (0UL)                  /*!< GP_TIMERS TIMER0_RELOAD_N_REG: TIM0_N (Bit 0)               */
#define GP_TIMERS_TIMER0_RELOAD_N_REG_TIM0_N_Msk (0xffffUL)             /*!< GP_TIMERS TIMER0_RELOAD_N_REG: TIM0_N (Bitfield-Mask: 0xffff) */

/* -------------------------  GP_TIMERS_PWM2_START_CYCLE  ------------------------- */
#define GP_TIMERS_PWM2_START_CYCLE_START_CYCLE_Pos (0UL)                /*!< GP_TIMERS PWM2_START_CYCLE: START_CYCLE (Bit 0)             */
#define GP_TIMERS_PWM2_START_CYCLE_START_CYCLE_Msk (0x3fffUL)           /*!< GP_TIMERS PWM2_START_CYCLE: START_CYCLE (Bitfield-Mask: 0x3fff) */

/* -------------------------  GP_TIMERS_PWM3_START_CYCLE  ------------------------- */
#define GP_TIMERS_PWM3_START_CYCLE_START_CYCLE_Pos (0UL)                /*!< GP_TIMERS PWM3_START_CYCLE: START_CYCLE (Bit 0)             */
#define GP_TIMERS_PWM3_START_CYCLE_START_CYCLE_Msk (0x3fffUL)           /*!< GP_TIMERS PWM3_START_CYCLE: START_CYCLE (Bitfield-Mask: 0x3fff) */

/* -------------------------  GP_TIMERS_PWM4_START_CYCLE  ------------------------- */
#define GP_TIMERS_PWM4_START_CYCLE_START_CYCLE_Pos (0UL)                /*!< GP_TIMERS PWM4_START_CYCLE: START_CYCLE (Bit 0)             */
#define GP_TIMERS_PWM4_START_CYCLE_START_CYCLE_Msk (0x3fffUL)           /*!< GP_TIMERS PWM4_START_CYCLE: START_CYCLE (Bitfield-Mask: 0x3fff) */

/* --------------------------  GP_TIMERS_PWM2_END_CYCLE  -------------------------- */
#define GP_TIMERS_PWM2_END_CYCLE_END_CYCLE_Pos (0UL)                    /*!< GP_TIMERS PWM2_END_CYCLE: END_CYCLE (Bit 0)                 */
#define GP_TIMERS_PWM2_END_CYCLE_END_CYCLE_Msk (0x3fffUL)               /*!< GP_TIMERS PWM2_END_CYCLE: END_CYCLE (Bitfield-Mask: 0x3fff) */

/* --------------------------  GP_TIMERS_PWM3_END_CYCLE  -------------------------- */
#define GP_TIMERS_PWM3_END_CYCLE_END_CYCLE_Pos (0UL)                    /*!< GP_TIMERS PWM3_END_CYCLE: END_CYCLE (Bit 0)                 */
#define GP_TIMERS_PWM3_END_CYCLE_END_CYCLE_Msk (0x3fffUL)               /*!< GP_TIMERS PWM3_END_CYCLE: END_CYCLE (Bitfield-Mask: 0x3fff) */

/* --------------------------  GP_TIMERS_PWM4_END_CYCLE  -------------------------- */
#define GP_TIMERS_PWM4_END_CYCLE_END_CYCLE_Pos (0UL)                    /*!< GP_TIMERS PWM4_END_CYCLE: END_CYCLE (Bit 0)                 */
#define GP_TIMERS_PWM4_END_CYCLE_END_CYCLE_Msk (0x3fffUL)               /*!< GP_TIMERS PWM4_END_CYCLE: END_CYCLE (Bitfield-Mask: 0x3fff) */

/* -----------------------  GP_TIMERS_TRIPLE_PWM_FREQUENCY  ----------------------- */
#define GP_TIMERS_TRIPLE_PWM_FREQUENCY_FREQ_Pos (0UL)                   /*!< GP_TIMERS TRIPLE_PWM_FREQUENCY: FREQ (Bit 0)                */
#define GP_TIMERS_TRIPLE_PWM_FREQUENCY_FREQ_Msk (0x3fffUL)              /*!< GP_TIMERS TRIPLE_PWM_FREQUENCY: FREQ (Bitfield-Mask: 0x3fff) */

/* ------------------------  GP_TIMERS_TRIPLE_PWM_CTRL_REG  ----------------------- */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_TRIPLE_PWM_ENABLE_Pos (0UL)       /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: TRIPLE_PWM_ENABLE (Bit 0)    */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_TRIPLE_PWM_ENABLE_Msk (0x1UL)     /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: TRIPLE_PWM_ENABLE (Bitfield-Mask: 0x01) */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_SW_PAUSE_EN_Pos (1UL)             /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: SW_PAUSE_EN (Bit 1)          */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_SW_PAUSE_EN_Msk (0x2UL)           /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: SW_PAUSE_EN (Bitfield-Mask: 0x01) */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_HW_PAUSE_EN_Pos (2UL)             /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: HW_PAUSE_EN (Bit 2)          */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_HW_PAUSE_EN_Msk (0x4UL)           /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: HW_PAUSE_EN (Bitfield-Mask: 0x01) */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_TRIPLE_PWM_CLK_SEL_Pos (3UL)      /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: TRIPLE_PWM_CLK_SEL (Bit 3)   */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_TRIPLE_PWM_CLK_SEL_Msk (0x8UL)    /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: TRIPLE_PWM_CLK_SEL (Bitfield-Mask: 0x01) */

/* --------------------------  GP_TIMERS_BREATH_CFG_REG  -------------------------- */
#define GP_TIMERS_BREATH_CFG_REG_BRTH_DIV_Pos (0UL)                     /*!< GP_TIMERS BREATH_CFG_REG: BRTH_DIV (Bit 0)                  */
#define GP_TIMERS_BREATH_CFG_REG_BRTH_DIV_Msk (0xffUL)                  /*!< GP_TIMERS BREATH_CFG_REG: BRTH_DIV (Bitfield-Mask: 0xff)    */
#define GP_TIMERS_BREATH_CFG_REG_BRTH_STEP_Pos (8UL)                    /*!< GP_TIMERS BREATH_CFG_REG: BRTH_STEP (Bit 8)                 */
#define GP_TIMERS_BREATH_CFG_REG_BRTH_STEP_Msk (0xff00UL)               /*!< GP_TIMERS BREATH_CFG_REG: BRTH_STEP (Bitfield-Mask: 0xff)   */

/* ------------------------  GP_TIMERS_BREATH_DUTY_MAX_REG  ----------------------- */
#define GP_TIMERS_BREATH_DUTY_MAX_REG_BRTH_DUTY_MAX_Pos (0UL)           /*!< GP_TIMERS BREATH_DUTY_MAX_REG: BRTH_DUTY_MAX (Bit 0)        */
#define GP_TIMERS_BREATH_DUTY_MAX_REG_BRTH_DUTY_MAX_Msk (0xffUL)        /*!< GP_TIMERS BREATH_DUTY_MAX_REG: BRTH_DUTY_MAX (Bitfield-Mask: 0xff) */

/* ------------------------  GP_TIMERS_BREATH_DUTY_MIN_REG  ----------------------- */
#define GP_TIMERS_BREATH_DUTY_MIN_REG_BRTH_DUTY_MIN_Pos (0UL)           /*!< GP_TIMERS BREATH_DUTY_MIN_REG: BRTH_DUTY_MIN (Bit 0)        */
#define GP_TIMERS_BREATH_DUTY_MIN_REG_BRTH_DUTY_MIN_Msk (0xffUL)        /*!< GP_TIMERS BREATH_DUTY_MIN_REG: BRTH_DUTY_MIN (Bitfield-Mask: 0xff) */

/* --------------------------  GP_TIMERS_BREATH_CTRL_REG  ------------------------- */
#define GP_TIMERS_BREATH_CTRL_REG_BRTH_EN_Pos (0UL)                     /*!< GP_TIMERS BREATH_CTRL_REG: BRTH_EN (Bit 0)                  */
#define GP_TIMERS_BREATH_CTRL_REG_BRTH_EN_Msk (0x1UL)                   /*!< GP_TIMERS BREATH_CTRL_REG: BRTH_EN (Bitfield-Mask: 0x01)    */
#define GP_TIMERS_BREATH_CTRL_REG_BRTH_PWM_POL_Pos (1UL)                /*!< GP_TIMERS BREATH_CTRL_REG: BRTH_PWM_POL (Bit 1)             */
#define GP_TIMERS_BREATH_CTRL_REG_BRTH_PWM_POL_Msk (0x2UL)              /*!< GP_TIMERS BREATH_CTRL_REG: BRTH_PWM_POL (Bitfield-Mask: 0x01) */


/* ================================================================================ */
/* ================         struct 'GPADC' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------  GPADC_GP_ADC_CTRL_REG  --------------------------- */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_EN_Pos   (0UL)                     /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_EN (Bit 0)                    */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_EN_Msk   (0x1UL)                   /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_EN (Bitfield-Mask: 0x01)      */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_START_Pos (1UL)                    /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_START (Bit 1)                 */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_START_Msk (0x2UL)                  /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_START (Bitfield-Mask: 0x01)   */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_CONT_Pos (2UL)                     /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_CONT (Bit 2)                  */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_CONT_Msk (0x4UL)                   /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_CONT (Bitfield-Mask: 0x01)    */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_CLK_SEL_Pos (3UL)                  /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_CLK_SEL (Bit 3)               */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_CLK_SEL_Msk (0x8UL)                /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_CLK_SEL (Bitfield-Mask: 0x01) */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_INT_Pos  (4UL)                     /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_INT (Bit 4)                   */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_INT_Msk  (0x10UL)                  /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_INT (Bitfield-Mask: 0x01)     */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_MINT_Pos (5UL)                     /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_MINT (Bit 5)                  */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_MINT_Msk (0x20UL)                  /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_MINT (Bitfield-Mask: 0x01)    */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_SE_Pos   (6UL)                     /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_SE (Bit 6)                    */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_SE_Msk   (0x40UL)                  /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_SE (Bitfield-Mask: 0x01)      */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_MUTE_Pos (7UL)                     /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_MUTE (Bit 7)                  */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_MUTE_Msk (0x80UL)                  /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_MUTE (Bitfield-Mask: 0x01)    */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_SEL_Pos  (8UL)                     /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_SEL (Bit 8)                   */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_SEL_Msk  (0x1f00UL)                /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_SEL (Bitfield-Mask: 0x1f)     */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_SIGN_Pos (13UL)                    /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_SIGN (Bit 13)                 */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_SIGN_Msk (0x2000UL)                /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_SIGN (Bitfield-Mask: 0x01)    */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_CHOP_Pos (14UL)                    /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_CHOP (Bit 14)                 */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_CHOP_Msk (0x4000UL)                /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_CHOP (Bitfield-Mask: 0x01)    */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_LDO_ZERO_Pos (15UL)                /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_LDO_ZERO (Bit 15)             */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_LDO_ZERO_Msk (0x8000UL)            /*!< GPADC GP_ADC_CTRL_REG: GP_ADC_LDO_ZERO (Bitfield-Mask: 0x01) */

/* ---------------------------  GPADC_GP_ADC_CTRL2_REG  --------------------------- */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_ATTN3X_Pos (0UL)                  /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_ATTN3X (Bit 0)               */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_ATTN3X_Msk (0x1UL)                /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_ATTN3X (Bitfield-Mask: 0x01) */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_IDYN_Pos (1UL)                    /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_IDYN (Bit 1)                 */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_IDYN_Msk (0x2UL)                  /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_IDYN (Bitfield-Mask: 0x01)   */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_I20U_Pos (2UL)                    /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_I20U (Bit 2)                 */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_I20U_Msk (0x4UL)                  /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_I20U (Bitfield-Mask: 0x01)   */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_DMA_EN_Pos (3UL)                  /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_DMA_EN (Bit 3)               */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_DMA_EN_Msk (0x8UL)                /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_DMA_EN (Bitfield-Mask: 0x01) */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_CONV_NRS_Pos (5UL)                /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_CONV_NRS (Bit 5)             */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_CONV_NRS_Msk (0xe0UL)             /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_CONV_NRS (Bitfield-Mask: 0x07) */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_SMPL_TIME_Pos (8UL)               /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_SMPL_TIME (Bit 8)            */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_SMPL_TIME_Msk (0xf00UL)           /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_SMPL_TIME (Bitfield-Mask: 0x0f) */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_STORE_DEL_Pos (12UL)              /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_STORE_DEL (Bit 12)           */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_STORE_DEL_Msk (0xf000UL)          /*!< GPADC GP_ADC_CTRL2_REG: GP_ADC_STORE_DEL (Bitfield-Mask: 0x0f) */

/* ---------------------------  GPADC_GP_ADC_CTRL3_REG  --------------------------- */
#define GPADC_GP_ADC_CTRL3_REG_GP_ADC_EN_DEL_Pos (0UL)                  /*!< GPADC GP_ADC_CTRL3_REG: GP_ADC_EN_DEL (Bit 0)               */
#define GPADC_GP_ADC_CTRL3_REG_GP_ADC_EN_DEL_Msk (0xffUL)               /*!< GPADC GP_ADC_CTRL3_REG: GP_ADC_EN_DEL (Bitfield-Mask: 0xff) */
#define GPADC_GP_ADC_CTRL3_REG_GP_ADC_INTERVAL_Pos (8UL)                /*!< GPADC GP_ADC_CTRL3_REG: GP_ADC_INTERVAL (Bit 8)             */
#define GPADC_GP_ADC_CTRL3_REG_GP_ADC_INTERVAL_Msk (0xff00UL)           /*!< GPADC GP_ADC_CTRL3_REG: GP_ADC_INTERVAL (Bitfield-Mask: 0xff) */

