openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* ------------------------------  GPIO_P11_MODE_REG  ----------------------------- */
#define GPIO_P11_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P11_MODE_REG: PID (Bit 0)                              */
#define GPIO_P11_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P11_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P11_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P11_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P11_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P11_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P11_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P11_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P11_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P11_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P12_MODE_REG  ----------------------------- */
#define GPIO_P12_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P12_MODE_REG: PID (Bit 0)                              */
#define GPIO_P12_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P12_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P12_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P12_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P12_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P12_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P12_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P12_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P12_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P12_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P13_MODE_REG  ----------------------------- */
#define GPIO_P13_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P13_MODE_REG: PID (Bit 0)                              */
#define GPIO_P13_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P13_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P13_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P13_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P13_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P13_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P13_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P13_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P13_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P13_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P14_MODE_REG  ----------------------------- */
#define GPIO_P14_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P14_MODE_REG: PID (Bit 0)                              */
#define GPIO_P14_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P14_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P14_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P14_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P14_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P14_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P14_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P14_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P14_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P14_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P15_MODE_REG  ----------------------------- */
#define GPIO_P15_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P15_MODE_REG: PID (Bit 0)                              */
#define GPIO_P15_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P15_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P15_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P15_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P15_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P15_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P15_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P15_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P15_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P15_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P16_MODE_REG  ----------------------------- */
#define GPIO_P16_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P16_MODE_REG: PID (Bit 0)                              */
#define GPIO_P16_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P16_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P16_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P16_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P16_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P16_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P16_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P16_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P16_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P16_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P17_MODE_REG  ----------------------------- */
#define GPIO_P17_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P17_MODE_REG: PID (Bit 0)                              */
#define GPIO_P17_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P17_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P17_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P17_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P17_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P17_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P17_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P17_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P17_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P17_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P20_MODE_REG  ----------------------------- */
#define GPIO_P20_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P20_MODE_REG: PID (Bit 0)                              */
#define GPIO_P20_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P20_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P20_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P20_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P20_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P20_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P20_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P20_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P20_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P20_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P21_MODE_REG  ----------------------------- */
#define GPIO_P21_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P21_MODE_REG: PID (Bit 0)                              */
#define GPIO_P21_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P21_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P21_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P21_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P21_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P21_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P21_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P21_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P21_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P21_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P22_MODE_REG  ----------------------------- */
#define GPIO_P22_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P22_MODE_REG: PID (Bit 0)                              */
#define GPIO_P22_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P22_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P22_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P22_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P22_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P22_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P22_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P22_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P22_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P22_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P23_MODE_REG  ----------------------------- */
#define GPIO_P23_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P23_MODE_REG: PID (Bit 0)                              */
#define GPIO_P23_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P23_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P23_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P23_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P23_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P23_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P23_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P23_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P23_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P23_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P24_MODE_REG  ----------------------------- */
#define GPIO_P24_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P24_MODE_REG: PID (Bit 0)                              */
#define GPIO_P24_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P24_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P24_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P24_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P24_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P24_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P24_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P24_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P24_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P24_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P30_MODE_REG  ----------------------------- */
#define GPIO_P30_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P30_MODE_REG: PID (Bit 0)                              */
#define GPIO_P30_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P30_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P30_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P30_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P30_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P30_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P30_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P30_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P30_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P30_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P31_MODE_REG  ----------------------------- */
#define GPIO_P31_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P31_MODE_REG: PID (Bit 0)                              */
#define GPIO_P31_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P31_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P31_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P31_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P31_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P31_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P31_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P31_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P31_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P31_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P32_MODE_REG  ----------------------------- */
#define GPIO_P32_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P32_MODE_REG: PID (Bit 0)                              */
#define GPIO_P32_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P32_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P32_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P32_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P32_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P32_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P32_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P32_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P32_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P32_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P33_MODE_REG  ----------------------------- */
#define GPIO_P33_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P33_MODE_REG: PID (Bit 0)                              */
#define GPIO_P33_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P33_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P33_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P33_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P33_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P33_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P33_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P33_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P33_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P33_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P34_MODE_REG  ----------------------------- */
#define GPIO_P34_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P34_MODE_REG: PID (Bit 0)                              */
#define GPIO_P34_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P34_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P34_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P34_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P34_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P34_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P34_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P34_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P34_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P34_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P35_MODE_REG  ----------------------------- */
#define GPIO_P35_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P35_MODE_REG: PID (Bit 0)                              */
#define GPIO_P35_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P35_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P35_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P35_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P35_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P35_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P35_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P35_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P35_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P35_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P36_MODE_REG  ----------------------------- */
#define GPIO_P36_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P36_MODE_REG: PID (Bit 0)                              */
#define GPIO_P36_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P36_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P36_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P36_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P36_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P36_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P36_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P36_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P36_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P36_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P37_MODE_REG  ----------------------------- */
#define GPIO_P37_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P37_MODE_REG: PID (Bit 0)                              */
#define GPIO_P37_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P37_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P37_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P37_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P37_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P37_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P37_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P37_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P37_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P37_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P40_MODE_REG  ----------------------------- */
#define GPIO_P40_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P40_MODE_REG: PID (Bit 0)                              */
#define GPIO_P40_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P40_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P40_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P40_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P40_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P40_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P40_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P40_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P40_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P40_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P41_MODE_REG  ----------------------------- */
#define GPIO_P41_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P41_MODE_REG: PID (Bit 0)                              */
#define GPIO_P41_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P41_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P41_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P41_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P41_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P41_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P41_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P41_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P41_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P41_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P42_MODE_REG  ----------------------------- */
#define GPIO_P42_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P42_MODE_REG: PID (Bit 0)                              */
#define GPIO_P42_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P42_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P42_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P42_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P42_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P42_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P42_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P42_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P42_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P42_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P43_MODE_REG  ----------------------------- */
#define GPIO_P43_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P43_MODE_REG: PID (Bit 0)                              */
#define GPIO_P43_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P43_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P43_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P43_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P43_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P43_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P43_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P43_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P43_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P43_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P44_MODE_REG  ----------------------------- */
#define GPIO_P44_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P44_MODE_REG: PID (Bit 0)                              */
#define GPIO_P44_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P44_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P44_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P44_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P44_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P44_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P44_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P44_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P44_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P44_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

