openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* ----------------------------  I2C_I2C_DMA_TDLR_REG  ---------------------------- */
#define I2C_I2C_DMA_TDLR_REG_DMATDL_Pos       (0UL)                     /*!< I2C I2C_DMA_TDLR_REG: DMATDL (Bit 0)                        */
#define I2C_I2C_DMA_TDLR_REG_DMATDL_Msk       (0x1fUL)                  /*!< I2C I2C_DMA_TDLR_REG: DMATDL (Bitfield-Mask: 0x1f)          */

/* ----------------------------  I2C_I2C_DMA_RDLR_REG  ---------------------------- */
#define I2C_I2C_DMA_RDLR_REG_DMARDL_Pos       (0UL)                     /*!< I2C I2C_DMA_RDLR_REG: DMARDL (Bit 0)                        */
#define I2C_I2C_DMA_RDLR_REG_DMARDL_Msk       (0x1fUL)                  /*!< I2C I2C_DMA_RDLR_REG: DMARDL (Bitfield-Mask: 0x1f)          */

/* ----------------------------  I2C_I2C_SDA_SETUP_REG  --------------------------- */
#define I2C_I2C_SDA_SETUP_REG_SDA_SETUP_Pos   (0UL)                     /*!< I2C I2C_SDA_SETUP_REG: SDA_SETUP (Bit 0)                    */
#define I2C_I2C_SDA_SETUP_REG_SDA_SETUP_Msk   (0xffUL)                  /*!< I2C I2C_SDA_SETUP_REG: SDA_SETUP (Bitfield-Mask: 0xff)      */

/* ------------------------  I2C_I2C_ACK_GENERAL_CALL_REG  ------------------------ */
#define I2C_I2C_ACK_GENERAL_CALL_REG_ACK_GEN_CALL_Pos (0UL)             /*!< I2C I2C_ACK_GENERAL_CALL_REG: ACK_GEN_CALL (Bit 0)          */
#define I2C_I2C_ACK_GENERAL_CALL_REG_ACK_GEN_CALL_Msk (0x1UL)           /*!< I2C I2C_ACK_GENERAL_CALL_REG: ACK_GEN_CALL (Bitfield-Mask: 0x01) */

/* --------------------------  I2C_I2C_ENABLE_STATUS_REG  ------------------------- */
#define I2C_I2C_ENABLE_STATUS_REG_IC_EN_Pos   (0UL)                     /*!< I2C I2C_ENABLE_STATUS_REG: IC_EN (Bit 0)                    */
#define I2C_I2C_ENABLE_STATUS_REG_IC_EN_Msk   (0x1UL)                   /*!< I2C I2C_ENABLE_STATUS_REG: IC_EN (Bitfield-Mask: 0x01)      */
#define I2C_I2C_ENABLE_STATUS_REG_SLV_DISABLED_WHILE_BUSY_Pos (1UL)     /*!< I2C I2C_ENABLE_STATUS_REG: SLV_DISABLED_WHILE_BUSY (Bit 1)  */
#define I2C_I2C_ENABLE_STATUS_REG_SLV_DISABLED_WHILE_BUSY_Msk (0x2UL)   /*!< I2C I2C_ENABLE_STATUS_REG: SLV_DISABLED_WHILE_BUSY (Bitfield-Mask: 0x01) */
#define I2C_I2C_ENABLE_STATUS_REG_SLV_RX_DATA_LOST_Pos (2UL)            /*!< I2C I2C_ENABLE_STATUS_REG: SLV_RX_DATA_LOST (Bit 2)         */
#define I2C_I2C_ENABLE_STATUS_REG_SLV_RX_DATA_LOST_Msk (0x4UL)          /*!< I2C I2C_ENABLE_STATUS_REG: SLV_RX_DATA_LOST (Bitfield-Mask: 0x01) */

/* --------------------------  I2C_I2C_IC_FS_SPKLEN_REG  -------------------------- */
#define I2C_I2C_IC_FS_SPKLEN_REG_IC_FS_SPKLEN_Pos (0UL)                 /*!< I2C I2C_IC_FS_SPKLEN_REG: IC_FS_SPKLEN (Bit 0)              */
#define I2C_I2C_IC_FS_SPKLEN_REG_IC_FS_SPKLEN_Msk (0xffUL)              /*!< I2C I2C_IC_FS_SPKLEN_REG: IC_FS_SPKLEN (Bitfield-Mask: 0xff) */

/* ---------------------------  I2C_I2C_COMP_PARAM1_REG  -------------------------- */
#define I2C_I2C_COMP_PARAM1_REG_IC_COMP_PARAM1_Pos (0UL)                /*!< I2C I2C_COMP_PARAM1_REG: IC_COMP_PARAM1 (Bit 0)             */
#define I2C_I2C_COMP_PARAM1_REG_IC_COMP_PARAM1_Msk (0xffffUL)           /*!< I2C I2C_COMP_PARAM1_REG: IC_COMP_PARAM1 (Bitfield-Mask: 0xffff) */

/* ---------------------------  I2C_I2C_COMP_PARAM2_REG  -------------------------- */
#define I2C_I2C_COMP_PARAM2_REG_IC_COMP_PARAM2_Pos (0UL)                /*!< I2C I2C_COMP_PARAM2_REG: IC_COMP_PARAM2 (Bit 0)             */
#define I2C_I2C_COMP_PARAM2_REG_IC_COMP_PARAM2_Msk (0xffffUL)           /*!< I2C I2C_COMP_PARAM2_REG: IC_COMP_PARAM2 (Bitfield-Mask: 0xffff) */

/* --------------------------  I2C_I2C_COMP_VERSION_REG  -------------------------- */
#define I2C_I2C_COMP_VERSION_REG_IC_COMP_VERSION_Pos (0UL)              /*!< I2C I2C_COMP_VERSION_REG: IC_COMP_VERSION (Bit 0)           */
#define I2C_I2C_COMP_VERSION_REG_IC_COMP_VERSION_Msk (0xffffUL)         /*!< I2C I2C_COMP_VERSION_REG: IC_COMP_VERSION (Bitfield-Mask: 0xffff) */

/* ----------------------------  I2C_I2C_COMP2_VERSION  --------------------------- */
#define I2C_I2C_COMP2_VERSION_IC_COMP2_VERSION_Pos (0UL)                /*!< I2C I2C_COMP2_VERSION: IC_COMP2_VERSION (Bit 0)             */
#define I2C_I2C_COMP2_VERSION_IC_COMP2_VERSION_Msk (0xffffUL)           /*!< I2C I2C_COMP2_VERSION: IC_COMP2_VERSION (Bitfield-Mask: 0xffff) */

/* ----------------------------  I2C_I2C_COMP_TYPE_REG  --------------------------- */
#define I2C_I2C_COMP_TYPE_REG_IC_COMP_TYPE_Pos (0UL)                    /*!< I2C I2C_COMP_TYPE_REG: IC_COMP_TYPE (Bit 0)                 */
#define I2C_I2C_COMP_TYPE_REG_IC_COMP_TYPE_Msk (0xffffUL)               /*!< I2C I2C_COMP_TYPE_REG: IC_COMP_TYPE (Bitfield-Mask: 0xffff) */

/* ---------------------------  I2C_I2C_COMP_TYPE2_REG  --------------------------- */
#define I2C_I2C_COMP_TYPE2_REG_IC_COMP2_TYPE_Pos (0UL)                  /*!< I2C I2C_COMP_TYPE2_REG: IC_COMP2_TYPE (Bit 0)               */
#define I2C_I2C_COMP_TYPE2_REG_IC_COMP2_TYPE_Msk (0xffffUL)             /*!< I2C I2C_COMP_TYPE2_REG: IC_COMP2_TYPE (Bitfield-Mask: 0xffff) */


/* ================================================================================ */
/* ================          struct 'I2C2' Position & Mask         ================ */
/* ================================================================================ */


/* ------------------------------  I2C2_I2C2_CON_REG  ----------------------------- */
#define I2C2_I2C2_CON_REG_I2C_MASTER_MODE_Pos (0UL)                     /*!< I2C2 I2C2_CON_REG: I2C_MASTER_MODE (Bit 0)                  */
#define I2C2_I2C2_CON_REG_I2C_MASTER_MODE_Msk (0x1UL)                   /*!< I2C2 I2C2_CON_REG: I2C_MASTER_MODE (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_CON_REG_I2C_SPEED_Pos       (1UL)                     /*!< I2C2 I2C2_CON_REG: I2C_SPEED (Bit 1)                        */
#define I2C2_I2C2_CON_REG_I2C_SPEED_Msk       (0x6UL)                   /*!< I2C2 I2C2_CON_REG: I2C_SPEED (Bitfield-Mask: 0x03)          */
#define I2C2_I2C2_CON_REG_I2C_10BITADDR_SLAVE_Pos (3UL)                 /*!< I2C2 I2C2_CON_REG: I2C_10BITADDR_SLAVE (Bit 3)              */
#define I2C2_I2C2_CON_REG_I2C_10BITADDR_SLAVE_Msk (0x8UL)               /*!< I2C2 I2C2_CON_REG: I2C_10BITADDR_SLAVE (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_CON_REG_I2C_10BITADDR_MASTER_Pos (4UL)                /*!< I2C2 I2C2_CON_REG: I2C_10BITADDR_MASTER (Bit 4)             */
#define I2C2_I2C2_CON_REG_I2C_10BITADDR_MASTER_Msk (0x10UL)             /*!< I2C2 I2C2_CON_REG: I2C_10BITADDR_MASTER (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_CON_REG_I2C_RESTART_EN_Pos  (5UL)                     /*!< I2C2 I2C2_CON_REG: I2C_RESTART_EN (Bit 5)                   */
#define I2C2_I2C2_CON_REG_I2C_RESTART_EN_Msk  (0x20UL)                  /*!< I2C2 I2C2_CON_REG: I2C_RESTART_EN (Bitfield-Mask: 0x01)     */
#define I2C2_I2C2_CON_REG_I2C_SLAVE_DISABLE_Pos (6UL)                   /*!< I2C2 I2C2_CON_REG: I2C_SLAVE_DISABLE (Bit 6)                */
#define I2C2_I2C2_CON_REG_I2C_SLAVE_DISABLE_Msk (0x40UL)                /*!< I2C2 I2C2_CON_REG: I2C_SLAVE_DISABLE (Bitfield-Mask: 0x01)  */

/* ------------------------------  I2C2_I2C2_TAR_REG  ----------------------------- */
#define I2C2_I2C2_TAR_REG_IC_TAR_Pos          (0UL)                     /*!< I2C2 I2C2_TAR_REG: IC_TAR (Bit 0)                           */
#define I2C2_I2C2_TAR_REG_IC_TAR_Msk          (0x3ffUL)                 /*!< I2C2 I2C2_TAR_REG: IC_TAR (Bitfield-Mask: 0x3ff)            */
#define I2C2_I2C2_TAR_REG_GC_OR_START_Pos     (10UL)                    /*!< I2C2 I2C2_TAR_REG: GC_OR_START (Bit 10)                     */
#define I2C2_I2C2_TAR_REG_GC_OR_START_Msk     (0x400UL)                 /*!< I2C2 I2C2_TAR_REG: GC_OR_START (Bitfield-Mask: 0x01)        */
#define I2C2_I2C2_TAR_REG_SPECIAL_Pos         (11UL)                    /*!< I2C2 I2C2_TAR_REG: SPECIAL (Bit 11)                         */
#define I2C2_I2C2_TAR_REG_SPECIAL_Msk         (0x800UL)                 /*!< I2C2 I2C2_TAR_REG: SPECIAL (Bitfield-Mask: 0x01)            */

/* ------------------------------  I2C2_I2C2_SAR_REG  ----------------------------- */
#define I2C2_I2C2_SAR_REG_IC_SAR_Pos          (0UL)                     /*!< I2C2 I2C2_SAR_REG: IC_SAR (Bit 0)                           */
#define I2C2_I2C2_SAR_REG_IC_SAR_Msk          (0x3ffUL)                 /*!< I2C2 I2C2_SAR_REG: IC_SAR (Bitfield-Mask: 0x3ff)            */

/* ---------------------------  I2C2_I2C2_DATA_CMD_REG  --------------------------- */
#define I2C2_I2C2_DATA_CMD_REG_DAT_Pos        (0UL)                     /*!< I2C2 I2C2_DATA_CMD_REG: DAT (Bit 0)                         */
#define I2C2_I2C2_DATA_CMD_REG_DAT_Msk        (0xffUL)                  /*!< I2C2 I2C2_DATA_CMD_REG: DAT (Bitfield-Mask: 0xff)           */
#define I2C2_I2C2_DATA_CMD_REG_CMD_Pos        (8UL)                     /*!< I2C2 I2C2_DATA_CMD_REG: CMD (Bit 8)                         */
#define I2C2_I2C2_DATA_CMD_REG_CMD_Msk        (0x100UL)                 /*!< I2C2 I2C2_DATA_CMD_REG: CMD (Bitfield-Mask: 0x01)           */
#define I2C2_I2C2_DATA_CMD_REG_STOP_Pos       (9UL)                     /*!< I2C2 I2C2_DATA_CMD_REG: STOP (Bit 9)                        */
#define I2C2_I2C2_DATA_CMD_REG_STOP_Msk       (0x200UL)                 /*!< I2C2 I2C2_DATA_CMD_REG: STOP (Bitfield-Mask: 0x01)          */
#define I2C2_I2C2_DATA_CMD_REG_RESTART_Pos    (10UL)                    /*!< I2C2 I2C2_DATA_CMD_REG: RESTART (Bit 10)                    */
#define I2C2_I2C2_DATA_CMD_REG_RESTART_Msk    (0x400UL)                 /*!< I2C2 I2C2_DATA_CMD_REG: RESTART (Bitfield-Mask: 0x01)       */

