openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* ---------------------------  I2C2_I2C2_COMP2_VERSION  -------------------------- */
#define I2C2_I2C2_COMP2_VERSION_IC_COMP2_VERSION_Pos (0UL)              /*!< I2C2 I2C2_COMP2_VERSION: IC_COMP2_VERSION (Bit 0)           */
#define I2C2_I2C2_COMP2_VERSION_IC_COMP2_VERSION_Msk (0xffffUL)         /*!< I2C2 I2C2_COMP2_VERSION: IC_COMP2_VERSION (Bitfield-Mask: 0xffff) */

/* ---------------------------  I2C2_I2C2_COMP_TYPE_REG  -------------------------- */
#define I2C2_I2C2_COMP_TYPE_REG_IC_COMP_TYPE_Pos (0UL)                  /*!< I2C2 I2C2_COMP_TYPE_REG: IC_COMP_TYPE (Bit 0)               */
#define I2C2_I2C2_COMP_TYPE_REG_IC_COMP_TYPE_Msk (0xffffUL)             /*!< I2C2 I2C2_COMP_TYPE_REG: IC_COMP_TYPE (Bitfield-Mask: 0xffff) */

/* --------------------------  I2C2_I2C2_COMP_TYPE2_REG  -------------------------- */
#define I2C2_I2C2_COMP_TYPE2_REG_IC_COMP2_TYPE_Pos (0UL)                /*!< I2C2 I2C2_COMP_TYPE2_REG: IC_COMP2_TYPE (Bit 0)             */
#define I2C2_I2C2_COMP_TYPE2_REG_IC_COMP2_TYPE_Msk (0xffffUL)           /*!< I2C2 I2C2_COMP_TYPE2_REG: IC_COMP2_TYPE (Bitfield-Mask: 0xffff) */


/* ================================================================================ */
/* ================           struct 'IR' Position & Mask          ================ */
/* ================================================================================ */


/* --------------------------  IR_IR_FREQ_CARRIER_ON_REG  ------------------------- */
#define IR_IR_FREQ_CARRIER_ON_REG_IR_FREQ_CARRIER_ON_Pos (0UL)          /*!< IR IR_FREQ_CARRIER_ON_REG: IR_FREQ_CARRIER_ON (Bit 0)       */
#define IR_IR_FREQ_CARRIER_ON_REG_IR_FREQ_CARRIER_ON_Msk (0x3ffUL)      /*!< IR IR_FREQ_CARRIER_ON_REG: IR_FREQ_CARRIER_ON (Bitfield-Mask: 0x3ff) */

/* -------------------------  IR_IR_FREQ_CARRIER_OFF_REG  ------------------------- */
#define IR_IR_FREQ_CARRIER_OFF_REG_IR_FREQ_CARRIER_OFF_Pos (0UL)        /*!< IR IR_FREQ_CARRIER_OFF_REG: IR_FREQ_CARRIER_OFF (Bit 0)     */
#define IR_IR_FREQ_CARRIER_OFF_REG_IR_FREQ_CARRIER_OFF_Msk (0x3ffUL)    /*!< IR IR_FREQ_CARRIER_OFF_REG: IR_FREQ_CARRIER_OFF (Bitfield-Mask: 0x3ff) */

/* --------------------------  IR_IR_LOGIC_ONE_TIME_REG  -------------------------- */
#define IR_IR_LOGIC_ONE_TIME_REG_IR_LOGIC_ONE_SPACE_Pos (0UL)           /*!< IR IR_LOGIC_ONE_TIME_REG: IR_LOGIC_ONE_SPACE (Bit 0)        */
#define IR_IR_LOGIC_ONE_TIME_REG_IR_LOGIC_ONE_SPACE_Msk (0xffUL)        /*!< IR IR_LOGIC_ONE_TIME_REG: IR_LOGIC_ONE_SPACE (Bitfield-Mask: 0xff) */
#define IR_IR_LOGIC_ONE_TIME_REG_IR_LOGIC_ONE_MARK_Pos (8UL)            /*!< IR IR_LOGIC_ONE_TIME_REG: IR_LOGIC_ONE_MARK (Bit 8)         */
#define IR_IR_LOGIC_ONE_TIME_REG_IR_LOGIC_ONE_MARK_Msk (0xff00UL)       /*!< IR IR_LOGIC_ONE_TIME_REG: IR_LOGIC_ONE_MARK (Bitfield-Mask: 0xff) */

/* --------------------------  IR_IR_LOGIC_ZERO_TIME_REG  ------------------------- */
#define IR_IR_LOGIC_ZERO_TIME_REG_IR_LOGIC_ZERO_SPACE_Pos (0UL)         /*!< IR IR_LOGIC_ZERO_TIME_REG: IR_LOGIC_ZERO_SPACE (Bit 0)      */
#define IR_IR_LOGIC_ZERO_TIME_REG_IR_LOGIC_ZERO_SPACE_Msk (0xffUL)      /*!< IR IR_LOGIC_ZERO_TIME_REG: IR_LOGIC_ZERO_SPACE (Bitfield-Mask: 0xff) */
#define IR_IR_LOGIC_ZERO_TIME_REG_IR_LOGIC_ZERO_MARK_Pos (8UL)          /*!< IR IR_LOGIC_ZERO_TIME_REG: IR_LOGIC_ZERO_MARK (Bit 8)       */
#define IR_IR_LOGIC_ZERO_TIME_REG_IR_LOGIC_ZERO_MARK_Msk (0xff00UL)     /*!< IR IR_LOGIC_ZERO_TIME_REG: IR_LOGIC_ZERO_MARK (Bitfield-Mask: 0xff) */

/* -------------------------------  IR_IR_CTRL_REG  ------------------------------- */
#define IR_IR_CTRL_REG_IR_CODE_FIFO_RESET_Pos (0UL)                     /*!< IR IR_CTRL_REG: IR_CODE_FIFO_RESET (Bit 0)                  */
#define IR_IR_CTRL_REG_IR_CODE_FIFO_RESET_Msk (0x1UL)                   /*!< IR IR_CTRL_REG: IR_CODE_FIFO_RESET (Bitfield-Mask: 0x01)    */
#define IR_IR_CTRL_REG_IR_REP_FIFO_RESET_Pos  (1UL)                     /*!< IR IR_CTRL_REG: IR_REP_FIFO_RESET (Bit 1)                   */
#define IR_IR_CTRL_REG_IR_REP_FIFO_RESET_Msk  (0x2UL)                   /*!< IR IR_CTRL_REG: IR_REP_FIFO_RESET (Bitfield-Mask: 0x01)     */
#define IR_IR_CTRL_REG_IR_ENABLE_Pos          (2UL)                     /*!< IR IR_CTRL_REG: IR_ENABLE (Bit 2)                           */
#define IR_IR_CTRL_REG_IR_ENABLE_Msk          (0x4UL)                   /*!< IR IR_CTRL_REG: IR_ENABLE (Bitfield-Mask: 0x01)             */
#define IR_IR_CTRL_REG_IR_TX_START_Pos        (3UL)                     /*!< IR IR_CTRL_REG: IR_TX_START (Bit 3)                         */
#define IR_IR_CTRL_REG_IR_TX_START_Msk        (0x8UL)                   /*!< IR IR_CTRL_REG: IR_TX_START (Bitfield-Mask: 0x01)           */
#define IR_IR_CTRL_REG_IR_REPEAT_TYPE_Pos     (4UL)                     /*!< IR IR_CTRL_REG: IR_REPEAT_TYPE (Bit 4)                      */
#define IR_IR_CTRL_REG_IR_REPEAT_TYPE_Msk     (0x10UL)                  /*!< IR IR_CTRL_REG: IR_REPEAT_TYPE (Bitfield-Mask: 0x01)        */
#define IR_IR_CTRL_REG_IR_INVERT_OUTPUT_Pos   (5UL)                     /*!< IR IR_CTRL_REG: IR_INVERT_OUTPUT (Bit 5)                    */
#define IR_IR_CTRL_REG_IR_INVERT_OUTPUT_Msk   (0x20UL)                  /*!< IR IR_CTRL_REG: IR_INVERT_OUTPUT (Bitfield-Mask: 0x01)      */
#define IR_IR_CTRL_REG_IR_LOGIC_ZERO_FORMAT_Pos (6UL)                   /*!< IR IR_CTRL_REG: IR_LOGIC_ZERO_FORMAT (Bit 6)                */
#define IR_IR_CTRL_REG_IR_LOGIC_ZERO_FORMAT_Msk (0x40UL)                /*!< IR IR_CTRL_REG: IR_LOGIC_ZERO_FORMAT (Bitfield-Mask: 0x01)  */
#define IR_IR_CTRL_REG_IR_LOGIC_ONE_FORMAT_Pos (7UL)                    /*!< IR IR_CTRL_REG: IR_LOGIC_ONE_FORMAT (Bit 7)                 */
#define IR_IR_CTRL_REG_IR_LOGIC_ONE_FORMAT_Msk (0x80UL)                 /*!< IR IR_CTRL_REG: IR_LOGIC_ONE_FORMAT (Bitfield-Mask: 0x01)   */
#define IR_IR_CTRL_REG_IR_IRQ_EN_Pos          (8UL)                     /*!< IR IR_CTRL_REG: IR_IRQ_EN (Bit 8)                           */
#define IR_IR_CTRL_REG_IR_IRQ_EN_Msk          (0x100UL)                 /*!< IR IR_CTRL_REG: IR_IRQ_EN (Bitfield-Mask: 0x01)             */

