openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* -------------------------  PLLDIG_RF_CALTRIM_STEP2_REG  ------------------------ */
#define PLLDIG_RF_CALTRIM_STEP2_REG_MDSTATE_RD_Pos (0UL)                /*!< PLLDIG RF_CALTRIM_STEP2_REG: MDSTATE_RD (Bit 0)             */
#define PLLDIG_RF_CALTRIM_STEP2_REG_MDSTATE_RD_Msk (0xffffUL)           /*!< PLLDIG RF_CALTRIM_STEP2_REG: MDSTATE_RD (Bitfield-Mask: 0xffff) */

/* -------------------------  PLLDIG_RF_CALTRIM_STEP3_REG  ------------------------ */
#define PLLDIG_RF_CALTRIM_STEP3_REG_MDSTATE_RD_Pos (0UL)                /*!< PLLDIG RF_CALTRIM_STEP3_REG: MDSTATE_RD (Bit 0)             */
#define PLLDIG_RF_CALTRIM_STEP3_REG_MDSTATE_RD_Msk (0xffffUL)           /*!< PLLDIG RF_CALTRIM_STEP3_REG: MDSTATE_RD (Bitfield-Mask: 0xffff) */

/* -------------------------  PLLDIG_RF_CALTRIM_STEP4_REG  ------------------------ */
#define PLLDIG_RF_CALTRIM_STEP4_REG_MDSTATE_RD_Pos (0UL)                /*!< PLLDIG RF_CALTRIM_STEP4_REG: MDSTATE_RD (Bit 0)             */
#define PLLDIG_RF_CALTRIM_STEP4_REG_MDSTATE_RD_Msk (0xffffUL)           /*!< PLLDIG RF_CALTRIM_STEP4_REG: MDSTATE_RD (Bitfield-Mask: 0xffff) */

/* --------------------------  PLLDIG_RF_MGAIN_CTRL3_REG  ------------------------- */
#define PLLDIG_RF_MGAIN_CTRL3_REG_GFSK_GAIN_OFFSET_Pos (0UL)            /*!< PLLDIG RF_MGAIN_CTRL3_REG: GFSK_GAIN_OFFSET (Bit 0)         */
#define PLLDIG_RF_MGAIN_CTRL3_REG_GFSK_GAIN_OFFSET_Msk (0xffUL)         /*!< PLLDIG RF_MGAIN_CTRL3_REG: GFSK_GAIN_OFFSET (Bitfield-Mask: 0xff) */

/* -------------------------  PLLDIG_RF_VCO_FREQ_EST_REG  ------------------------- */
#define PLLDIG_RF_VCO_FREQ_EST_REG_VCO_FREQ_EST_EN_Pos (0UL)            /*!< PLLDIG RF_VCO_FREQ_EST_REG: VCO_FREQ_EST_EN (Bit 0)         */
#define PLLDIG_RF_VCO_FREQ_EST_REG_VCO_FREQ_EST_EN_Msk (0x1UL)          /*!< PLLDIG RF_VCO_FREQ_EST_REG: VCO_FREQ_EST_EN (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_VCO_FREQ_EST_REG_VCO_FREQ_EST_LEN_Pos (1UL)           /*!< PLLDIG RF_VCO_FREQ_EST_REG: VCO_FREQ_EST_LEN (Bit 1)        */
#define PLLDIG_RF_VCO_FREQ_EST_REG_VCO_FREQ_EST_LEN_Msk (0xfeUL)        /*!< PLLDIG RF_VCO_FREQ_EST_REG: VCO_FREQ_EST_LEN (Bitfield-Mask: 0x7f) */
#define PLLDIG_RF_VCO_FREQ_EST_REG_VCO_FREQ_EST_UPPER_RD_Pos (8UL)      /*!< PLLDIG RF_VCO_FREQ_EST_REG: VCO_FREQ_EST_UPPER_RD (Bit 8)   */
#define PLLDIG_RF_VCO_FREQ_EST_REG_VCO_FREQ_EST_UPPER_RD_Msk (0x700UL)  /*!< PLLDIG RF_VCO_FREQ_EST_REG: VCO_FREQ_EST_UPPER_RD (Bitfield-Mask: 0x07) */

/* --------------------------  PLLDIG_RF_SYNTH_SPARE_REG  ------------------------- */
#define PLLDIG_RF_SYNTH_SPARE_REG_SPARE_Pos   (0UL)                     /*!< PLLDIG RF_SYNTH_SPARE_REG: SPARE (Bit 0)                    */
#define PLLDIG_RF_SYNTH_SPARE_REG_SPARE_Msk   (0xffUL)                  /*!< PLLDIG RF_SYNTH_SPARE_REG: SPARE (Bitfield-Mask: 0xff)      */

/* -------------------------  PLLDIG_RF_MSKMOD_CTRL1_REG  ------------------------- */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_DATA_Pos (0UL)                    /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_DATA (Bit 0)                 */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_DATA_Msk (0xfUL)                  /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_DATA (Bitfield-Mask: 0x0f)   */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_VALID_Pos (4UL)                   /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_VALID (Bit 4)                */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_VALID_Msk (0x10UL)                /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_VALID (Bitfield-Mask: 0x01)  */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_MSK_TX_SEL_Pos (5UL)                 /*!< PLLDIG RF_MSKMOD_CTRL1_REG: MSK_TX_SEL (Bit 5)              */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_MSK_TX_SEL_Msk (0x20UL)              /*!< PLLDIG RF_MSKMOD_CTRL1_REG: MSK_TX_SEL (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_MSK_ALW_EN_Pos (6UL)                 /*!< PLLDIG RF_MSKMOD_CTRL1_REG: MSK_ALW_EN (Bit 6)              */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_MSK_ALW_EN_Msk (0x40UL)              /*!< PLLDIG RF_MSKMOD_CTRL1_REG: MSK_ALW_EN (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_MOD_FROM_GPIO_Pos (7UL)           /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_MOD_FROM_GPIO (Bit 7)        */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_MOD_FROM_GPIO_Msk (0x80UL)        /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_MOD_FROM_GPIO (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_MSK_BYPASS_PHASE_Pos (8UL)           /*!< PLLDIG RF_MSKMOD_CTRL1_REG: MSK_BYPASS_PHASE (Bit 8)        */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_MSK_BYPASS_PHASE_Msk (0x100UL)       /*!< PLLDIG RF_MSKMOD_CTRL1_REG: MSK_BYPASS_PHASE (Bitfield-Mask: 0x01) */

/* -------------------------  PLLDIG_RF_MSKMOD_CHIPL_REG  ------------------------- */
#define PLLDIG_RF_MSKMOD_CHIPL_REG_MSK_CHIPL_Pos (0UL)                  /*!< PLLDIG RF_MSKMOD_CHIPL_REG: MSK_CHIPL (Bit 0)               */
#define PLLDIG_RF_MSKMOD_CHIPL_REG_MSK_CHIPL_Msk (0xffffUL)             /*!< PLLDIG RF_MSKMOD_CHIPL_REG: MSK_CHIPL (Bitfield-Mask: 0xffff) */

/* -------------------------  PLLDIG_RF_MSKMOD_CHIPH_REG  ------------------------- */
#define PLLDIG_RF_MSKMOD_CHIPH_REG_MSK_CHIPH_Pos (0UL)                  /*!< PLLDIG RF_MSKMOD_CHIPH_REG: MSK_CHIPH (Bit 0)               */
#define PLLDIG_RF_MSKMOD_CHIPH_REG_MSK_CHIPH_Msk (0xffffUL)             /*!< PLLDIG RF_MSKMOD_CHIPH_REG: MSK_CHIPH (Bitfield-Mask: 0xffff) */

/* --------------------------  PLLDIG_RF_TXDAC_TEST_REG  -------------------------- */
#define PLLDIG_RF_TXDAC_TEST_REG_RF_TXDAC_TEST_WR_Pos (0UL)             /*!< PLLDIG RF_TXDAC_TEST_REG: RF_TXDAC_TEST_WR (Bit 0)          */
#define PLLDIG_RF_TXDAC_TEST_REG_RF_TXDAC_TEST_WR_Msk (0xffUL)          /*!< PLLDIG RF_TXDAC_TEST_REG: RF_TXDAC_TEST_WR (Bitfield-Mask: 0xff) */
#define PLLDIG_RF_TXDAC_TEST_REG_RF_TXDAC_TEST_SEL_Pos (8UL)            /*!< PLLDIG RF_TXDAC_TEST_REG: RF_TXDAC_TEST_SEL (Bit 8)         */
#define PLLDIG_RF_TXDAC_TEST_REG_RF_TXDAC_TEST_SEL_Msk (0x100UL)        /*!< PLLDIG RF_TXDAC_TEST_REG: RF_TXDAC_TEST_SEL (Bitfield-Mask: 0x01) */

/* ------------------------  PLLDIG_RF_MGAIN_COMP_VAL0_REG  ----------------------- */
#define PLLDIG_RF_MGAIN_COMP_VAL0_REG_MGAIN_COMP_VAL_Pos (0UL)          /*!< PLLDIG RF_MGAIN_COMP_VAL0_REG: MGAIN_COMP_VAL (Bit 0)       */
#define PLLDIG_RF_MGAIN_COMP_VAL0_REG_MGAIN_COMP_VAL_Msk (0x1fUL)       /*!< PLLDIG RF_MGAIN_COMP_VAL0_REG: MGAIN_COMP_VAL (Bitfield-Mask: 0x1f) */

