openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* ----------------------------  RFCU_RF_ADC_CTRL3_REG  --------------------------- */
#define RFCU_RF_ADC_CTRL3_REG_ADC_OFFP_Q_WR_Pos (0UL)                   /*!< RFCU RF_ADC_CTRL3_REG: ADC_OFFP_Q_WR (Bit 0)                */
#define RFCU_RF_ADC_CTRL3_REG_ADC_OFFP_Q_WR_Msk (0xffUL)                /*!< RFCU RF_ADC_CTRL3_REG: ADC_OFFP_Q_WR (Bitfield-Mask: 0xff)  */
#define RFCU_RF_ADC_CTRL3_REG_ADC_OFFN_Q_WR_Pos (8UL)                   /*!< RFCU RF_ADC_CTRL3_REG: ADC_OFFN_Q_WR (Bit 8)                */
#define RFCU_RF_ADC_CTRL3_REG_ADC_OFFN_Q_WR_Msk (0xff00UL)              /*!< RFCU RF_ADC_CTRL3_REG: ADC_OFFN_Q_WR (Bitfield-Mask: 0xff)  */

/* -----------------------------  RFCU_RF_PA_CTRL_REG  ---------------------------- */
#define RFCU_RF_PA_CTRL_REG_PA_RAMPSPEED_DOWN_Pos (5UL)                 /*!< RFCU RF_PA_CTRL_REG: PA_RAMPSPEED_DOWN (Bit 5)              */
#define RFCU_RF_PA_CTRL_REG_PA_RAMPSPEED_DOWN_Msk (0x60UL)              /*!< RFCU RF_PA_CTRL_REG: PA_RAMPSPEED_DOWN (Bitfield-Mask: 0x03) */
#define RFCU_RF_PA_CTRL_REG_PA_RAMPSPEED_UP_Pos (7UL)                   /*!< RFCU RF_PA_CTRL_REG: PA_RAMPSPEED_UP (Bit 7)                */
#define RFCU_RF_PA_CTRL_REG_PA_RAMPSPEED_UP_Msk (0x180UL)               /*!< RFCU RF_PA_CTRL_REG: PA_RAMPSPEED_UP (Bitfield-Mask: 0x03)  */
#define RFCU_RF_PA_CTRL_REG_PA_FAST_DISCHARGE_EN_Pos (9UL)              /*!< RFCU RF_PA_CTRL_REG: PA_FAST_DISCHARGE_EN (Bit 9)           */
#define RFCU_RF_PA_CTRL_REG_PA_FAST_DISCHARGE_EN_Msk (0x200UL)          /*!< RFCU RF_PA_CTRL_REG: PA_FAST_DISCHARGE_EN (Bitfield-Mask: 0x01) */
#define RFCU_RF_PA_CTRL_REG_LEVEL_LDO_RFPA_Pos (11UL)                   /*!< RFCU RF_PA_CTRL_REG: LEVEL_LDO_RFPA (Bit 11)                */
#define RFCU_RF_PA_CTRL_REG_LEVEL_LDO_RFPA_Msk (0x7800UL)               /*!< RFCU RF_PA_CTRL_REG: LEVEL_LDO_RFPA (Bitfield-Mask: 0x0f)   */

/* ----------------------------  RFCU_RF_MGC_CTRL_REG  ---------------------------- */
#define RFCU_RF_MGC_CTRL_REG_MGC_GAIN_SET_Pos (0UL)                     /*!< RFCU RF_MGC_CTRL_REG: MGC_GAIN_SET (Bit 0)                  */
#define RFCU_RF_MGC_CTRL_REG_MGC_GAIN_SET_Msk (0x1UL)                   /*!< RFCU RF_MGC_CTRL_REG: MGC_GAIN_SET (Bitfield-Mask: 0x01)    */
#define RFCU_RF_MGC_CTRL_REG_MGC_POLE_SW_Pos  (1UL)                     /*!< RFCU RF_MGC_CTRL_REG: MGC_POLE_SW (Bit 1)                   */
#define RFCU_RF_MGC_CTRL_REG_MGC_POLE_SW_Msk  (0x2UL)                   /*!< RFCU RF_MGC_CTRL_REG: MGC_POLE_SW (Bitfield-Mask: 0x01)     */
#define RFCU_RF_MGC_CTRL_REG_GAUSS_DAC_CTRL_Pos (2UL)                   /*!< RFCU RF_MGC_CTRL_REG: GAUSS_DAC_CTRL (Bit 2)                */
#define RFCU_RF_MGC_CTRL_REG_GAUSS_DAC_CTRL_Msk (0xcUL)                 /*!< RFCU RF_MGC_CTRL_REG: GAUSS_DAC_CTRL (Bitfield-Mask: 0x03)  */

/* ---------------------------  RFCU_RF_VCOVAR_CTRL_REG  -------------------------- */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V0_Pos (0UL)                   /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V0 (Bit 0)                */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V0_Msk (0x7UL)                 /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V0 (Bitfield-Mask: 0x07)  */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V1_Pos (3UL)                   /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V1 (Bit 3)                */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V1_Msk (0x38UL)                /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V1 (Bitfield-Mask: 0x07)  */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V2_Pos (6UL)                   /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V2 (Bit 6)                */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V2_Msk (0x1c0UL)               /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V2 (Bitfield-Mask: 0x07)  */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V3_Pos (9UL)                   /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V3 (Bit 9)                */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V3_Msk (0xe00UL)               /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V3 (Bitfield-Mask: 0x07)  */
#define RFCU_RF_VCOVAR_CTRL_REG_MOD_VAR_V0_Pos (12UL)                   /*!< RFCU RF_VCOVAR_CTRL_REG: MOD_VAR_V0 (Bit 12)                */
#define RFCU_RF_VCOVAR_CTRL_REG_MOD_VAR_V0_Msk (0x3000UL)               /*!< RFCU RF_VCOVAR_CTRL_REG: MOD_VAR_V0 (Bitfield-Mask: 0x03)   */
#define RFCU_RF_VCOVAR_CTRL_REG_MOD_VAR_V1_Pos (14UL)                   /*!< RFCU RF_VCOVAR_CTRL_REG: MOD_VAR_V1 (Bit 14)                */
#define RFCU_RF_VCOVAR_CTRL_REG_MOD_VAR_V1_Msk (0xc000UL)               /*!< RFCU RF_VCOVAR_CTRL_REG: MOD_VAR_V1 (Bitfield-Mask: 0x03)   */

/* ----------------------------  RFCU_RF_PFD_CTRL_REG  ---------------------------- */
#define RFCU_RF_PFD_CTRL_REG_FIXED_CUR_SET_Pos (0UL)                    /*!< RFCU RF_PFD_CTRL_REG: FIXED_CUR_SET (Bit 0)                 */
#define RFCU_RF_PFD_CTRL_REG_FIXED_CUR_SET_Msk (0x3UL)                  /*!< RFCU RF_PFD_CTRL_REG: FIXED_CUR_SET (Bitfield-Mask: 0x03)   */
#define RFCU_RF_PFD_CTRL_REG_FIXED_CUR_EN_Pos (2UL)                     /*!< RFCU RF_PFD_CTRL_REG: FIXED_CUR_EN (Bit 2)                  */
#define RFCU_RF_PFD_CTRL_REG_FIXED_CUR_EN_Msk (0x4UL)                   /*!< RFCU RF_PFD_CTRL_REG: FIXED_CUR_EN (Bitfield-Mask: 0x01)    */
#define RFCU_RF_PFD_CTRL_REG_PFD_POLARITY_Pos (3UL)                     /*!< RFCU RF_PFD_CTRL_REG: PFD_POLARITY (Bit 3)                  */
#define RFCU_RF_PFD_CTRL_REG_PFD_POLARITY_Msk (0x8UL)                   /*!< RFCU RF_PFD_CTRL_REG: PFD_POLARITY (Bitfield-Mask: 0x01)    */

/* ---------------------------  RFCU_RF_CP_CTRL_BLE_REG  -------------------------- */
#define RFCU_RF_CP_CTRL_BLE_REG_CP_CUR_SET_BLE_RX_Pos (0UL)             /*!< RFCU RF_CP_CTRL_BLE_REG: CP_CUR_SET_BLE_RX (Bit 0)          */
#define RFCU_RF_CP_CTRL_BLE_REG_CP_CUR_SET_BLE_RX_Msk (0xfUL)           /*!< RFCU RF_CP_CTRL_BLE_REG: CP_CUR_SET_BLE_RX (Bitfield-Mask: 0x0f) */
#define RFCU_RF_CP_CTRL_BLE_REG_CP_CUR_SET_BLE_TX_Pos (4UL)             /*!< RFCU RF_CP_CTRL_BLE_REG: CP_CUR_SET_BLE_TX (Bit 4)          */
#define RFCU_RF_CP_CTRL_BLE_REG_CP_CUR_SET_BLE_TX_Msk (0xf0UL)          /*!< RFCU RF_CP_CTRL_BLE_REG: CP_CUR_SET_BLE_TX (Bitfield-Mask: 0x0f) */
#define RFCU_RF_CP_CTRL_BLE_REG_CP_CUR_BLE_RX_Pos (8UL)                 /*!< RFCU RF_CP_CTRL_BLE_REG: CP_CUR_BLE_RX (Bit 8)              */
#define RFCU_RF_CP_CTRL_BLE_REG_CP_CUR_BLE_RX_Msk (0xf00UL)             /*!< RFCU RF_CP_CTRL_BLE_REG: CP_CUR_BLE_RX (Bitfield-Mask: 0x0f) */
#define RFCU_RF_CP_CTRL_BLE_REG_CP_CUR_BLE_TX_Pos (12UL)                /*!< RFCU RF_CP_CTRL_BLE_REG: CP_CUR_BLE_TX (Bit 12)             */
#define RFCU_RF_CP_CTRL_BLE_REG_CP_CUR_BLE_TX_Msk (0xf000UL)            /*!< RFCU RF_CP_CTRL_BLE_REG: CP_CUR_BLE_TX (Bitfield-Mask: 0x0f) */

