openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* ----------------------------  SPI_SPI_CLEAR_INT_REG  --------------------------- */
#define SPI_SPI_CLEAR_INT_REG_SPI_CLEAR_INT_Pos (0UL)                   /*!< SPI SPI_CLEAR_INT_REG: SPI_CLEAR_INT (Bit 0)                */
#define SPI_SPI_CLEAR_INT_REG_SPI_CLEAR_INT_Msk (0xffffUL)              /*!< SPI SPI_CLEAR_INT_REG: SPI_CLEAR_INT (Bitfield-Mask: 0xffff) */

/* ------------------------------  SPI_SPI_CTRL_REG1  ----------------------------- */
#define SPI_SPI_CTRL_REG1_SPI_FIFO_MODE_Pos   (0UL)                     /*!< SPI SPI_CTRL_REG1: SPI_FIFO_MODE (Bit 0)                    */
#define SPI_SPI_CTRL_REG1_SPI_FIFO_MODE_Msk   (0x3UL)                   /*!< SPI SPI_CTRL_REG1: SPI_FIFO_MODE (Bitfield-Mask: 0x03)      */
#define SPI_SPI_CTRL_REG1_SPI_PRIORITY_Pos    (2UL)                     /*!< SPI SPI_CTRL_REG1: SPI_PRIORITY (Bit 2)                     */
#define SPI_SPI_CTRL_REG1_SPI_PRIORITY_Msk    (0x4UL)                   /*!< SPI SPI_CTRL_REG1: SPI_PRIORITY (Bitfield-Mask: 0x01)       */
#define SPI_SPI_CTRL_REG1_SPI_BUSY_Pos        (3UL)                     /*!< SPI SPI_CTRL_REG1: SPI_BUSY (Bit 3)                         */
#define SPI_SPI_CTRL_REG1_SPI_BUSY_Msk        (0x8UL)                   /*!< SPI SPI_CTRL_REG1: SPI_BUSY (Bitfield-Mask: 0x01)           */
#define SPI_SPI_CTRL_REG1_SPI_9BIT_VAL_Pos    (4UL)                     /*!< SPI SPI_CTRL_REG1: SPI_9BIT_VAL (Bit 4)                     */
#define SPI_SPI_CTRL_REG1_SPI_9BIT_VAL_Msk    (0x10UL)                  /*!< SPI SPI_CTRL_REG1: SPI_9BIT_VAL (Bitfield-Mask: 0x01)       */


/* ================================================================================ */
/* ================          struct 'SPI2' Position & Mask         ================ */
/* ================================================================================ */


/* -----------------------------  SPI2_SPI2_CTRL_REG  ----------------------------- */
#define SPI2_SPI2_CTRL_REG_SPI_ON_Pos         (0UL)                     /*!< SPI2 SPI2_CTRL_REG: SPI_ON (Bit 0)                          */
#define SPI2_SPI2_CTRL_REG_SPI_ON_Msk         (0x1UL)                   /*!< SPI2 SPI2_CTRL_REG: SPI_ON (Bitfield-Mask: 0x01)            */
#define SPI2_SPI2_CTRL_REG_SPI_PHA_Pos        (1UL)                     /*!< SPI2 SPI2_CTRL_REG: SPI_PHA (Bit 1)                         */
#define SPI2_SPI2_CTRL_REG_SPI_PHA_Msk        (0x2UL)                   /*!< SPI2 SPI2_CTRL_REG: SPI_PHA (Bitfield-Mask: 0x01)           */
#define SPI2_SPI2_CTRL_REG_SPI_POL_Pos        (2UL)                     /*!< SPI2 SPI2_CTRL_REG: SPI_POL (Bit 2)                         */
#define SPI2_SPI2_CTRL_REG_SPI_POL_Msk        (0x4UL)                   /*!< SPI2 SPI2_CTRL_REG: SPI_POL (Bitfield-Mask: 0x01)           */
#define SPI2_SPI2_CTRL_REG_SPI_CLK_Pos        (3UL)                     /*!< SPI2 SPI2_CTRL_REG: SPI_CLK (Bit 3)                         */
#define SPI2_SPI2_CTRL_REG_SPI_CLK_Msk        (0x18UL)                  /*!< SPI2 SPI2_CTRL_REG: SPI_CLK (Bitfield-Mask: 0x03)           */
#define SPI2_SPI2_CTRL_REG_SPI_DO_Pos         (5UL)                     /*!< SPI2 SPI2_CTRL_REG: SPI_DO (Bit 5)                          */
#define SPI2_SPI2_CTRL_REG_SPI_DO_Msk         (0x20UL)                  /*!< SPI2 SPI2_CTRL_REG: SPI_DO (Bitfield-Mask: 0x01)            */
#define SPI2_SPI2_CTRL_REG_SPI_SMN_Pos        (6UL)                     /*!< SPI2 SPI2_CTRL_REG: SPI_SMN (Bit 6)                         */
#define SPI2_SPI2_CTRL_REG_SPI_SMN_Msk        (0x40UL)                  /*!< SPI2 SPI2_CTRL_REG: SPI_SMN (Bitfield-Mask: 0x01)           */
#define SPI2_SPI2_CTRL_REG_SPI_WORD_Pos       (7UL)                     /*!< SPI2 SPI2_CTRL_REG: SPI_WORD (Bit 7)                        */
#define SPI2_SPI2_CTRL_REG_SPI_WORD_Msk       (0x180UL)                 /*!< SPI2 SPI2_CTRL_REG: SPI_WORD (Bitfield-Mask: 0x03)          */
#define SPI2_SPI2_CTRL_REG_SPI_RST_Pos        (9UL)                     /*!< SPI2 SPI2_CTRL_REG: SPI_RST (Bit 9)                         */
#define SPI2_SPI2_CTRL_REG_SPI_RST_Msk        (0x200UL)                 /*!< SPI2 SPI2_CTRL_REG: SPI_RST (Bitfield-Mask: 0x01)           */
#define SPI2_SPI2_CTRL_REG_SPI_FORCE_DO_Pos   (10UL)                    /*!< SPI2 SPI2_CTRL_REG: SPI_FORCE_DO (Bit 10)                   */
#define SPI2_SPI2_CTRL_REG_SPI_FORCE_DO_Msk   (0x400UL)                 /*!< SPI2 SPI2_CTRL_REG: SPI_FORCE_DO (Bitfield-Mask: 0x01)      */
#define SPI2_SPI2_CTRL_REG_SPI_TXH_Pos        (11UL)                    /*!< SPI2 SPI2_CTRL_REG: SPI_TXH (Bit 11)                        */
#define SPI2_SPI2_CTRL_REG_SPI_TXH_Msk        (0x800UL)                 /*!< SPI2 SPI2_CTRL_REG: SPI_TXH (Bitfield-Mask: 0x01)           */
#define SPI2_SPI2_CTRL_REG_SPI_DI_Pos         (12UL)                    /*!< SPI2 SPI2_CTRL_REG: SPI_DI (Bit 12)                         */
#define SPI2_SPI2_CTRL_REG_SPI_DI_Msk         (0x1000UL)                /*!< SPI2 SPI2_CTRL_REG: SPI_DI (Bitfield-Mask: 0x01)            */
#define SPI2_SPI2_CTRL_REG_SPI_INT_BIT_Pos    (13UL)                    /*!< SPI2 SPI2_CTRL_REG: SPI_INT_BIT (Bit 13)                    */
#define SPI2_SPI2_CTRL_REG_SPI_INT_BIT_Msk    (0x2000UL)                /*!< SPI2 SPI2_CTRL_REG: SPI_INT_BIT (Bitfield-Mask: 0x01)       */
#define SPI2_SPI2_CTRL_REG_SPI_MINT_Pos       (14UL)                    /*!< SPI2 SPI2_CTRL_REG: SPI_MINT (Bit 14)                       */
#define SPI2_SPI2_CTRL_REG_SPI_MINT_Msk       (0x4000UL)                /*!< SPI2 SPI2_CTRL_REG: SPI_MINT (Bitfield-Mask: 0x01)          */
#define SPI2_SPI2_CTRL_REG_SPI_EN_CTRL_Pos    (15UL)                    /*!< SPI2 SPI2_CTRL_REG: SPI_EN_CTRL (Bit 15)                    */
#define SPI2_SPI2_CTRL_REG_SPI_EN_CTRL_Msk    (0x8000UL)                /*!< SPI2 SPI2_CTRL_REG: SPI_EN_CTRL (Bitfield-Mask: 0x01)       */

/* ----------------------------  SPI2_SPI2_RX_TX_REG0  ---------------------------- */
#define SPI2_SPI2_RX_TX_REG0_SPI_DATA0_Pos    (0UL)                     /*!< SPI2 SPI2_RX_TX_REG0: SPI_DATA0 (Bit 0)                     */
#define SPI2_SPI2_RX_TX_REG0_SPI_DATA0_Msk    (0xffffUL)                /*!< SPI2 SPI2_RX_TX_REG0: SPI_DATA0 (Bitfield-Mask: 0xffff)     */

/* ----------------------------  SPI2_SPI2_RX_TX_REG1  ---------------------------- */
#define SPI2_SPI2_RX_TX_REG1_SPI_DATA1_Pos    (0UL)                     /*!< SPI2 SPI2_RX_TX_REG1: SPI_DATA1 (Bit 0)                     */
#define SPI2_SPI2_RX_TX_REG1_SPI_DATA1_Msk    (0xffffUL)                /*!< SPI2 SPI2_RX_TX_REG1: SPI_DATA1 (Bitfield-Mask: 0xffff)     */

/* ---------------------------  SPI2_SPI2_CLEAR_INT_REG  -------------------------- */
#define SPI2_SPI2_CLEAR_INT_REG_SPI_CLEAR_INT_Pos (0UL)                 /*!< SPI2 SPI2_CLEAR_INT_REG: SPI_CLEAR_INT (Bit 0)              */
#define SPI2_SPI2_CLEAR_INT_REG_SPI_CLEAR_INT_Msk (0xffffUL)            /*!< SPI2 SPI2_CLEAR_INT_REG: SPI_CLEAR_INT (Bitfield-Mask: 0xffff) */

/* -----------------------------  SPI2_SPI2_CTRL_REG1  ---------------------------- */
#define SPI2_SPI2_CTRL_REG1_SPI_FIFO_MODE_Pos (0UL)                     /*!< SPI2 SPI2_CTRL_REG1: SPI_FIFO_MODE (Bit 0)                  */
#define SPI2_SPI2_CTRL_REG1_SPI_FIFO_MODE_Msk (0x3UL)                   /*!< SPI2 SPI2_CTRL_REG1: SPI_FIFO_MODE (Bitfield-Mask: 0x03)    */
#define SPI2_SPI2_CTRL_REG1_SPI_PRIORITY_Pos  (2UL)                     /*!< SPI2 SPI2_CTRL_REG1: SPI_PRIORITY (Bit 2)                   */
#define SPI2_SPI2_CTRL_REG1_SPI_PRIORITY_Msk  (0x4UL)                   /*!< SPI2 SPI2_CTRL_REG1: SPI_PRIORITY (Bitfield-Mask: 0x01)     */
#define SPI2_SPI2_CTRL_REG1_SPI_BUSY_Pos      (3UL)                     /*!< SPI2 SPI2_CTRL_REG1: SPI_BUSY (Bit 3)                       */
#define SPI2_SPI2_CTRL_REG1_SPI_BUSY_Msk      (0x8UL)                   /*!< SPI2 SPI2_CTRL_REG1: SPI_BUSY (Bitfield-Mask: 0x01)         */
#define SPI2_SPI2_CTRL_REG1_SPI_9BIT_VAL_Pos  (4UL)                     /*!< SPI2 SPI2_CTRL_REG1: SPI_9BIT_VAL (Bit 4)                   */
#define SPI2_SPI2_CTRL_REG1_SPI_9BIT_VAL_Msk  (0x10UL)                  /*!< SPI2 SPI2_CTRL_REG1: SPI_9BIT_VAL (Bitfield-Mask: 0x01)     */


/* ================================================================================ */
/* ================         struct 'TIMER1' Position & Mask        ================ */
/* ================================================================================ */


