openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* ------------------------------  USB_USB_FWMSK_REG  ----------------------------- */
#define USB_USB_FWMSK_REG_USB_M_TXWARN31_Pos  (0UL)                     /*!< USB USB_FWMSK_REG: USB_M_TXWARN31 (Bit 0)                   */
#define USB_USB_FWMSK_REG_USB_M_TXWARN31_Msk  (0x7UL)                   /*!< USB USB_FWMSK_REG: USB_M_TXWARN31 (Bitfield-Mask: 0x07)     */
#define USB_USB_FWMSK_REG_USB_M_RXWARN31_Pos  (4UL)                     /*!< USB USB_FWMSK_REG: USB_M_RXWARN31 (Bit 4)                   */
#define USB_USB_FWMSK_REG_USB_M_RXWARN31_Msk  (0x70UL)                  /*!< USB USB_FWMSK_REG: USB_M_RXWARN31 (Bitfield-Mask: 0x07)     */

/* -------------------------------  USB_USB_FNH_REG  ------------------------------ */
#define USB_USB_FNH_REG_USB_FN_10_8_Pos       (0UL)                     /*!< USB USB_FNH_REG: USB_FN_10_8 (Bit 0)                        */
#define USB_USB_FNH_REG_USB_FN_10_8_Msk       (0x7UL)                   /*!< USB USB_FNH_REG: USB_FN_10_8 (Bitfield-Mask: 0x07)          */
#define USB_USB_FNH_REG_USB_RFC_Pos           (5UL)                     /*!< USB USB_FNH_REG: USB_RFC (Bit 5)                            */
#define USB_USB_FNH_REG_USB_RFC_Msk           (0x20UL)                  /*!< USB USB_FNH_REG: USB_RFC (Bitfield-Mask: 0x01)              */
#define USB_USB_FNH_REG_USB_UL_Pos            (6UL)                     /*!< USB USB_FNH_REG: USB_UL (Bit 6)                             */
#define USB_USB_FNH_REG_USB_UL_Msk            (0x40UL)                  /*!< USB USB_FNH_REG: USB_UL (Bitfield-Mask: 0x01)               */
#define USB_USB_FNH_REG_USB_MF_Pos            (7UL)                     /*!< USB USB_FNH_REG: USB_MF (Bit 7)                             */
#define USB_USB_FNH_REG_USB_MF_Msk            (0x80UL)                  /*!< USB USB_FNH_REG: USB_MF (Bitfield-Mask: 0x01)               */

/* -------------------------------  USB_USB_FNL_REG  ------------------------------ */
#define USB_USB_FNL_REG_USB_FN_Pos            (0UL)                     /*!< USB USB_FNL_REG: USB_FN (Bit 0)                             */
#define USB_USB_FNL_REG_USB_FN_Msk            (0xffUL)                  /*!< USB USB_FNL_REG: USB_FN (Bitfield-Mask: 0xff)               */

/* -----------------------------  USB_USB_UX20CDR_REG  ---------------------------- */
#define USB_USB_UX20CDR_REG_RPU_SSPROTEN_Pos  (0UL)                     /*!< USB USB_UX20CDR_REG: RPU_SSPROTEN (Bit 0)                   */
#define USB_USB_UX20CDR_REG_RPU_SSPROTEN_Msk  (0x1UL)                   /*!< USB USB_UX20CDR_REG: RPU_SSPROTEN (Bitfield-Mask: 0x01)     */
#define USB_USB_UX20CDR_REG_RPU_RCDELAY_Pos   (1UL)                     /*!< USB USB_UX20CDR_REG: RPU_RCDELAY (Bit 1)                    */
#define USB_USB_UX20CDR_REG_RPU_RCDELAY_Msk   (0x2UL)                   /*!< USB USB_UX20CDR_REG: RPU_RCDELAY (Bitfield-Mask: 0x01)      */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW1DM_Pos (2UL)                    /*!< USB USB_UX20CDR_REG: RPU_TEST_SW1DM (Bit 2)                 */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW1DM_Msk (0x4UL)                  /*!< USB USB_UX20CDR_REG: RPU_TEST_SW1DM (Bitfield-Mask: 0x01)   */
#define USB_USB_UX20CDR_REG_RPU_TEST_EN_Pos   (4UL)                     /*!< USB USB_UX20CDR_REG: RPU_TEST_EN (Bit 4)                    */
#define USB_USB_UX20CDR_REG_RPU_TEST_EN_Msk   (0x10UL)                  /*!< USB USB_UX20CDR_REG: RPU_TEST_EN (Bitfield-Mask: 0x01)      */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW1_Pos  (5UL)                     /*!< USB USB_UX20CDR_REG: RPU_TEST_SW1 (Bit 5)                   */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW1_Msk  (0x20UL)                  /*!< USB USB_UX20CDR_REG: RPU_TEST_SW1 (Bitfield-Mask: 0x01)     */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW2_Pos  (6UL)                     /*!< USB USB_UX20CDR_REG: RPU_TEST_SW2 (Bit 6)                   */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW2_Msk  (0x40UL)                  /*!< USB USB_UX20CDR_REG: RPU_TEST_SW2 (Bitfield-Mask: 0x01)     */
#define USB_USB_UX20CDR_REG_RPU_TEST7_Pos     (7UL)                     /*!< USB USB_UX20CDR_REG: RPU_TEST7 (Bit 7)                      */
#define USB_USB_UX20CDR_REG_RPU_TEST7_Msk     (0x80UL)                  /*!< USB USB_UX20CDR_REG: RPU_TEST7 (Bitfield-Mask: 0x01)        */

/* ------------------------------  USB_USB_EPC0_REG  ------------------------------ */
#define USB_USB_EPC0_REG_USB_EP_Pos           (0UL)                     /*!< USB USB_EPC0_REG: USB_EP (Bit 0)                            */
#define USB_USB_EPC0_REG_USB_EP_Msk           (0xfUL)                   /*!< USB USB_EPC0_REG: USB_EP (Bitfield-Mask: 0x0f)              */
#define USB_USB_EPC0_REG_USB_DEF_Pos          (6UL)                     /*!< USB USB_EPC0_REG: USB_DEF (Bit 6)                           */
#define USB_USB_EPC0_REG_USB_DEF_Msk          (0x40UL)                  /*!< USB USB_EPC0_REG: USB_DEF (Bitfield-Mask: 0x01)             */
#define USB_USB_EPC0_REG_USB_STALL_Pos        (7UL)                     /*!< USB USB_EPC0_REG: USB_STALL (Bit 7)                         */
#define USB_USB_EPC0_REG_USB_STALL_Msk        (0x80UL)                  /*!< USB USB_EPC0_REG: USB_STALL (Bitfield-Mask: 0x01)           */

/* ------------------------------  USB_USB_TXD0_REG  ------------------------------ */
#define USB_USB_TXD0_REG_USB_TXFD_Pos         (0UL)                     /*!< USB USB_TXD0_REG: USB_TXFD (Bit 0)                          */
#define USB_USB_TXD0_REG_USB_TXFD_Msk         (0xffUL)                  /*!< USB USB_TXD0_REG: USB_TXFD (Bitfield-Mask: 0xff)            */

/* ------------------------------  USB_USB_TXS0_REG  ------------------------------ */
#define USB_USB_TXS0_REG_USB_TCOUNT_Pos       (0UL)                     /*!< USB USB_TXS0_REG: USB_TCOUNT (Bit 0)                        */
#define USB_USB_TXS0_REG_USB_TCOUNT_Msk       (0x1fUL)                  /*!< USB USB_TXS0_REG: USB_TCOUNT (Bitfield-Mask: 0x1f)          */
#define USB_USB_TXS0_REG_USB_TX_DONE_Pos      (5UL)                     /*!< USB USB_TXS0_REG: USB_TX_DONE (Bit 5)                       */
#define USB_USB_TXS0_REG_USB_TX_DONE_Msk      (0x20UL)                  /*!< USB USB_TXS0_REG: USB_TX_DONE (Bitfield-Mask: 0x01)         */
#define USB_USB_TXS0_REG_USB_ACK_STAT_Pos     (6UL)                     /*!< USB USB_TXS0_REG: USB_ACK_STAT (Bit 6)                      */
#define USB_USB_TXS0_REG_USB_ACK_STAT_Msk     (0x40UL)                  /*!< USB USB_TXS0_REG: USB_ACK_STAT (Bitfield-Mask: 0x01)        */

/* ------------------------------  USB_USB_TXC0_REG  ------------------------------ */
#define USB_USB_TXC0_REG_USB_TX_EN_Pos        (0UL)                     /*!< USB USB_TXC0_REG: USB_TX_EN (Bit 0)                         */
#define USB_USB_TXC0_REG_USB_TX_EN_Msk        (0x1UL)                   /*!< USB USB_TXC0_REG: USB_TX_EN (Bitfield-Mask: 0x01)           */
#define USB_USB_TXC0_REG_USB_TOGGLE_TX0_Pos   (2UL)                     /*!< USB USB_TXC0_REG: USB_TOGGLE_TX0 (Bit 2)                    */
#define USB_USB_TXC0_REG_USB_TOGGLE_TX0_Msk   (0x4UL)                   /*!< USB USB_TXC0_REG: USB_TOGGLE_TX0 (Bitfield-Mask: 0x01)      */
#define USB_USB_TXC0_REG_USB_FLUSH_Pos        (3UL)                     /*!< USB USB_TXC0_REG: USB_FLUSH (Bit 3)                         */
#define USB_USB_TXC0_REG_USB_FLUSH_Msk        (0x8UL)                   /*!< USB USB_TXC0_REG: USB_FLUSH (Bitfield-Mask: 0x01)           */
#define USB_USB_TXC0_REG_USB_IGN_IN_Pos       (4UL)                     /*!< USB USB_TXC0_REG: USB_IGN_IN (Bit 4)                        */
#define USB_USB_TXC0_REG_USB_IGN_IN_Msk       (0x10UL)                  /*!< USB USB_TXC0_REG: USB_IGN_IN (Bitfield-Mask: 0x01)          */

