openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* ------------------------------  USB_USB_EPC5_REG  ------------------------------ */
#define USB_USB_EPC5_REG_USB_EP_Pos           (0UL)                     /*!< USB USB_EPC5_REG: USB_EP (Bit 0)                            */
#define USB_USB_EPC5_REG_USB_EP_Msk           (0xfUL)                   /*!< USB USB_EPC5_REG: USB_EP (Bitfield-Mask: 0x0f)              */
#define USB_USB_EPC5_REG_USB_EP_EN_Pos        (4UL)                     /*!< USB USB_EPC5_REG: USB_EP_EN (Bit 4)                         */
#define USB_USB_EPC5_REG_USB_EP_EN_Msk        (0x10UL)                  /*!< USB USB_EPC5_REG: USB_EP_EN (Bitfield-Mask: 0x01)           */
#define USB_USB_EPC5_REG_USB_ISO_Pos          (5UL)                     /*!< USB USB_EPC5_REG: USB_ISO (Bit 5)                           */
#define USB_USB_EPC5_REG_USB_ISO_Msk          (0x20UL)                  /*!< USB USB_EPC5_REG: USB_ISO (Bitfield-Mask: 0x01)             */
#define USB_USB_EPC5_REG_USB_STALL_Pos        (7UL)                     /*!< USB USB_EPC5_REG: USB_STALL (Bit 7)                         */
#define USB_USB_EPC5_REG_USB_STALL_Msk        (0x80UL)                  /*!< USB USB_EPC5_REG: USB_STALL (Bitfield-Mask: 0x01)           */

/* ------------------------------  USB_USB_TXD3_REG  ------------------------------ */
#define USB_USB_TXD3_REG_USB_TXFD_Pos         (0UL)                     /*!< USB USB_TXD3_REG: USB_TXFD (Bit 0)                          */
#define USB_USB_TXD3_REG_USB_TXFD_Msk         (0xffUL)                  /*!< USB USB_TXD3_REG: USB_TXFD (Bitfield-Mask: 0xff)            */

/* ------------------------------  USB_USB_TXS3_REG  ------------------------------ */
#define USB_USB_TXS3_REG_USB_TCOUNT_Pos       (0UL)                     /*!< USB USB_TXS3_REG: USB_TCOUNT (Bit 0)                        */
#define USB_USB_TXS3_REG_USB_TCOUNT_Msk       (0x1fUL)                  /*!< USB USB_TXS3_REG: USB_TCOUNT (Bitfield-Mask: 0x1f)          */
#define USB_USB_TXS3_REG_USB_TX_DONE_Pos      (5UL)                     /*!< USB USB_TXS3_REG: USB_TX_DONE (Bit 5)                       */
#define USB_USB_TXS3_REG_USB_TX_DONE_Msk      (0x20UL)                  /*!< USB USB_TXS3_REG: USB_TX_DONE (Bitfield-Mask: 0x01)         */
#define USB_USB_TXS3_REG_USB_ACK_STAT_Pos     (6UL)                     /*!< USB USB_TXS3_REG: USB_ACK_STAT (Bit 6)                      */
#define USB_USB_TXS3_REG_USB_ACK_STAT_Msk     (0x40UL)                  /*!< USB USB_TXS3_REG: USB_ACK_STAT (Bitfield-Mask: 0x01)        */
#define USB_USB_TXS3_REG_USB_TX_URUN_Pos      (7UL)                     /*!< USB USB_TXS3_REG: USB_TX_URUN (Bit 7)                       */
#define USB_USB_TXS3_REG_USB_TX_URUN_Msk      (0x80UL)                  /*!< USB USB_TXS3_REG: USB_TX_URUN (Bitfield-Mask: 0x01)         */

/* ------------------------------  USB_USB_TXC3_REG  ------------------------------ */
#define USB_USB_TXC3_REG_USB_TX_EN_Pos        (0UL)                     /*!< USB USB_TXC3_REG: USB_TX_EN (Bit 0)                         */
#define USB_USB_TXC3_REG_USB_TX_EN_Msk        (0x1UL)                   /*!< USB USB_TXC3_REG: USB_TX_EN (Bitfield-Mask: 0x01)           */
#define USB_USB_TXC3_REG_USB_LAST_Pos         (1UL)                     /*!< USB USB_TXC3_REG: USB_LAST (Bit 1)                          */
#define USB_USB_TXC3_REG_USB_LAST_Msk         (0x2UL)                   /*!< USB USB_TXC3_REG: USB_LAST (Bitfield-Mask: 0x01)            */
#define USB_USB_TXC3_REG_USB_TOGGLE_TX_Pos    (2UL)                     /*!< USB USB_TXC3_REG: USB_TOGGLE_TX (Bit 2)                     */
#define USB_USB_TXC3_REG_USB_TOGGLE_TX_Msk    (0x4UL)                   /*!< USB USB_TXC3_REG: USB_TOGGLE_TX (Bitfield-Mask: 0x01)       */
#define USB_USB_TXC3_REG_USB_FLUSH_Pos        (3UL)                     /*!< USB USB_TXC3_REG: USB_FLUSH (Bit 3)                         */
#define USB_USB_TXC3_REG_USB_FLUSH_Msk        (0x8UL)                   /*!< USB USB_TXC3_REG: USB_FLUSH (Bitfield-Mask: 0x01)           */
#define USB_USB_TXC3_REG_USB_RFF_Pos          (4UL)                     /*!< USB USB_TXC3_REG: USB_RFF (Bit 4)                           */
#define USB_USB_TXC3_REG_USB_RFF_Msk          (0x10UL)                  /*!< USB USB_TXC3_REG: USB_RFF (Bitfield-Mask: 0x01)             */
#define USB_USB_TXC3_REG_USB_TFWL_Pos         (5UL)                     /*!< USB USB_TXC3_REG: USB_TFWL (Bit 5)                          */
#define USB_USB_TXC3_REG_USB_TFWL_Msk         (0x60UL)                  /*!< USB USB_TXC3_REG: USB_TFWL (Bitfield-Mask: 0x03)            */
#define USB_USB_TXC3_REG_USB_IGN_ISOMSK_Pos   (7UL)                     /*!< USB USB_TXC3_REG: USB_IGN_ISOMSK (Bit 7)                    */
#define USB_USB_TXC3_REG_USB_IGN_ISOMSK_Msk   (0x80UL)                  /*!< USB USB_TXC3_REG: USB_IGN_ISOMSK (Bitfield-Mask: 0x01)      */

/* ------------------------------  USB_USB_EPC6_REG  ------------------------------ */
#define USB_USB_EPC6_REG_USB_EP_Pos           (0UL)                     /*!< USB USB_EPC6_REG: USB_EP (Bit 0)                            */
#define USB_USB_EPC6_REG_USB_EP_Msk           (0xfUL)                   /*!< USB USB_EPC6_REG: USB_EP (Bitfield-Mask: 0x0f)              */
#define USB_USB_EPC6_REG_USB_EP_EN_Pos        (4UL)                     /*!< USB USB_EPC6_REG: USB_EP_EN (Bit 4)                         */
#define USB_USB_EPC6_REG_USB_EP_EN_Msk        (0x10UL)                  /*!< USB USB_EPC6_REG: USB_EP_EN (Bitfield-Mask: 0x01)           */
#define USB_USB_EPC6_REG_USB_ISO_Pos          (5UL)                     /*!< USB USB_EPC6_REG: USB_ISO (Bit 5)                           */
#define USB_USB_EPC6_REG_USB_ISO_Msk          (0x20UL)                  /*!< USB USB_EPC6_REG: USB_ISO (Bitfield-Mask: 0x01)             */
#define USB_USB_EPC6_REG_USB_STALL_Pos        (7UL)                     /*!< USB USB_EPC6_REG: USB_STALL (Bit 7)                         */
#define USB_USB_EPC6_REG_USB_STALL_Msk        (0x80UL)                  /*!< USB USB_EPC6_REG: USB_STALL (Bitfield-Mask: 0x01)           */

/* ------------------------------  USB_USB_RXD3_REG  ------------------------------ */
#define USB_USB_RXD3_REG_USB_RXFD_Pos         (0UL)                     /*!< USB USB_RXD3_REG: USB_RXFD (Bit 0)                          */
#define USB_USB_RXD3_REG_USB_RXFD_Msk         (0xffUL)                  /*!< USB USB_RXD3_REG: USB_RXFD (Bitfield-Mask: 0xff)            */

/* ------------------------------  USB_USB_RXS3_REG  ------------------------------ */
#define USB_USB_RXS3_REG_USB_RCOUNT_Pos       (0UL)                     /*!< USB USB_RXS3_REG: USB_RCOUNT (Bit 0)                        */
#define USB_USB_RXS3_REG_USB_RCOUNT_Msk       (0xfUL)                   /*!< USB USB_RXS3_REG: USB_RCOUNT (Bitfield-Mask: 0x0f)          */
#define USB_USB_RXS3_REG_USB_RX_LAST_Pos      (4UL)                     /*!< USB USB_RXS3_REG: USB_RX_LAST (Bit 4)                       */
#define USB_USB_RXS3_REG_USB_RX_LAST_Msk      (0x10UL)                  /*!< USB USB_RXS3_REG: USB_RX_LAST (Bitfield-Mask: 0x01)         */
#define USB_USB_RXS3_REG_USB_TOGGLE_RX_Pos    (5UL)                     /*!< USB USB_RXS3_REG: USB_TOGGLE_RX (Bit 5)                     */
#define USB_USB_RXS3_REG_USB_TOGGLE_RX_Msk    (0x20UL)                  /*!< USB USB_RXS3_REG: USB_TOGGLE_RX (Bitfield-Mask: 0x01)       */
#define USB_USB_RXS3_REG_USB_SETUP_Pos        (6UL)                     /*!< USB USB_RXS3_REG: USB_SETUP (Bit 6)                         */
#define USB_USB_RXS3_REG_USB_SETUP_Msk        (0x40UL)                  /*!< USB USB_RXS3_REG: USB_SETUP (Bitfield-Mask: 0x01)           */
#define USB_USB_RXS3_REG_USB_RX_ERR_Pos       (7UL)                     /*!< USB USB_RXS3_REG: USB_RX_ERR (Bit 7)                        */
#define USB_USB_RXS3_REG_USB_RX_ERR_Msk       (0x80UL)                  /*!< USB USB_RXS3_REG: USB_RX_ERR (Bitfield-Mask: 0x01)          */

/* ------------------------------  USB_USB_RXC3_REG  ------------------------------ */
#define USB_USB_RXC3_REG_USB_RX_EN_Pos        (0UL)                     /*!< USB USB_RXC3_REG: USB_RX_EN (Bit 0)                         */
#define USB_USB_RXC3_REG_USB_RX_EN_Msk        (0x1UL)                   /*!< USB USB_RXC3_REG: USB_RX_EN (Bitfield-Mask: 0x01)           */
#define USB_USB_RXC3_REG_USB_IGN_SETUP_Pos    (2UL)                     /*!< USB USB_RXC3_REG: USB_IGN_SETUP (Bit 2)                     */
#define USB_USB_RXC3_REG_USB_IGN_SETUP_Msk    (0x4UL)                   /*!< USB USB_RXC3_REG: USB_IGN_SETUP (Bitfield-Mask: 0x01)       */
#define USB_USB_RXC3_REG_USB_FLUSH_Pos        (3UL)                     /*!< USB USB_RXC3_REG: USB_FLUSH (Bit 3)                         */
#define USB_USB_RXC3_REG_USB_FLUSH_Msk        (0x8UL)                   /*!< USB USB_RXC3_REG: USB_FLUSH (Bitfield-Mask: 0x01)           */
#define USB_USB_RXC3_REG_USB_RFWL_Pos         (5UL)                     /*!< USB USB_RXC3_REG: USB_RFWL (Bit 5)                          */
#define USB_USB_RXC3_REG_USB_RFWL_Msk         (0x60UL)                  /*!< USB USB_RXC3_REG: USB_RFWL (Bitfield-Mask: 0x03)            */

/* ----------------------------  USB_USB_DMA_CTRL_REG  ---------------------------- */
#define USB_USB_DMA_CTRL_REG_USB_DMA_RX_Pos   (0UL)                     /*!< USB USB_DMA_CTRL_REG: USB_DMA_RX (Bit 0)                    */
#define USB_USB_DMA_CTRL_REG_USB_DMA_RX_Msk   (0x7UL)                   /*!< USB USB_DMA_CTRL_REG: USB_DMA_RX (Bitfield-Mask: 0x07)      */
#define USB_USB_DMA_CTRL_REG_USB_DMA_TX_Pos   (3UL)                     /*!< USB USB_DMA_CTRL_REG: USB_DMA_TX (Bit 3)                    */
#define USB_USB_DMA_CTRL_REG_USB_DMA_TX_Msk   (0x38UL)                  /*!< USB USB_DMA_CTRL_REG: USB_DMA_TX (Bitfield-Mask: 0x07)      */
#define USB_USB_DMA_CTRL_REG_USB_DMA_EN_Pos   (6UL)                     /*!< USB USB_DMA_CTRL_REG: USB_DMA_EN (Bit 6)                    */
#define USB_USB_DMA_CTRL_REG_USB_DMA_EN_Msk   (0x40UL)                  /*!< USB USB_DMA_CTRL_REG: USB_DMA_EN (Bitfield-Mask: 0x01)      */

/* --------------------------  USB_USB_CHARGER_CTRL_REG  -------------------------- */
#define USB_USB_CHARGER_CTRL_REG_USB_CHARGE_ON_Pos (0UL)                /*!< USB USB_CHARGER_CTRL_REG: USB_CHARGE_ON (Bit 0)             */
#define USB_USB_CHARGER_CTRL_REG_USB_CHARGE_ON_Msk (0x1UL)              /*!< USB USB_CHARGER_CTRL_REG: USB_CHARGE_ON (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_CTRL_REG_IDP_SRC_ON_Pos (1UL)                   /*!< USB USB_CHARGER_CTRL_REG: IDP_SRC_ON (Bit 1)                */
#define USB_USB_CHARGER_CTRL_REG_IDP_SRC_ON_Msk (0x2UL)                 /*!< USB USB_CHARGER_CTRL_REG: IDP_SRC_ON (Bitfield-Mask: 0x01)  */
#define USB_USB_CHARGER_CTRL_REG_VDP_SRC_ON_Pos (2UL)                   /*!< USB USB_CHARGER_CTRL_REG: VDP_SRC_ON (Bit 2)                */
#define USB_USB_CHARGER_CTRL_REG_VDP_SRC_ON_Msk (0x4UL)                 /*!< USB USB_CHARGER_CTRL_REG: VDP_SRC_ON (Bitfield-Mask: 0x01)  */
#define USB_USB_CHARGER_CTRL_REG_VDM_SRC_ON_Pos (3UL)                   /*!< USB USB_CHARGER_CTRL_REG: VDM_SRC_ON (Bit 3)                */
#define USB_USB_CHARGER_CTRL_REG_VDM_SRC_ON_Msk (0x8UL)                 /*!< USB USB_CHARGER_CTRL_REG: VDM_SRC_ON (Bitfield-Mask: 0x01)  */
#define USB_USB_CHARGER_CTRL_REG_IDP_SINK_ON_Pos (4UL)                  /*!< USB USB_CHARGER_CTRL_REG: IDP_SINK_ON (Bit 4)               */
#define USB_USB_CHARGER_CTRL_REG_IDP_SINK_ON_Msk (0x10UL)               /*!< USB USB_CHARGER_CTRL_REG: IDP_SINK_ON (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_CTRL_REG_IDM_SINK_ON_Pos (5UL)                  /*!< USB USB_CHARGER_CTRL_REG: IDM_SINK_ON (Bit 5)               */
#define USB_USB_CHARGER_CTRL_REG_IDM_SINK_ON_Msk (0x20UL)               /*!< USB USB_CHARGER_CTRL_REG: IDM_SINK_ON (Bitfield-Mask: 0x01) */

/* --------------------------  USB_USB_CHARGER_STAT_REG  -------------------------- */
#define USB_USB_CHARGER_STAT_REG_USB_DCP_DET_Pos (0UL)                  /*!< USB USB_CHARGER_STAT_REG: USB_DCP_DET (Bit 0)               */
#define USB_USB_CHARGER_STAT_REG_USB_DCP_DET_Msk (0x1UL)                /*!< USB USB_CHARGER_STAT_REG: USB_DCP_DET (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_STAT_REG_USB_CHG_DET_Pos (1UL)                  /*!< USB USB_CHARGER_STAT_REG: USB_CHG_DET (Bit 1)               */
#define USB_USB_CHARGER_STAT_REG_USB_CHG_DET_Msk (0x2UL)                /*!< USB USB_CHARGER_STAT_REG: USB_CHG_DET (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_STAT_REG_USB_DP_VAL_Pos (2UL)                   /*!< USB USB_CHARGER_STAT_REG: USB_DP_VAL (Bit 2)                */
#define USB_USB_CHARGER_STAT_REG_USB_DP_VAL_Msk (0x4UL)                 /*!< USB USB_CHARGER_STAT_REG: USB_DP_VAL (Bitfield-Mask: 0x01)  */
#define USB_USB_CHARGER_STAT_REG_USB_DM_VAL_Pos (3UL)                   /*!< USB USB_CHARGER_STAT_REG: USB_DM_VAL (Bit 3)                */
#define USB_USB_CHARGER_STAT_REG_USB_DM_VAL_Msk (0x8UL)                 /*!< USB USB_CHARGER_STAT_REG: USB_DM_VAL (Bitfield-Mask: 0x01)  */
#define USB_USB_CHARGER_STAT_REG_USB_DP_VAL2_Pos (4UL)                  /*!< USB USB_CHARGER_STAT_REG: USB_DP_VAL2 (Bit 4)               */
#define USB_USB_CHARGER_STAT_REG_USB_DP_VAL2_Msk (0x10UL)               /*!< USB USB_CHARGER_STAT_REG: USB_DP_VAL2 (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_STAT_REG_USB_DM_VAL2_Pos (5UL)                  /*!< USB USB_CHARGER_STAT_REG: USB_DM_VAL2 (Bit 5)               */
#define USB_USB_CHARGER_STAT_REG_USB_DM_VAL2_Msk (0x20UL)               /*!< USB USB_CHARGER_STAT_REG: USB_DM_VAL2 (Bitfield-Mask: 0x01) */


/* ================================================================================ */
/* ================         struct 'WAKEUP' Position & Mask        ================ */
/* ================================================================================ */


/* ----------------------------  WAKEUP_WKUP_CTRL_REG  ---------------------------- */
#define WAKEUP_WKUP_CTRL_REG_WKUP_DEB_VALUE_Pos (0UL)                   /*!< WAKEUP WKUP_CTRL_REG: WKUP_DEB_VALUE (Bit 0)                */
#define WAKEUP_WKUP_CTRL_REG_WKUP_DEB_VALUE_Msk (0x3fUL)                /*!< WAKEUP WKUP_CTRL_REG: WKUP_DEB_VALUE (Bitfield-Mask: 0x3f)  */
#define WAKEUP_WKUP_CTRL_REG_WKUP_SFT_KEYHIT_Pos (6UL)                  /*!< WAKEUP WKUP_CTRL_REG: WKUP_SFT_KEYHIT (Bit 6)               */
#define WAKEUP_WKUP_CTRL_REG_WKUP_SFT_KEYHIT_Msk (0x40UL)               /*!< WAKEUP WKUP_CTRL_REG: WKUP_SFT_KEYHIT (Bitfield-Mask: 0x01) */
#define WAKEUP_WKUP_CTRL_REG_WKUP_ENABLE_IRQ_Pos (7UL)                  /*!< WAKEUP WKUP_CTRL_REG: WKUP_ENABLE_IRQ (Bit 7)               */
#define WAKEUP_WKUP_CTRL_REG_WKUP_ENABLE_IRQ_Msk (0x80UL)               /*!< WAKEUP WKUP_CTRL_REG: WKUP_ENABLE_IRQ (Bitfield-Mask: 0x01) */

/* --------------------------  WAKEUP_WKUP_RESET_IRQ_REG  ------------------------- */
#define WAKEUP_WKUP_RESET_IRQ_REG_WKUP_IRQ_RST_Pos (0UL)                /*!< WAKEUP WKUP_RESET_IRQ_REG: WKUP_IRQ_RST (Bit 0)             */
#define WAKEUP_WKUP_RESET_IRQ_REG_WKUP_IRQ_RST_Msk (0xffffUL)           /*!< WAKEUP WKUP_RESET_IRQ_REG: WKUP_IRQ_RST (Bitfield-Mask: 0xffff) */

/* --------------------------  WAKEUP_WKUP_SELECT_P0_REG  ------------------------- */
#define WAKEUP_WKUP_SELECT_P0_REG_WKUP_SELECT_P0_Pos (0UL)              /*!< WAKEUP WKUP_SELECT_P0_REG: WKUP_SELECT_P0 (Bit 0)           */
#define WAKEUP_WKUP_SELECT_P0_REG_WKUP_SELECT_P0_Msk (0xffUL)           /*!< WAKEUP WKUP_SELECT_P0_REG: WKUP_SELECT_P0 (Bitfield-Mask: 0xff) */

/* --------------------------  WAKEUP_WKUP_SELECT_P1_REG  ------------------------- */
#define WAKEUP_WKUP_SELECT_P1_REG_WKUP_SELECT_P1_Pos (0UL)              /*!< WAKEUP WKUP_SELECT_P1_REG: WKUP_SELECT_P1 (Bit 0)           */
#define WAKEUP_WKUP_SELECT_P1_REG_WKUP_SELECT_P1_Msk (0xffUL)           /*!< WAKEUP WKUP_SELECT_P1_REG: WKUP_SELECT_P1 (Bitfield-Mask: 0xff) */

/* --------------------------  WAKEUP_WKUP_SELECT_P2_REG  ------------------------- */
#define WAKEUP_WKUP_SELECT_P2_REG_WKUP_SELECT_P2_Pos (0UL)              /*!< WAKEUP WKUP_SELECT_P2_REG: WKUP_SELECT_P2 (Bit 0)           */
#define WAKEUP_WKUP_SELECT_P2_REG_WKUP_SELECT_P2_Msk (0x1fUL)           /*!< WAKEUP WKUP_SELECT_P2_REG: WKUP_SELECT_P2 (Bitfield-Mask: 0x1f) */

/* --------------------------  WAKEUP_WKUP_SELECT_P3_REG  ------------------------- */
#define WAKEUP_WKUP_SELECT_P3_REG_WKUP_SELECT_P3_Pos (0UL)              /*!< WAKEUP WKUP_SELECT_P3_REG: WKUP_SELECT_P3 (Bit 0)           */
#define WAKEUP_WKUP_SELECT_P3_REG_WKUP_SELECT_P3_Msk (0xffUL)           /*!< WAKEUP WKUP_SELECT_P3_REG: WKUP_SELECT_P3 (Bitfield-Mask: 0xff) */

