openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BA.h
/* --------------------------  WAKEUP_WKUP_SELECT_P4_REG  ------------------------- */
#define WAKEUP_WKUP_SELECT_P4_REG_WKUP_SELECT_P4_Pos (0UL)              /*!< WAKEUP WKUP_SELECT_P4_REG: WKUP_SELECT_P4 (Bit 0)           */
#define WAKEUP_WKUP_SELECT_P4_REG_WKUP_SELECT_P4_Msk (0xffUL)           /*!< WAKEUP WKUP_SELECT_P4_REG: WKUP_SELECT_P4 (Bitfield-Mask: 0xff) */

/* ---------------------------  WAKEUP_WKUP_POL_P0_REG  --------------------------- */
#define WAKEUP_WKUP_POL_P0_REG_WKUP_POL_P0_Pos (0UL)                    /*!< WAKEUP WKUP_POL_P0_REG: WKUP_POL_P0 (Bit 0)                 */
#define WAKEUP_WKUP_POL_P0_REG_WKUP_POL_P0_Msk (0xffUL)                 /*!< WAKEUP WKUP_POL_P0_REG: WKUP_POL_P0 (Bitfield-Mask: 0xff)   */

/* ---------------------------  WAKEUP_WKUP_POL_P1_REG  --------------------------- */
#define WAKEUP_WKUP_POL_P1_REG_WKUP_POL_P1_Pos (0UL)                    /*!< WAKEUP WKUP_POL_P1_REG: WKUP_POL_P1 (Bit 0)                 */
#define WAKEUP_WKUP_POL_P1_REG_WKUP_POL_P1_Msk (0xffUL)                 /*!< WAKEUP WKUP_POL_P1_REG: WKUP_POL_P1 (Bitfield-Mask: 0xff)   */

/* ---------------------------  WAKEUP_WKUP_POL_P2_REG  --------------------------- */
#define WAKEUP_WKUP_POL_P2_REG_WKUP_POL_P2_Pos (0UL)                    /*!< WAKEUP WKUP_POL_P2_REG: WKUP_POL_P2 (Bit 0)                 */
#define WAKEUP_WKUP_POL_P2_REG_WKUP_POL_P2_Msk (0x1fUL)                 /*!< WAKEUP WKUP_POL_P2_REG: WKUP_POL_P2 (Bitfield-Mask: 0x1f)   */

/* ---------------------------  WAKEUP_WKUP_POL_P3_REG  --------------------------- */
#define WAKEUP_WKUP_POL_P3_REG_WKUP_POL_P3_Pos (0UL)                    /*!< WAKEUP WKUP_POL_P3_REG: WKUP_POL_P3 (Bit 0)                 */
#define WAKEUP_WKUP_POL_P3_REG_WKUP_POL_P3_Msk (0xffUL)                 /*!< WAKEUP WKUP_POL_P3_REG: WKUP_POL_P3 (Bitfield-Mask: 0xff)   */

/* ---------------------------  WAKEUP_WKUP_POL_P4_REG  --------------------------- */
#define WAKEUP_WKUP_POL_P4_REG_WKUP_POL_P4_Pos (0UL)                    /*!< WAKEUP WKUP_POL_P4_REG: WKUP_POL_P4 (Bit 0)                 */
#define WAKEUP_WKUP_POL_P4_REG_WKUP_POL_P4_Msk (0xffUL)                 /*!< WAKEUP WKUP_POL_P4_REG: WKUP_POL_P4 (Bitfield-Mask: 0xff)   */

/* --------------------------  WAKEUP_WKUP_STATUS_0_REG  -------------------------- */
#define WAKEUP_WKUP_STATUS_0_REG_WKUP_STAT_P0_Pos (0UL)                 /*!< WAKEUP WKUP_STATUS_0_REG: WKUP_STAT_P0 (Bit 0)              */
#define WAKEUP_WKUP_STATUS_0_REG_WKUP_STAT_P0_Msk (0xffUL)              /*!< WAKEUP WKUP_STATUS_0_REG: WKUP_STAT_P0 (Bitfield-Mask: 0xff) */
#define WAKEUP_WKUP_STATUS_0_REG_WKUP_STAT_P1_Pos (8UL)                 /*!< WAKEUP WKUP_STATUS_0_REG: WKUP_STAT_P1 (Bit 8)              */
#define WAKEUP_WKUP_STATUS_0_REG_WKUP_STAT_P1_Msk (0xff00UL)            /*!< WAKEUP WKUP_STATUS_0_REG: WKUP_STAT_P1 (Bitfield-Mask: 0xff) */

/* --------------------------  WAKEUP_WKUP_STATUS_1_REG  -------------------------- */
#define WAKEUP_WKUP_STATUS_1_REG_WKUP_STAT_P2_Pos (0UL)                 /*!< WAKEUP WKUP_STATUS_1_REG: WKUP_STAT_P2 (Bit 0)              */
#define WAKEUP_WKUP_STATUS_1_REG_WKUP_STAT_P2_Msk (0x1fUL)              /*!< WAKEUP WKUP_STATUS_1_REG: WKUP_STAT_P2 (Bitfield-Mask: 0x1f) */

/* --------------------------  WAKEUP_WKUP_STATUS_2_REG  -------------------------- */
#define WAKEUP_WKUP_STATUS_2_REG_WKUP_STAT_P3_Pos (0UL)                 /*!< WAKEUP WKUP_STATUS_2_REG: WKUP_STAT_P3 (Bit 0)              */
#define WAKEUP_WKUP_STATUS_2_REG_WKUP_STAT_P3_Msk (0xffUL)              /*!< WAKEUP WKUP_STATUS_2_REG: WKUP_STAT_P3 (Bitfield-Mask: 0xff) */
#define WAKEUP_WKUP_STATUS_2_REG_WKUP_STAT_P4_Pos (8UL)                 /*!< WAKEUP WKUP_STATUS_2_REG: WKUP_STAT_P4 (Bit 8)              */
#define WAKEUP_WKUP_STATUS_2_REG_WKUP_STAT_P4_Msk (0xff00UL)            /*!< WAKEUP WKUP_STATUS_2_REG: WKUP_STAT_P4 (Bitfield-Mask: 0xff) */

/* ---------------------------  WAKEUP_WKUP_CLEAR_0_REG  -------------------------- */
#define WAKEUP_WKUP_CLEAR_0_REG_WKUP_CLEAR_P0_Pos (0UL)                 /*!< WAKEUP WKUP_CLEAR_0_REG: WKUP_CLEAR_P0 (Bit 0)              */
#define WAKEUP_WKUP_CLEAR_0_REG_WKUP_CLEAR_P0_Msk (0xffUL)              /*!< WAKEUP WKUP_CLEAR_0_REG: WKUP_CLEAR_P0 (Bitfield-Mask: 0xff) */
#define WAKEUP_WKUP_CLEAR_0_REG_WKUP_CLEAR_P1_Pos (8UL)                 /*!< WAKEUP WKUP_CLEAR_0_REG: WKUP_CLEAR_P1 (Bit 8)              */
#define WAKEUP_WKUP_CLEAR_0_REG_WKUP_CLEAR_P1_Msk (0xff00UL)            /*!< WAKEUP WKUP_CLEAR_0_REG: WKUP_CLEAR_P1 (Bitfield-Mask: 0xff) */

/* ---------------------------  WAKEUP_WKUP_CLEAR_1_REG  -------------------------- */
#define WAKEUP_WKUP_CLEAR_1_REG_WKUP_CLEAR_P2_Pos (0UL)                 /*!< WAKEUP WKUP_CLEAR_1_REG: WKUP_CLEAR_P2 (Bit 0)              */
#define WAKEUP_WKUP_CLEAR_1_REG_WKUP_CLEAR_P2_Msk (0x1fUL)              /*!< WAKEUP WKUP_CLEAR_1_REG: WKUP_CLEAR_P2 (Bitfield-Mask: 0x1f) */

/* ---------------------------  WAKEUP_WKUP_CLEAR_2_REG  -------------------------- */
#define WAKEUP_WKUP_CLEAR_2_REG_WKUP_CLEAR_P3_Pos (0UL)                 /*!< WAKEUP WKUP_CLEAR_2_REG: WKUP_CLEAR_P3 (Bit 0)              */
#define WAKEUP_WKUP_CLEAR_2_REG_WKUP_CLEAR_P3_Msk (0xffUL)              /*!< WAKEUP WKUP_CLEAR_2_REG: WKUP_CLEAR_P3 (Bitfield-Mask: 0xff) */
#define WAKEUP_WKUP_CLEAR_2_REG_WKUP_CLEAR_P4_Pos (8UL)                 /*!< WAKEUP WKUP_CLEAR_2_REG: WKUP_CLEAR_P4 (Bit 8)              */
#define WAKEUP_WKUP_CLEAR_2_REG_WKUP_CLEAR_P4_Msk (0xff00UL)            /*!< WAKEUP WKUP_CLEAR_2_REG: WKUP_CLEAR_P4 (Bitfield-Mask: 0xff) */

/* -------------------------  WAKEUP_WKUP_SEL_GPIO_P0_REG  ------------------------ */
#define WAKEUP_WKUP_SEL_GPIO_P0_REG_WKUP_SEL_GPIO_P0_Pos (0UL)          /*!< WAKEUP WKUP_SEL_GPIO_P0_REG: WKUP_SEL_GPIO_P0 (Bit 0)       */
#define WAKEUP_WKUP_SEL_GPIO_P0_REG_WKUP_SEL_GPIO_P0_Msk (0xffUL)       /*!< WAKEUP WKUP_SEL_GPIO_P0_REG: WKUP_SEL_GPIO_P0 (Bitfield-Mask: 0xff) */

/* -------------------------  WAKEUP_WKUP_SEL_GPIO_P1_REG  ------------------------ */
#define WAKEUP_WKUP_SEL_GPIO_P1_REG_WKUP_SEL_GPIO_P1_Pos (0UL)          /*!< WAKEUP WKUP_SEL_GPIO_P1_REG: WKUP_SEL_GPIO_P1 (Bit 0)       */
#define WAKEUP_WKUP_SEL_GPIO_P1_REG_WKUP_SEL_GPIO_P1_Msk (0xffUL)       /*!< WAKEUP WKUP_SEL_GPIO_P1_REG: WKUP_SEL_GPIO_P1 (Bitfield-Mask: 0xff) */

/* -------------------------  WAKEUP_WKUP_SEL_GPIO_P2_REG  ------------------------ */
#define WAKEUP_WKUP_SEL_GPIO_P2_REG_WKUP_SEL_GPIO_P2_Pos (0UL)          /*!< WAKEUP WKUP_SEL_GPIO_P2_REG: WKUP_SEL_GPIO_P2 (Bit 0)       */
#define WAKEUP_WKUP_SEL_GPIO_P2_REG_WKUP_SEL_GPIO_P2_Msk (0x1fUL)       /*!< WAKEUP WKUP_SEL_GPIO_P2_REG: WKUP_SEL_GPIO_P2 (Bitfield-Mask: 0x1f) */

/* -------------------------  WAKEUP_WKUP_SEL_GPIO_P3_REG  ------------------------ */
#define WAKEUP_WKUP_SEL_GPIO_P3_REG_WKUP_SEL_GPIO_P3_Pos (0UL)          /*!< WAKEUP WKUP_SEL_GPIO_P3_REG: WKUP_SEL_GPIO_P3 (Bit 0)       */
#define WAKEUP_WKUP_SEL_GPIO_P3_REG_WKUP_SEL_GPIO_P3_Msk (0xffUL)       /*!< WAKEUP WKUP_SEL_GPIO_P3_REG: WKUP_SEL_GPIO_P3 (Bitfield-Mask: 0xff) */

/* -------------------------  WAKEUP_WKUP_SEL_GPIO_P4_REG  ------------------------ */
#define WAKEUP_WKUP_SEL_GPIO_P4_REG_WKUP_SEL_GPIO_P4_Pos (0UL)          /*!< WAKEUP WKUP_SEL_GPIO_P4_REG: WKUP_SEL_GPIO_P4 (Bit 0)       */
#define WAKEUP_WKUP_SEL_GPIO_P4_REG_WKUP_SEL_GPIO_P4_Msk (0xffUL)       /*!< WAKEUP WKUP_SEL_GPIO_P4_REG: WKUP_SEL_GPIO_P4 (Bitfield-Mask: 0xff) */


/* ================================================================================ */
/* ================          struct 'WDOG' Position & Mask         ================ */
/* ================================================================================ */


/* ------------------------------  WDOG_WATCHDOG_REG  ----------------------------- */
#define WDOG_WATCHDOG_REG_WDOG_VAL_Pos        (0UL)                     /*!< WDOG WATCHDOG_REG: WDOG_VAL (Bit 0)                         */
#define WDOG_WATCHDOG_REG_WDOG_VAL_Msk        (0xffUL)                  /*!< WDOG WATCHDOG_REG: WDOG_VAL (Bitfield-Mask: 0xff)           */
#define WDOG_WATCHDOG_REG_WDOG_VAL_NEG_Pos    (8UL)                     /*!< WDOG WATCHDOG_REG: WDOG_VAL_NEG (Bit 8)                     */
#define WDOG_WATCHDOG_REG_WDOG_VAL_NEG_Msk    (0x100UL)                 /*!< WDOG WATCHDOG_REG: WDOG_VAL_NEG (Bitfield-Mask: 0x01)       */
#define WDOG_WATCHDOG_REG_WDOG_WEN_Pos        (9UL)                     /*!< WDOG WATCHDOG_REG: WDOG_WEN (Bit 9)                         */
#define WDOG_WATCHDOG_REG_WDOG_WEN_Msk        (0xfe00UL)                /*!< WDOG WATCHDOG_REG: WDOG_WEN (Bitfield-Mask: 0x7f)           */

